["{\"name\":\"Another Round\",\"rating\":0.0,\"comment\":\"While I can imagine some scenarios where this white sorcery would be really powerful, it’s just far too situational and the majority of decks should never touch it. If you find a good use for it, then be my guest, but it won’t be doing all that much most of the time.\"}","{\"name\":\"Archangel of Tithes\",\"rating\":2.5,\"comment\":\"This is such a weird reprint from Magic Origins. It’s not particularly good, it’s just annoying. If you get to play this angel, it’ll certainly make an impact, but a triple white casting cost for an annoyance that can be easily killed isn’t something I’m that excited by. It’s a strong white creature, but it won’t be game-changing.\"}","{\"name\":\"Armored Armadillo\",\"rating\":1.0,\"comment\":\"My instinct tells me this will be an aggressive format. If that’s the case, this card should be fine, just not a premium 1-drop. We saw the same thing play out with Brokers Initiate and I assume this will be similar.\"}","{\"name\":\"Aven Interrupter\",\"rating\":3.0,\"comment\":\"A nice bit of disruption slapped onto a Wind Drake at flash speed is something I’m very interested in. Disrupting the timing of a spell and forcing your opponent to recast it on a later turn could be just enough to buy you a turn or two. When you’re trying to win a race, that could be all you need to swing the game in your favor.\"}","{\"name\":\"Bounding Felidar\",\"rating\":0.5,\"comment\":\"6 mana is the most replaceable slot on your curve and most decks don’t even need to bother playing anything that expensive. Given that, you need your 6s to make a huge impact, which this kitty sadly fails to do. It’s just about playable, but most decks won’t care about it.\"}","{\"name\":\"Bovine Intervention\",\"rating\":0.5,\"comment\":\"The name is awesome and on point, but the card is just bad. Yeah, it’s cool to destroy any creature, but replacing it with a 2/2 isn’t good enough. Every version of this removal spell has been bad and I don’t see any reason to think this will be any different.\"}","{\"name\":\"Bridled Bighorn\",\"rating\":1.5,\"comment\":\"While its stats are a little below par, generating creature tokens is a really solid ability on attacking, which should make this a reasonable playable for the middle of your curve.\"}","{\"name\":\"Claim Jumper\",\"rating\":2.5,\"comment\":\"Great stats plus a bit of mana acceleration when going second makes this look like a great card to me. Sure, it’s not going to be winning any games for you by itself, but it’s a solid little critter who’d be at home in any white deck in the format.\"}","{\"name\":\"Dust Animus\",\"rating\":4.0,\"comment\":\"This card is so cheap that it has to be good, whether you just run it out on turn 2 as a 2/3 flier, plot it for 2 and then get a free 4/5 lifelink flier on turn 5, or even just topdeck it on 7 mana and cast it as a 4/5 for 2. All of these options would be great on their own and the combination of any or all of them is even better.\"}","{\"name\":\"Final Showdown\",\"rating\":4.0,\"comment\":\"This is exactly the kind of thing I want to see in a spree spell. 2 mana for a protection spell or 6 mana for an instant-speed board wipe. Better yet, 7 mana for both at the same time. Love it. The flexibility of this card is what sells it and I think we can expect it to be a very strong card in the format.\"}","{\"name\":\"Frontier Seeker\",\"rating\":3.5,\"comment\":\"We only recently saw a format where Staunch Crewmate was among the best cards in the set. The simple fact is that a 2/1 for 2 that replaces itself with something good is extremely strong. With eight or nine Plains in your deck plus a few mounts, I’m sure this effect will hit a lot more often than it misses. Even then, the failsafe is that it’s still a defensible 2-drop and that’s precisely what makes this great.\"}","{\"name\":\"Getaway Glamer\",\"rating\":1.5,\"comment\":\"A spell that can either flicker something or destroy the biggest creature on board is a little too situational in my eyes. Still, the option of one or the other or potentially both does make this somewhat appealing, you just need the right setup to properly use it.\"}","{\"name\":\"High Noon\",\"rating\":0.5,\"comment\":\"This is a really funny and clever design, but it’s not something I think we care about. Hosing the double-spell archetype isn’t worth a whole card and paying a total of 7 mana across two colors just to deal 5 direct damage to something isn’t great. It could be used to burn off a player, but I don’t think it’s good enough just for that.\"}","{\"name\":\"Holy Cow\",\"rating\":2.0,\"comment\":\"Flavor: 10/10\"}","{\"name\":\"Inventive Wingsmith\",\"rating\":1.0,\"comment\":\"This dwarven artificer is hardly the biggest payoff for the flash deck, but it’s still fine. A 2/4 flier for 3 mana is a decent rate, even if you have to put a little bit of effort in first.\"}","{\"name\":\"Lassoed by the Law\",\"rating\":3.5,\"comment\":\"Getting a free creature is right up there as far as upsides on Oblivion Rings go. This white enchantment is about as good as white removal can get, so it should really be a high priority in the format.\"}","{\"name\":\"Mystical Tether\",\"rating\":3.0,\"comment\":\"Speaking of Oblivion Rings with upsides, we get another one right away. This is also good, since it can exile most of the permanents we’d want to in the first place and having the ability to gain flash makes it a lot more flexible.\"}","{\"name\":\"Nurturing Pixie\",\"rating\":3.0,\"comment\":\"What’s great about this faerie is that it’s perfectly reasonable to throw it onto the board on turn 1 and start beating down, yet when you draw it later it has the potential to give you a bunch of extra value. This just looks great and I can’t imagine any white deck will want to pass it up.\"}","{\"name\":\"Omenport Vigilante\",\"rating\":2.0,\"comment\":\"If you haven’t committed a crime, is your opponent ever going to block or attack into this in the early game? There are plenty of ways to commit crimes at instant speed, making this pretty difficult to tussle with. It’s a little on the small side to make a lasting impact, but it still looks like a great way to start your curve.\"}","{\"name\":\"One Last Job\",\"rating\":0.5,\"comment\":\"While I like the potential of being able to reanimate two creatures for 6 mana, that’s still a very situational effect that I don’t want to dedicate a slot in my deck to. This is flexible enough that I’m sure the right deck would love to give it a try, but most of the time it won’t be good enough.\"}","{\"name\":\"Outlaw Medic\",\"rating\":1.5,\"comment\":\"After all the aggressive formats we’ve had, it’s nice to see a sweet little defensive 2-drop for a change. Yet funnily enough, lifelink is so valuable that the right aggressive deck might want it too, especially if it had some good ways to buff it.\"}","{\"name\":\"Prairie Dog\",\"rating\":3.0,\"comment\":\"A 2/2 lifelink is something every white deck is going to actively want, yet on top of that it has a built-in way to grow itself every turn. Not every deck will be able to take full advantage of that, but there will still be plenty of turns where it would be best to pass with no plays, which ends up growing your squirrel, so having the option there is just great.\"}","{\"name\":\"Prosperity Tycoon\",\"rating\":3.0,\"comment\":\"The story of Murders at Karlov Manor was that two creatures from one card is a great deal. That’s still the case, even though this human noble is a little on the fragile side. The indestructible ability is a bit too pricey, but the threat of being able to activate it should be enough to dissuade bad blocks or even attacks into it.\"}","{\"name\":\"Requisition Raid\",\"rating\":0.5,\"comment\":\"Being a split card of Disenchant and Basri's Solidarity isn’t enough to make this maindeckable. It’s really nice that you get access to all the modes and can combine them, but this is still going to be sideboard material at best.\"}","{\"name\":\"Rustler Rampage\",\"rating\":1.0,\"comment\":\"Combat tricks that don’t give any stat boosts are pretty hard to justify, even when they can untap your creatures and/or grant double strike. I can think of plenty of scenarios where this is ridiculous and can swing an entire game in your favor, but they rarely happen and are difficult to set up, so I don’t think this is something I actively want. Still, it has good potential and could kill an opponent out of nowhere.\"}","{\"name\":\"Shepherd of the Clouds\",\"rating\":3.5,\"comment\":\"Have you ever wondered what a mutant baby of Gravedigger and Serra Angel would look like? No? Me neither, but if I had, I wouldn’t expect it to look this glorious. This is a great card and the perfect 5-drop to top out your curve. You don’t need mounts in your deck to make this good, you just need to want to trade off creatures before it hits the table, which should be something you’ll do naturally.\"}","{\"name\":\"Sheriff of Safe Passage\",\"rating\":1.0,\"comment\":\"Unless you’re getting a 4/4 or bigger, this knight isn’t going to be worth playing. I think the only chance I have of playing this is in a deck like blue/white flash which can make full use of the plot ability, but I’m only ever expecting it to be a 2-mana investment for a 2/2 or a 3/3 that works with my deck’s theme.\"}","{\"name\":\"Stagecoach Security\",\"rating\":2.0,\"comment\":\"I generally like these kinds of cards, giving you a mini Overrun effect while also contributing to the board. This seems like a good way to top your curve when you’re aggressive, while not being something I’d want in a slower deck.\"}","{\"name\":\"Steer Clear\",\"rating\":1.5,\"comment\":\"Righteous Blow is a card I’ve always rated a fair bit higher than most other players. Probably just because I like playing slow decks and this is a great way to deal with early aggression. You’re not all that likely to be able to make use of the extra damage from controlling a mount, but I suppose it couldn’t hurt.\"}","{\"name\":\"Sterling Keykeeper\",\"rating\":1.0,\"comment\":\"2 mana to activate a Master Decoy isn’t too bad, but it still seems a bit too expensive for me to be too excited. Still, it’s a 2/2 for 2 so you can’t go too wrong by playing this, and it’ll make an impact later in the game.\"}","{\"name\":\"Sterling Supplier\",\"rating\":1.5,\"comment\":\"Cards like this have dropped off in recent years, but I still think this is a fine playable. I don’t think it’s the better of white’s common 5-drops, but you wouldn’t be unhappy if you needed to play it.\"}","{\"name\":\"Take Up the Shield\",\"rating\":2.5,\"comment\":\"This white instant was the best white common in Dominaria United and often the entire reason to play white in that format. It’s one of white’s best-ever combat tricks, protecting your creatures from removal and winning you races thanks to lifelink. It just does everything and I’m really happy to see it back. Take as many of these as you can get and you’ll soon see the benefits.\"}","{\"name\":\"Thunder Lasso\",\"rating\":3.5,\"comment\":\"Creatures like Master of Diversion and Territorial Hammerskull have been so powerful in past formats and they’re exactly the kind of card I like to play in aggro decks. Putting that ability on an incredibly well-costed equipment on top of getting your first equip for free is just awesome. This has the potential to completely take over a game, which is really saying something for an equipment.\"}","{\"name\":\"Trained Arynx\",\"rating\":1.5,\"comment\":\"Everything about this reads like a solid 2-drop that nearly every aggressive deck will want to prioritize. Being a mount makes it even better and something that’ll be invaluable to the green/white deck in the format.\"}","{\"name\":\"Vengeful Townsfolk\",\"rating\":2.0,\"comment\":\"Cards like Unruly Mob and Rising Populace have been extremely strong when setup correctly, but have always been held back a little by their very small starting size. This new version is bigger upfront but has a weaker trigger, which I think is a nice touch that makes this a much more attractive prospect for most decks and will allow it to see a lot more play.\"}","{\"name\":\"Wanted Griffin\",\"rating\":1.5,\"comment\":\"It’s hard to admit, but a 3/2 flier for 4 mana isn’t quite the powerhouse it once was. But with a good enough ability like this griffin has, it’s bound to be reasonably playable for the middle of your curve.\"}","{\"name\":\"Canyon Crab\",\"rating\":2.0,\"comment\":\"Crab rave! This guy looks like he’s having a great time. It’s honestly a decent card as well, as a strong defensive play that can turn into an aggressive option when the coast is clear and you need to close out a game.\"}","{\"name\":\"Daring Thunder-Thief\",\"rating\":1.5,\"comment\":\"It’s so weird seeing a 4/4 for 4 in blue with not much of a downside. Still, here we are. This is really solid and I think it should be a premium common to pick up for the flash deck.\"}","{\"name\":\"Deepmuck Desperado\",\"rating\":2.0,\"comment\":\"Ok, so hear me out. If you have a bunch of ways to commit crimes and/or access to a couple of these, then I think this is a legitimate win condition. Three cards doesn’t sound like much, but if it’s fairly easy to trigger turn after turn then that should add up quickly. You only need about nine triggers in total and that shouldn’t be too difficult to accomplish with the right set up. A mill deck also seems very possible if you can get Archive Trap or Grindstone off of the bonus sheet.\"}","{\"name\":\"Double Down\",\"rating\":2.0,\"comment\":\"I’ve never liked these types of enchantments, but both Necroduality and Vesuvan Duplimancy ended up being pretty solid build-around cards in their respective formats. This will be just as difficult to play, but if you can surround this blue enchantment with the right deck it should win you a few games.\"}","{\"name\":\"Duelist of the Mind\",\"rating\":3.0,\"comment\":\"Nathan Steuer’s World Champion card hits pretty damn hard. You only need to commit a crime to be hitting with a 2-power flier on turn 3 and other card-draw spells can make this blue creature really pop off.\"}","{\"name\":\"Emergent Haunting\",\"rating\":3.0,\"comment\":\"If you have the right deck for it, this is barely different from a 3/3 flier for just 2 mana, and all you need to do to make it work is spend a turn leaving instants open or plotting something. That sounds great to me, even with the 1-turn delay it requires.\"}","{\"name\":\"Failed Fording\",\"rating\":1.5,\"comment\":\"Bounce spells are always fine and plenty of decks are happy to play one just to have access to a bit of interaction. It’s nice that this blue instant commits a crime too, and the desert payoff is a very welcome free bonus.\"}","{\"name\":\"Fleeting Reflection\",\"rating\":0.5,\"comment\":\"This is a really weird card that blends a bunch of fairly disparate effects together while not being all that good at any of them. I know I’ll get blown out by this somewhere down the line, but that’s not enough to make me want to play it until I’m proven wrong.\"}","{\"name\":\"Geyser Drake\",\"rating\":1.5,\"comment\":\"Soaring Drake saw a decent amount of play back in Dominaria United and this drake is quite a bit better. The flash deck looks like it’s coming together nicely and while this isn’t something you’d need to prioritize for it, it should slot in very easily.\"}","{\"name\":\"Harrier Strix\",\"rating\":1.5,\"comment\":\"The days of Zephyr Sprite really are gone, aren’t they? You know, I once topped a Legacy tournament with that card… Well, this bird should be a fine playable for an aggressive blue deck. The triggered ability is really nice to help apply extra pressure when you draw it later in the game, and why not have some free looting while we’re at it?\"}","{\"name\":\"Jace Reawakened\",\"rating\":1.5,\"comment\":\"Jace is back as the first 2-mana planeswalker we’ve had for quite some time. As such, it’s really not that good. While these abilities are somewhat desirable, Jace does absolutely nothing to impact the board. Most importantly, this OTJ planeswalker doesn’t do anything to defend itself, meaning you might end up having it absorb a bit of damage for you and just looting once, which doesn’t make for a winning play. Jace was not designed with Limited play in mind and it kind of shows.\"}","{\"name\":\"Jailbreak Scheme\",\"rating\":1.5,\"comment\":\"Time Ebb with upside should still be a fine card, even in today’s economy. Tacking on a mediocre unblockable trick seems weak at first glance, but the combination of both abilities on the same blue sorcery makes for a potentially game-winning trick when you get to 6 mana, so keep an eye out for that.\"}","{\"name\":\"Loan Shark\",\"rating\":1.5,\"comment\":\"Given that Loan Shark itself can be the second spell you’ve cast, it shouldn’t be too hard to enable, and I’m very interested in playing a 3/4 that draws a card when it enters. Pretty great name too.\"}","{\"name\":\"Marauding Sphinx\",\"rating\":3.0,\"comment\":\"This is a really big and burly creature for the mana you’re spending. 5 toughness plus Ward 2 makes for a combination that’s really hard for many players to deal with efficiently, but flying and vigilance take it over the top and make it so this sphinx will frequently dominate the board.\"}","{\"name\":\"Metamorphic Blast\",\"rating\":3.0,\"comment\":\"Blue combat tricks tend to suck. But blue combat tricks that have the option of being cashed in for two cards while doing something else sound really strong to me. 5 mana nets you what will often be a removal spell that drew you two cards, which is just absurdly good and makes me want to actively play blue.\"}","{\"name\":\"Nimble Brigand\",\"rating\":2.5,\"comment\":\"We haven’t seen an Ophidian variant for quite some time and yet this might be one of the best we’ve ever seen. Committing crimes should be fairly easy to do and your reward is a guaranteed hit and a free card. Even without committing crimes, this should still get through on some boards and make it difficult for your opponent to leave themselves open too often.\"}","{\"name\":\"Outlaw Stitcher\",\"rating\":3.5,\"comment\":\"4 mana for a 1/4 plus a 2/2 would already be great and this would be one of blue’s better cards if it was just that. The addition of plot and the potential for the token to be much bigger push it over the top. I think the most ideal scenario is to simply plot something else on turn 3, then on turn 4 cast your free spell, followed by this as your 4-drop, making the zombie a 4/4.\"}","{\"name\":\"Peerless Ropemaster\",\"rating\":1.0,\"comment\":\"Man-o'-War might be a great card, but a more expensive and more situational one isn’t exactly what we’re looking for. This is a fine playable, but not one I would expect to always hit when I wanted it to.\"}","{\"name\":\"Phantom Interference\",\"rating\":2.5,\"comment\":\"I’ve been coming around a little bit on Quench variants lately, only to be gifted with what might be the best one we’ve ever seen, though it would take a lot to knock Miscalculation off of its top spot for this type of blue counterspell. The fact is, my situational 2-mana counter can be cashed in as a 4-mana 2/2 with flash and flying and that’s an awesome trade to have. Better yet, you might be lucky enough to play both modes and get a huge blowout. This is bound to be one of blue’s best commons, if not the best.\"}","{\"name\":\"Plan the Heist\",\"rating\":2.0,\"comment\":\"I’ve always been a fan of Concentrate, so I’m very pleased to see a strictly better version here. The only thing I’m skeptical of is whether the format will be slow enough to allow you to take your time casting it. Assuming that lines up, I really like this and want to draft as many of them as I can.\"}","{\"name\":\"Razzle-Dazzler\",\"rating\":0.5,\"comment\":\"2 mana for a 1/2 just isn’t good enough. The trigger is really nice, it’s just not reliable and isn’t likely to happen too early in the game. This wizard needs to be a little bigger upfront to be worth playing, but as it is, I don’t think it’ll be good enough.\"}","{\"name\":\"Seize the Secrets\",\"rating\":1.5,\"comment\":\"I do love casting a Divination or two. Even better when they have the potential to cost 2 mana. That cost reduction should help you line up good turns, for example, being on 6 mana and getting to use a 4-mana removal spell followed by this.\"}","{\"name\":\"Shackle Slinger\",\"rating\":1.0,\"comment\":\"I was expecting a better payoff from an uncommon that works with one of the set’s themes. Double-spelling is hard enough to do that I want my payoffs to make sense for the amount of effort I’ve put in and tapping a creature for the turn or putting a stun counter on something is nowhere near enough to pique my interest.\"}","{\"name\":\"Shifting Grift\",\"rating\":1.5,\"comment\":\"This mostly looks like a plant for Commander, but a 4-mana Switcheroo could be reasonable to play. After all, swapping your crappy 1/1 for their game-winning bomb is certainly appealing. That’s still situational enough that this isn’t going to be too high of a priority most of the time.\"}","{\"name\":\"Slickshot Lockpicker\",\"rating\":2.5,\"comment\":\"It’s pretty funny how similar this is to Snapcaster Mage, though in the context of Limited it’s a pretty situational effect. You need enough spells in your deck to make this viable and you ideally need spells good enough to want to flashback. Still, if you have all of these working for you, this should be a powerful creature.\"}","{\"name\":\"Slickshot Vault-Buster\",\"rating\":1.5,\"comment\":\"I would look at this as a pesky defensive creature that your opponent will find very difficult to brawl with. They can’t attack their 3/3 into it or you’ll just commit a crime and block it. Vigilance even helps it get in a bunch of free attacks that can’t be blocked thanks to the threat of growing larger.\"}","{\"name\":\"Spring Splasher\",\"rating\":1.0,\"comment\":\"Ugh, no thanks. We’ve seen a few of this kind of effect before and they’ve never been particularly good. If blue was interested in aggressive 2-drops then maybe, but it generally isn’t.\"}","{\"name\":\"Step Between Worlds\",\"rating\":0.5,\"comment\":\"It’s been a while since we saw a Timetwister variant pop up in a set, but it’s not likely to make any waves in this form. This simply isn’t an effect that we care too much about in Limited, even if we set up for it. Might be funny to play with Duelist of the Mind though.\"}","{\"name\":\"Stoic Sphinx\",\"rating\":3.0,\"comment\":\"I love having access to big flash creatures like this. Not only will the flash deck itself be interested in it, but any deck can flash this out of nowhere, and with 5 power it should end most games in very short order.\"}","{\"name\":\"Stop Cold\",\"rating\":1.5,\"comment\":\"Well, Capture Sphere is back. It’s probably fine in this set, especially if the flash deck is a thing, and it does have the upside of removing all abilities from the enchanted creature too. Still, cards like this have really fallen out of favor in recent sets and that trend is likely to continue.\"}","{\"name\":\"Take the Fall\",\"rating\":2.5,\"comment\":\"Chilling Trap was among the best commons in Zendikar Rising and I imagine this will be the same. Linking the need for a creature type to the amount it shrinks its target makes this a much better card overall. It means that even without any outlaws, this can still give -1/-0 and draw a card, which is still capable of getting a two-for-one blowout. You can even cantrip it away if you really need to. This is just awesome and I’d pick up as many as I could find for any blue deck.\"}","{\"name\":\"The Key to the Vault\",\"rating\":0.0,\"comment\":\"The payoff sounds big, but the cost is far too high. 5 mana in total and you still have to connect with your opponent to get a trigger which might end up missing. And it doesn’t do anything to help you connect, so having the right creature out is your job. And, having spent 5 mana to set it up, getting less than 5 mana’s worth of a spell just isn’t worth it, so you’ll probably need to connect multiple times to actually get paid off. Just… no thank you.\"}","{\"name\":\"Three Steps Ahead\",\"rating\":2.5,\"comment\":\"I do love how flexible all of these spree spells are. Here, we start with the base rate of being a split card of Cancel or Catalog, which is fine, but you also get the option of playing them both at the same time, which can be a huge blowout. The token copy mode is a little out of place, but also a great option to combine with the others for extra value. 8 mana to choose all three modes is unlikely to happen, but I can’t imagine losing a game if it works.\"}","{\"name\":\"Visage Bandit\",\"rating\":2.0,\"comment\":\"We’ve seen quite a few cards in blue with powerful abilities that key off of double spelling or not casting spells from the hand. I like that with a fairly cheap plot cost, this cloning shapeshifter should be able to efficiently copy all sorts of creatures while easily triggering their abilities. It’s a touch situational, but there should be enough potential here to make it worth playing in certain decks.\"}","{\"name\":\"Ambush Gigapede\",\"rating\":1.0,\"comment\":\"What a weird card. It looks so bad to have a 6-drop with 2 toughness, but like the name would suggest, it does seem entirely plausible to use this insect to ambush a larger attacker while shrinking or straight up killing another one. That’s fine, though very situational and I’m not keen on 6-drops that are only situationally good.\"}","{\"name\":\"Binding Negotiation\",\"rating\":1.5,\"comment\":\"Straight up 2 mana for a Thoughtseize is pretty decent. It’s not an effect we particularly like in Limited, but having it at 2 mana makes it cheap enough that we can slot it into our curve a lot more easily than something like Coercion.\"}","{\"name\":\"Blacksnag Buzzard\",\"rating\":1.5,\"comment\":\"If this is just a 2/1 flier then it’s very below rate for a 3-drop. The cheap plot cost and the ability for this to sometimes be a 3/2 make this playable, even if it’s a bit situational.\"}","{\"name\":\"Blood Hustler\",\"rating\":1.0,\"comment\":\"While committing a crime should be trivial to do, this card isn’t good enough unless you can commit several crimes, which doesn’t seem like something you can do all that reliably. The activated ability is nice, since it does commit a crime, but it’s pretty expensive and you won’t be winning many games by committing all of your mana to it and playing no spells.\"}","{\"name\":\"Boneyard Desecrator\",\"rating\":1.0,\"comment\":\"We’ve seen plenty of variations on this design, such as Novice Dissector and Vito's Inquisitor and they have always been bad. This one is quite a bit better than the others, as it’s a defensible creature on its own, but I’m not sold. I’ll probably regret rating it as highly as I have.\"}","{\"name\":\"Caustic Bronco\",\"rating\":3.5,\"comment\":\"A 2/2 that always draws you a card when it attacks sounds really dangerous. Of all the 2-drops to face down on turn 2, this feels the most dangerous. Worse yet if they can begin saddling it, as you might end up taking extra damage too. It’s a little fragile and you can outclass it pretty easily, but it’s also something that you must kill on sight or it’ll take over a game.\"}","{\"name\":\"Consuming Ashes\",\"rating\":3.0,\"comment\":\"It’s sad that removal has gotten weaker in recent sets. 4 mana removal just lines up very poorly against powerful 1- or 2-mana creatures. That being said, this set doesn’t look all that aggressive, and the unconditional removal that this black instant provides is still good enough.\"}","{\"name\":\"Corrupted Conviction\",\"rating\":1.5,\"comment\":\"Village Rites is usually solid in the right deck and there are some tools available to build a sacrifice deck of some kind. It’s so cheap and you can use it to sacrifice something in response to removal, so it should find a home in some decks.\"}","{\"name\":\"Desperate Bloodseeker\",\"rating\":2.0,\"comment\":\"A 2/2 lifelinker for 2 is already great, but tacking on a bit of free mill is so much better. You can target yourself and fill your graveyard or just target your opponent and commit a crime. It lacks a relevant creature type, but it’s very solid.\"}","{\"name\":\"Fake Your Own Death\",\"rating\":0.5,\"comment\":\"These effects are rarely any good and this is just too clunky at 2 mana. We saw the same card in Streets of New Capenna and it saw no play there. I doubt this set will change that up.\"}","{\"name\":\"Forsaken Miner\",\"rating\":2.5,\"comment\":\"This is pretty interesting. A 2/2 for 1 mana is obviously quite aggressive and it seems trivially easy to bring it back at some point. Not being able to block is a significant downside, so slower decks are unlikely to want this, but if you had ways to sacrifice it and bring it back over and over then it could be very valuable.\"}","{\"name\":\"Hollow Marauder\",\"rating\":3.5,\"comment\":\"This has the potential to be completely broken. If you ever get to cast this as a 1-drop 4/2 flier that makes your opponent discard a card and you draw a card… I can’t imagine much better. Of course, you do have to enable that and this will often cost a lot more than just 1 mana, but it only needs to get to about 4 mana for me to be very happy to play it and that doesn’t seem too difficult to do.\"}","{\"name\":\"Insatiable Avarice\",\"rating\":0.5,\"comment\":\"I would love to cast a 3-mana spell that draws 3 cards, but triple black seems prohibitively hard to cast. The first mode is also unbelievably bad and something I would only ever do if I was casting this for 5 mana. Overall, while this card is good, the mana cost is just too costly and you should generally not bother.\"}","{\"name\":\"Lively Dirge\",\"rating\":0.0,\"comment\":\"I don’t think any deck is going to really want either of these effects. 4 mana to renimate 4 mana’s worth of creatures isn’t a winning play and neither is a 3-mana Entomb. 5 mana for both isn’t a good enough out to make up for it. All the options are just weak and you probably shouldn’t touch this black sorcery.\"}","{\"name\":\"Neutralize the Guards\",\"rating\":1.5,\"comment\":\"-1/-1 to creatures is usually too situational, but I think this has enough going for it. Firstly, it only affects your opponent’s creatures, which combined with being an instant, turns this into a pretty reasonable combat trick. There are also the Mercenary tokens that this neatly sweeps away. Add on Surveil 2 and this probably adds up to a decent card.\"}","{\"name\":\"Nezumi Linkbreaker\",\"rating\":2.0,\"comment\":\"A 1-drop outlaw rat that dies and creates another outlaw sounds awesome to me. Whether you’re sacrificing your creatures or you need plenty of good outlaws, this is definitely a great option.\"}","{\"name\":\"Overzealous Muscle\",\"rating\":1.5,\"comment\":\"I’ve talked about this on previous cards, but the most important factor for this ogre mercenary is probably the threat of activation. If you have your mana up and cards in hand, attacking into this or blocking it is extremely risky, as any instant-speed crime will make it indestructible and win the combat. 5-drops are pretty easy to pick up in Draft, so this might be very replaceable, but it’s a solid playable for the right deck.\"}","{\"name\":\"Pitiless Carnage\",\"rating\":0.0,\"comment\":\"If you’re casting a 4-mana draw spell and not drawing at least three cards, you’re doing something wrong. To do that, you also have to sacrifice at least three permanents? Ok, maybe this could go off if you have a bunch of Treasures or something like that, but it’s so bad in every other scenario that I don’t think this should be anywhere near your main deck.\"}","{\"name\":\"Rakish Crew\",\"rating\":3.5,\"comment\":\"I love this black enchantment. Bastion of Remembrance is an incredible card and this is only a bit worse. If you’re a dedicated outlaws deck then there’s virtually no difference, so this seems like the perfect build-around payoff for being in that deck.\"}","{\"name\":\"Rattleback Apothecary\",\"rating\":2.0,\"comment\":\"This isn’t exactly the biggest reward for committing a crime, but it’s a nice way to help you win damage races. Giving itself menace is pretty nasty, since menace and deathtouch combine very nicely to force your opponent to trade at least two creatures for it in combat.\"}","{\"name\":\"Raven of Fell Omens\",\"rating\":1.5,\"comment\":\"Yay, it’s Storm Crow! Having this in play early and pecking away at your opponent whenever you commit a crime is bound to add up quickly. The card is so weak that it’ll hurt for your opponent to have to kill it, but the life loss will start to add up and it also keeps you alive, so eventually they’ll just have to pull the trigger on it.\"}","{\"name\":\"Rictus Robber\",\"rating\":3.0,\"comment\":\"Even if it requires some work, a 4/3 plus a 2/2 is incredible for just 4 mana. Having a creature die isn’t trivial, but you could always attack, see if your opponent wants to trade off, then play this postcombat when they do. You can also plot it and then enable it with some kind of sacrifice outlet. However you play it, this gives you so much value that it’s worth aiming for.\"}","{\"name\":\"Rooftop Assassin\",\"rating\":1.0,\"comment\":\"This triggered ability has proven to be a little too hard to set up for the most part. Plan B is an overcosted lifelink flier, meaning you really have to get the most out of the trigger and that just isn’t going to line up all that often.\"}","{\"name\":\"Rush of Dread\",\"rating\":0.0,\"comment\":\"I hate the idea of playing any card with no guarantees as to what it actually does. Unless your opponent has exactly one creature in play, you’ll never be able to kill their best creature. Unless they have exactly one card left in hand, you’ll never discard their best card. On top of that, every mode is really expensive to cast? I don’t think so.\"}","{\"name\":\"Servant of the Stinger\",\"rating\":2.0,\"comment\":\"What a weird trigger. I’m already happy with my 1/3 deathtouch creature for just 2 mana. Being able to randomly cash it in for any card in your deck is definitely something you could make use of in the late game. After all, your opponent needs to block it with a very real creature to get an even trade for it, so it should be free to attack in most situations.\"}","{\"name\":\"Shoot the Sheriff\",\"rating\":3.5,\"comment\":\"Excluding tokens, approximately 44% of the creatures in the set are outlaws. That’s quite a lot, but it does mean that this should still find plenty of targets against most decks. Don’t be afraid to side it out against a dedicated outlaws deck, but at the same time, there aren’t enough of them to put me off wanting a clean 2-mana removal spell.\"}","{\"name\":\"Skulduggery\",\"rating\":2.0,\"comment\":\"Skulduggery is one of black’s best cheap combat tricks. The base rate lets you pump your creature and shrink theirs, letting your 2/2 beat a 3/3 for example. But you also get the option of pumping your creature while straight up killing one of theirs, which gives it the potential for a really easy two-for-one. I’m always on the lookout for cards with this ability and to have one for 1 mana is particularly special.\"}","{\"name\":\"Tinybones Joins Up\",\"rating\":0.0,\"comment\":\"All this really amounts to is a 1-mana spell that makes your opponent discard a card. That’s literally it. That’s nowhere near good enough since you’ve also spent a card. In fact, casting this might actually make you less likely to win, since you’ve used a spell and a mana while your opponent has discarded a land. Please don’t play it, for your sake.\"}","{\"name\":\"Treasure Dredger\",\"rating\":1.5,\"comment\":\"This looks fairly good, but the play pattern doesn’t line up too well. Say you play this on turn 2. You can’t make a Treasure and play a 3-drop on turn 3, and your reward is you get to play a 5-drop on turn 4? If you can make use of the Treasures each turn then this card’s value goes up, but the general case doesn’t look very good. It’s still a 2/2 for 2 I guess, so it’s not the worst thing to play in a vacuum.\"}","{\"name\":\"Unfortunate Accident\",\"rating\":3.5,\"comment\":\"This isn’t just a clean removal spell. This is effectively a 5-drop Ravenous Chupacabra with flash. You can even cash it in for 2 mana and get a token, though I wouldn’t recommend that very often, given the value you could get later. I would also try holding off on casting it for 4 mana if possible, because the free Mercenary is that good to get for just 1 extra mana. I keep saying that two-for-one plays are huge and this is one of the easiest two-for-ones you can get.\"}","{\"name\":\"Unscrupulous Contractor\",\"rating\":3.5,\"comment\":\"We’ve seen this card before in the form of Fell Stinger. It’s a really powerful one. The worst you can do is just have it be a vanilla 3/2 or have it sacrifice itself for two cards. Both options are fine. But then if you can set it up and sacrifice a throwaway token or something, you’ve landed yourself a black Mulldrifter. What a card! Definitely a reason to be drafting a sacrifice deck of some sort.\"}","{\"name\":\"Vault Plunderer\",\"rating\":2.5,\"comment\":\"That appears to be a 3/1 Phyrexian Rager. Rager is already an incredibly solid black common that is often among the best black commons in sets where it’s printed. Printing as a 3/1 instead of a 2/2 isn’t likely to change the equation that much, so I would assume this is one of black’s better commons and just take as many as I could.\"}","{\"name\":\"Brimstone Roundup\",\"rating\":1.5,\"comment\":\"I love build-arounds like this, but given that double spelling is still difficult to do, I’d expect a much bigger payoff for doing it than just a Mercenary token. Remember that you’ve already spent 2-3 mana on this and got nothing back immediately, so until you’ve hit at least two or three tokens back from this, you haven’t even gotten value for your mana yet. I’m excited for the double spell deck in this set, and I’m sure this will be a part of it, but I don’t think it’s anywhere near as good as it should be.\"}","{\"name\":\"Caught in the Crossfire\",\"rating\":2.0,\"comment\":\"Weirdly enough, the flexibility is harming this particular spree spell, because it’s ending up costing 4 mana total to hit every creature if that’s what you need to do. But more often than not, you should be able to find a way to leverage this red instant in your favor and only kill your opponent’s creatures. It’ll be devastating to take out all outlaws when you control no outlaws yourself, particularly against a board of Mercenary tokens.\"}","{\"name\":\"Cunning Coyote\",\"rating\":2.5,\"comment\":\"A 2/2 haste without a downside is no joke. Plot looks a little weird, but it actually benefits you in this case. Plotting on turn 2 and then casting it for free to give your 3-drop haste will result in more damage, so it’s definitely something to consider doing.\"}","{\"name\":\"Deadeye Duelist\",\"rating\":1.0,\"comment\":\"Cards like this let me hold out hope on this set not being too aggressive. Even in a slower set, red decks don’t want to be so slow as to want to resort to this very often. It’s playable, it has reach, and it’s an outlaw, but you’ll cut it more often than not.\"}","{\"name\":\"Demonic Ruckus\",\"rating\":2.5,\"comment\":\"Now this is an aura I can get on board with. Costing 1 mana to plot it allows you to preemptively play this red enchantment at a lot of points on your curve and cast it for free when you find a good opening to resolve it. Even if you just cast it for 2 mana, +1/+1 with menace and trample is a huge buff that can swing combat in your favor, and you get your card back when this inevitably goes to the graveyard. I think this is awesome and I can see it becoming a staple of the format.\"}","{\"name\":\"Discerning Peddler\",\"rating\":1.5,\"comment\":\"Any 2-drop that’s decent to draw later in the game is good in my book. Casting it early allows you to filter your hand and casting it late lets you trade in a useless, excess land for hopefully something castable. Either way this is a good card and a solid 2-drop for any red deck.\"}","{\"name\":\"Explosive Derailment\",\"rating\":2.5,\"comment\":\"3 mana to deal 4 damage to a creature is a perfectly reasonable burn spell. I don’t think you’re likely to need to destroy an artifact, but it's a nice effect to have access to and sometimes you might get to choose both modes for an awesome blowout.\"}","{\"name\":\"Ferocification\",\"rating\":2.0,\"comment\":\"This could easily be a lot stronger than I’m giving it credit for, but for any aggressive deck to spend a turn casting an enchantment and not something that actually affects the board, I think it has to be a lot better than this. It does enable ferocious, allows every creature you play to gain haste, and generally helps your creatures to attack more easily on difficult board states. I just wish it was a creature so it could actually get into the red zone itself.\"}","{\"name\":\"Gila Courser\",\"rating\":3.0,\"comment\":\"A 4/2 creature is pretty easy to block and trade with, which you’ll need to be prepared to do. This is really easy to saddle and doing so lets you draw a card with every attack. On top of that, this enables ferocious by itself, making it at least a great card for the red/green deck.\"}","{\"name\":\"Great Train Heist\",\"rating\":0.5,\"comment\":\"We’ve rarely had access to a spell that gives you an additional combat phase, so I’m not sure how to evaluate it. This really only does something good if you’re already ahead. For 6 mana you can take your extra combat phase and help your creatures to win the first combat, but a lot has to align for this to be a winning play. I’m not sold, so I think I’ll wait to be proved wrong on this one.\"}","{\"name\":\"Hell to Pay\",\"rating\":1.5,\"comment\":\"The ability to deal X damage to a creature is fine, but the fact that this doesn’t hit players is a big downside. Potentially creating a few Treasures isn’t enough to compensate for that. This is a fine card, but honestly, the common burn spells are just better.\"}","{\"name\":\"Hellspur Brute\",\"rating\":2.5,\"comment\":\"5 mana for a 5/4 minotaur with trample would already be fine. Affinity for outlaws pushes this way into the premium playable range. It won’t be hard for this to cost 3-4 mana and if you ever get to cast this for 1 mana it’ll almost feel like cheating.\"}","{\"name\":\"Hellspur Posse Boss\",\"rating\":4.0,\"comment\":\"Now this is an outlaw. 4 mana for 4/6 worth of stats across three bodies and now every other outlaw you play gains haste. It’s a really simple rare but a very powerful one, especially for the outlaws deck.\"}","{\"name\":\"Highway Robbery\",\"rating\":1.0,\"comment\":\"Tormenting Voice definitely has its place in some decks. Thanks to plot, this should slot right into the blue/red deck in particular. Better yet, thanks to being able to sacrifice a land instead, you don’t have to worry so much about holding onto your excess lands for discard fodder. You can also use it if you’re a little short on playables and need to round out your deck.\"}","{\"name\":\"Irascible Wolverine\",\"rating\":2.5,\"comment\":\"This is essentially a red Phyrexian Rager. It’s not quite as good, given the clear need to play the exiled card on the same turn. However, this is one of the smartest instances of plot, because if you plot this and cast it for free on the following turn, all of your mana is free to cast whatever spell you hit. This is an awesome addition to basically any red deck.\"}","{\"name\":\"Iron-Fist Pulverizer\",\"rating\":1.5,\"comment\":\"This giant warrior looks like the whole package. Nice on defense, capable of going aggressive, or it can just sit back and keep pinging away whenever you double spell. 5-drops are the very definition of replaceable, but I wouldn’t be unhappy if I had to play this one.\"}","{\"name\":\"Longhorn Sharpshooter\",\"rating\":3.5,\"comment\":\"If you’ve read my reviews before, you’ll probably know how much I like Flametongue Kavus. Hell, if you play a lot of Limited, you probably like FTKs quite a bit too. This is a new one and it’s a hell of a card. You can plot it on 4, kill something and then get a free 3/3 in a later turn. If you’re against a slower deck and they don’t have many small creatures to kill, just run it out on turn 3 and start beating down. This should be one of red’s best cards in the format.\"}","{\"name\":\"Magebane Lizard\",\"rating\":1.0,\"comment\":\"This is very much a creature-based set. There are no decks likely to want to be casting several noncreature spells in a turn, meaning this trigger will be dealing 1-2 points of damage at best. Until then, it’s a 2-mana 1/4, so if you’re in the market for that then perhaps it’ll make the cut, but it’s not going to do much more for you.\"}","{\"name\":\"Mine Raider\",\"rating\":1.5,\"comment\":\"A 3/2 with trample for 3 mana is a pretty good deal. Plus you’ll get a free Treasure most of the time. No matter what deck you’re playing, this should be a solid curve filler, even if it’s not that exciting.\"}","{\"name\":\"Prickly Pair\",\"rating\":2.5,\"comment\":\"This is like following a simple formula. 3 mana for two creatures and a combined 3/3 of stats is just awesome. We saw this with Inside Source in Murders at Karlov Manor and this stands to be potentially the best red common in the set.\"}","{\"name\":\"Quick Draw\",\"rating\":1.0,\"comment\":\"This is a curious take on the typical Kindled Fury combat trick, but I don’t think these little upgrades on it are enough for it to become more than just a mediocre playable that you’ll never want to prioritize.\"}","{\"name\":\"Quilled Charger\",\"rating\":1.5,\"comment\":\"It’s not too difficult to saddle this little (big?) guy, turning it into a 5/5 menace for just 4 mana. That’s more than enough of an upside to make this a good curve filler for most red decks.\"}","{\"name\":\"Reckless Lackey\",\"rating\":2.5,\"comment\":\"A 1-drop with haste and first strike can start attacking early and won’t get outclassed quite as quickly as others. When it does, you can cash it in for a card and a Treasure token? I’m not normally so high on 1-drops, but this one looks like it has everything we’d be looking for.\"}","{\"name\":\"Resilient Roadrunner\",\"rating\":2.5,\"comment\":\"You know, a roadrunner should be able to outrun a coyote. Dropping this on turn 2 puts on a lot of early pressure, while drawing it late is still fine because it can become unblockable. It’s just a nice, aggressive creature for any aggro deck.\"}","{\"name\":\"Return the Favor\",\"rating\":3.5,\"comment\":\"Redirect and Reverberate aren't the most playable of limited cards, but this format has one key difference: the sheer number of spells and abilities that target. The redirection mode of this card will pretty much always have something to do and when you tack on the additional mana to get an additional copy of it, you can end up with some incredible blowouts. \"}","{\"name\":\"Rodeo Pyromancers\",\"rating\":1.0,\"comment\":\"Getting 2 red mana back on your first spell each turn is a nice ability, but a 3/4 for 4 mana isn’t good enough on its own and the ability isn’t enough to make up for that.\"}","{\"name\":\"Scalestorm Summoner\",\"rating\":3.0,\"comment\":\"It shouldn’t be too hard to enable this creature. Even just putting a +1/+1 counter on itself will allow it to trigger without the need to have another creature around. Each attack threatens to put you further and further ahead on board, which makes this a must-kill threat, assuming you can keep up the pressure and make sure it’s able to attack.\"}","{\"name\":\"Scorching Shot\",\"rating\":3.5,\"comment\":\"2 mana for 5 damage is exceptional. Costing double red is a small price to pay for a removal spell, and this red sorcery can trade up for most 4- and 5-mana creatures.\"}","{\"name\":\"Slickshot Show-Off\",\"rating\":2.5,\"comment\":\"Flying, haste, and a kind of mega prowess is a nasty combination. Plot gives you the potential for an explosive turn where this is cast for free, along with a bunch of spells in the same turn. Even just one spell in a turn makes this a 3-power flier with very little mana invested, which makes me think this will be a powerful beater in the right deck.\"}","{\"name\":\"Stingerback Terror\",\"rating\":3.0,\"comment\":\"The more aggressive you are, the stronger this becomes. Most of the time in Limited, your hand size will be low anyway, but aggro decks should empty their hands a lot faster and more reliably. Better yet, plot can give you a mana discount on it and you can time casting it at a point where it’ll be big enough to dominate the board.\"}","{\"name\":\"Take for a Ride\",\"rating\":3.0,\"comment\":\"We’ve seen plenty of generic Threaten spells in past sets and they are always the same. You probably shouldn’t play them without the ability to sacrifice the creature you steal, but you can prioritize them if you do have access to this ability. However, this one is a cut above the rest. The ability to play this card as an instant allows you to steal a creature on your opponent’s turn and block something with it, trading them off. Even if you just steal a creature smaller than their biggest attacker and have it get eaten in combat, this becomes a solid removal spell with the potential for so much more.\"}","{\"name\":\"Terror of the Peaks\",\"rating\":5.0,\"comment\":\"This is a powerful reprint from Core Set 2021 that I know Commander players are going to be clamoring over. It doesn’t disappoint in Limited either, as each trigger from this dragon that you can pull off is effectively a free removal spell. It’s a little disappointing that after playing this, it won’t actually do anything until you untap and play another creature, but we can easily mitigate that with plot spells. Knowing you have this coming, you can prepare by plotting a creature or two then exploding them onto the board all in one go. This is pretty much the textbook definition of a bomb rare.\"}","{\"name\":\"Thunder Salvo\",\"rating\":2.0,\"comment\":\"I don’t think the third point of damage is all that reliable, so this doesn’t really excite me that much. I like the potential it has, but most of the time this will only be dealing 2 damage, so I doubt we’ll be picking up too many copies of this outside of the double spell deck.\"}","{\"name\":\"Trick Shot\",\"rating\":2.0,\"comment\":\"5-mana burn spells are usually pretty weak. But they’re also not usually instants that deal 6 damage, not to mention the fact that this can take out a small token at the same time. Most red decks should be happy playing this, but it’s still on the expensive side, so you won’t be playing many copies.\"}","{\"name\":\"Aloe Alchemist\",\"rating\":3.0,\"comment\":\"This is one 2-drop you don’t want to play on turn 2, yet it’s still great if you do. All you’d get is a 3/2 trample, which is perfectly fine, but holding out gets you so much more. Plotting this green creature on a later turn gives you a huge boost that’ll help you push a creature through opposing blockers while still getting you a free 3/2 trampler later on.\"}","{\"name\":\"Ankle Biter\",\"rating\":2.0,\"comment\":\"I’m always a huge fan of cheap deathtouch creatures. I like playing slow decks and these tend to keep opponents from attacking you too often for fear of trading off, plus they combine really nicely with bite spells to take out creatures of any size. This snake is the kind of card that could really help keep this format from being too fast, which is what I like the most about it.\"}","{\"name\":\"Beastbond Outcaster\",\"rating\":3.0,\"comment\":\"It should be so easy to enable this in the right deck. A 3/3 that cantrips is right up my alley and it’s so cheap too. Getting the discount on the plot cost is awesome too, since you’ll often be able to skip your second turn to do this, then cast this for free on whatever turn you get your first ferocious creature. The play patterns this offers really sell it for me and it’s a great payoff for the red/green deck.\"}","{\"name\":\"Betrayal at the Vault\",\"rating\":2.5,\"comment\":\"We’ve seen cards like this before and they’ve gone from big hits to wild misses. I’ll happily hedge my bets on this green instant being a hit, especially because being an instant allows you to get the timing perfect. Sorceries have a tendency to get blown out by removal spells and the like, but an instant lets you cast this during combat or even in response to an opponent’s removal spell. You do need a good enough creature or an Ankle Biter to line up against theirs, but given the huge blowouts you can create, it’s well worth it.\"}","{\"name\":\"Bristlepack Sentry\",\"rating\":1.5,\"comment\":\"Drowsing Tyrannodon was once a great card and this functional reprint looks really well positioned in this set. There should be plenty of ways to enable it attacking, and until then this wolf should be great at stemming the early aggression from opposing decks. This is bound to be one of the creatures I want to see the most when drafting green.\"}","{\"name\":\"Cactarantula\",\"rating\":1.5,\"comment\":\"This spider is a very reasonable play, assuming you have a desert by turn 5. The triggered ability might look great, but it’s really easy to avoid, so I wouldn’t look at this as anything more than a 6/5 reach creature that hopefully costs 5 mana. If you have no deserts in your deck, this isn’t good enough.\"}","{\"name\":\"Colossal Rattlewurm\",\"rating\":4.5,\"comment\":\"Apparently the vanilla test means nothing anymore. A 6/5 trample for just 4 mana is absurd. Throw in flash and the fact that you can grab a free land after it dies and you have an unbelievable creature.\"}","{\"name\":\"Dance of the Tumbleweeds\",\"rating\":2.0,\"comment\":\"Strixhaven was the slowest set we’ve had in the last five years or so, where we saw Leyline Invocation land among the best green commons. Seeing a version for just 5 mana that’s also a 3-mana Rampant Growth makes me think it’s bound to be a great card. This green sorcery should create a 5/5 minimum, but sometimes you’ll just make a 10/10 and you’re all set.\"}","{\"name\":\"Drover Grizzly\",\"rating\":1.0,\"comment\":\"This creature’s abilities don’t really make too much of a difference when compared with a vanilla creature of this size. We wouldn’t really care about playing that, but Alpine Grizzly once acted as a nice ferocious enabler in Khans of Tarkir, so perhaps this new bear could end up doing something similar.\"}","{\"name\":\"Freestrider Commando\",\"rating\":1.5,\"comment\":\"3 mana for a 3/3 is fine, 4 mana for a 5/5 is quite a bit better, and the option of one or the other is enough to make this a decent playable.\"}","{\"name\":\"Freestrider Lookout\",\"rating\":2.5,\"comment\":\"White has a very similar card, though this one looks quite a bit more consistent. Effectively drawing you a card and accelerating you at the same time is a really nice trigger just for committing a crime. Even one trigger would make this a good card, but you could end up getting several without trying too hard, making this a really solid rare that any green deck would be happy with.\"}","{\"name\":\"Full Steam Ahead\",\"rating\":2.5,\"comment\":\"We’ve had a lot of Overrun variants over the years that haven’t come close, but the blocking clause might actually do the trick. At the end of the day, Overrun is a terrifying card that ends most games where it gets cast and this looks more than good enough to do that too.\"}","{\"name\":\"Giant Beaver\",\"rating\":2.0,\"comment\":\"A 4/4 vigilance for 4 is pretty awesome. It wouldn’t need much more than that to be playable, so being a mount with a relevant ability is a nice upside that should make this a standout common, slotting perfectly into the green/red and green/white archetypes.\"}","{\"name\":\"Gold Rush\",\"rating\":1.5,\"comment\":\"This is a unique combat trick, in that it has the potential to actually just grant +10/+10 or more, killing an opponent out of nowhere. That’s really cool and I’m sure that’ll actually happen in Constructed, but this set doesn’t contain a lot of ways to make several Treasure tokens, until you get to the rare slots. Instead, we just have a few ways of making them one at a time. As such, this is much more likely to just be giving +2/+2 or +4/+4, making it a mediocre card, but one that has some potential to be really absurd in the right deck.\"}","{\"name\":\"Goldvein Hydra\",\"rating\":5.0,\"comment\":\"This is just the green Shivan Devastator and presumably just as broken. It’s flexible, allowing you to cast it at most points on your curve, and also very splashable, costing only one green mana. It’s a simple card, but an extremely powerful one that should be devastating whenever you choose to cast it.\"}","{\"name\":\"Hardbristle Bandit\",\"rating\":2.0,\"comment\":\"We know by now just how good mana dorks are in Limited, especially when they can potentially grant you 2 mana in a turn, assuming you’re committing a crime. This helps to engineer double spell turns while also functioning as a fine mana dork with no downsides and one that fixes your colors.\"}","{\"name\":\"Intrepid Stablemaster\",\"rating\":2.5,\"comment\":\"Right away, we have another mana dork. This one isn’t necessarily better than Hardbristle Bandit, but it has the potential to tap for 2 mana, allowing you to cast a powerful mount spell two turns ahead of schedule. This should be a very high priority for a green/white mounts deck, but it’s just good in any deck and having it makes me want to ensure I have some mounts in my deck to make use of it.\"}","{\"name\":\"Map the Frontier\",\"rating\":1.0,\"comment\":\"Grabbing two deserts is kinda cool, but we have much better ramp spells that don’t require us to commit so much mana to them, so I don’t see this Explosive Vegetation quite getting there.\"}","{\"name\":\"Ornery Tumblewagg\",\"rating\":5.0,\"comment\":\"Oh, is that you Luminarch Aspirant? The ability to distribute a +1/+1 counter at the beginning of each of your combats has overperformed in recent sets. Not just the previously mentioned Aspirant, but also Siege Veteran from The Brothers’ War. It’s so cheap, it comes down early and starts applying a ton of pressure while barely trying, and even has a powerful attack trigger that you can potentially leverage into making an unbeatable alpha strike. It’s just the whole package.\"}","{\"name\":\"Outcaster Greenblade\",\"rating\":3.5,\"comment\":\"I audibly gasped when I first read this card. Civic Wayfinder/Borderland Ranger is a design I always love to see and it’s one of the best mana fixers that any green deck has access to. Not only can this search up the set’s land type, like District Guide could, but this could easily just be a 3/4, 4/5, or even bigger, turning it into a very real threat rather than just a small value creature.\"}","{\"name\":\"Outcaster Trailblazer\",\"rating\":3.5,\"comment\":\"Running this out on turn three looks pretty weak. The value in this design comes from being able to run out creatures after it and draw some cards. Given that, I think we’re much more likely to be plotting it when we see it early. Plotting this on turn 3 leads into playing a 5-drop on turn 4, presumably drawing a free card right away. From there, your opponent’s choices are either to kill this or risk you drawing a bunch more cards in the coming turns, which might be too dangerous to allow.\"}","{\"name\":\"Patient Naturalist\",\"rating\":1.5,\"comment\":\"Whether you get a free land or a Treasure, this trigger should pay you off nicely. There isn’t enough graveyard focus for the self-mill aspect to be high value, but that’s not necessary for the card to at least be playable.\"}","{\"name\":\"Railway Brawler\",\"rating\":5.0,\"comment\":\"Green’s rares and mythics are firing on all cylinders. A 5/5 with reach and trample is great, even better when you get to plot it for 1 mana cheaper than normal. If that wasn’t enough (which of course, for a mythic it rarely is), every creature you play after it is doubled in size as if it was nothing. Plot also allows you to cast this for free on a turn and then immediately make use of the trigger before your opponent can effectively interact.\"}","{\"name\":\"Rambling Possum\",\"rating\":3.0,\"comment\":\"Just your standard giant possum who’s also a clean and simple 3/3 for 3. Fair enough. The saddle trigger is really nice though, not just because it turns it into a 4/5, but mainly because you get to reuse the triggered ability of something you saddle it with. We’ve seen a ton of really powerful enters the battlefield triggers so far and any one of them would be great to trigger again, even if you need to recast them to do so.\"}","{\"name\":\"Raucous Entertainer\",\"rating\":1.5,\"comment\":\"I don’t know if this is entirely worth it. I know we’d all love it if our creatures had the mode of being a little bit bigger just from paying an extra mana, but sometimes you want to just play your 4-drop on turn 4, or you won’t cast a creature for the turn and this does nothing. I’m being a bit too negative, because this is still a fine 2-drop, but I don’t see it being all that special.\"}","{\"name\":\"Reach for the Sky\",\"rating\":1.5,\"comment\":\"I’ve been down on flash auras lately, but this green enchantment adds a fair bit to the equation that I think makes it playable. The addition of reach could allow you to ambush a flying creature in the right situation and you’ll always get a card back once it’s resolved. This can be an easy two-for-one sometimes, even if it’s a bit on the expensive side and a little too situational, so it does have potential.\"}","{\"name\":\"Rise of the Varmints\",\"rating\":2.5,\"comment\":\"Let’s get this straight first. This is not Spider Spawning. Though it could be a fairly decent imitation. Green decks in this format are all heavily creature based, so any green deck is bound to have plenty of cards available to fuel this. I’d say you need to be regularly making at least three tokens for this to be worth it and that really doesn’t seem that hard to do. If you ever start making a lot more, then this might even be the best card in your deck.\"}","{\"name\":\"Snakeskin Veil\",\"rating\":2.0,\"comment\":\"In a format where you’re actively encouraged to target things in order to commit crimes, a trick like this goes way up in value. You know that decks are far more likely to have targeted removal and you can take advantage of that by taking multiple Snakeskin Veils and holding them up on key turns. We’ve seen this card perform well in the past and this might be its best home yet.\"}","{\"name\":\"Spinewoods Armadillo\",\"rating\":2.0,\"comment\":\"We’ve seen a lot of landcyclers in recent sets and this format looks like it might be slow enough for this one to really shine. Gaining 3 life from cycling is a nice touch to help you stay alive that little bit longer, and slamming this on 6 should really gum up the board against any kind of attacker.\"}","{\"name\":\"Spinewoods Paladin\",\"rating\":2.0,\"comment\":\"I do like creatures that gain life when they enter and seeing this at common really makes me excited for green in this set. It’s even cheaper than the Honey Mammoth variants that we usually see and you can even get a mana discount thanks to plot.\"}","{\"name\":\"Stubborn Burrowfiend\",\"rating\":3.0,\"comment\":\"When a 2-drop is actually better in the late game than it is on turn 2, you really need to look out. You’d be fine playing it on two and starting to attack, but its power lies in being able to saddle it and randomly turn it into a 6/6 or something. Plus being a mount and caring about the graveyard means it fits right in to nearly every green archetype in the set, which makes me think this will be a very high pick.\"}","{\"name\":\"Throw from the Saddle\",\"rating\":2.5,\"comment\":\"Rabid Bite with a bit of upside is fine to see. This is what green gets for removal and it’s honestly pretty decent. Keep an eye out for Ankle Biters to make sure this can kill anything you want it to.\"}","{\"name\":\"Trash the Town\",\"rating\":3.0,\"comment\":\"I like this as a nice and flexible combat trick that sticks around thanks to giving counters. But if that’s all it was, it wouldn’t be getting a 6. What really pushes it over the edge is the final ability. For just 2 mana, you could draw two cards by targeting an unblocked creature. For 5 mana total, you can combine all three modes and create a souped-up Wildsize. The flexibility of having all of these modes on one card though? Just perfect.\"}","{\"name\":\"Tumbleweed Rising\",\"rating\":1.5,\"comment\":\"While this does have the potential to be a 2-mana 4/4, 6/6, or however big you can make it, it lives and dies by what you have in play and is completely useless on an empty or weak board. I loved Kin-Tree Invocation, but that card benefited from cheap creatures being allowed to have a lot of toughness, whereas the same is not true for power.\"}","{\"name\":\"Voracious Varmint\",\"rating\":1.5,\"comment\":\"I don’t think there are enough good artifacts and enchantments you’ll want to kill for this to be a high pick, but a 2/2 vigilance is a fine creature in its own right. You can just jam this into any deck and end up with some free artifact/enchantment hate in case you play against something nasty.\"}","{\"name\":\"Akul the Unrepentant\",\"rating\":2.0,\"comment\":\"I’m sure Akul’s ability will make it an interesting Commander or something, but it’s never going to be worth it to trade three creatures for one when basically every creature in the set is castable. With that in mind, this is just a large flample creature that’s pretty difficult to cast, which I’m sure an exactly black/red deck will be happy with.\"}","{\"name\":\"Annie Joins Up\",\"rating\":1.5,\"comment\":\"Three colors for what amounts to a medium removal spell doesn’t sound very appealing. If I happen to already be in these three colors, perhaps because I’m already splashing something else or I’m playing Annie themself, then this could make the cut, but it’s not something I’ll be going out of my way for.\"}","{\"name\":\"Assimilation Aegis\",\"rating\":4.0,\"comment\":\"This is a really unique take on the tried and tested Oblivion Ring model. If you get lucky enough to snag a bomb with this then you get to turn any and all of your creatures into copies of that bomb and completely take over the game. Even just exiling a 4/4 and getting to equip up your 1/1 tokens will be more than enough.\"}","{\"name\":\"At Knifepoint\",\"rating\":2.5,\"comment\":\"The key to this is of course the ability to create a Mercenary whenever you commit a crime. Assuming you have plenty of ways to do that, I’d say this is a good payoff. Plus, giving first strike to most of your team will typically result in you being able to attack unimpeded. Combine those abilities and I’d say you have a nice build-around.\"}","{\"name\":\"Badlands Revival\",\"rating\":3.0,\"comment\":\"A 5-mana reanimate spell is not usually something that we’re interested in, but getting back another permanent on top of that is probably enough to make up for it. It’s almost like a big Eternal Witness and that’s absolutely fine by me.\"}","{\"name\":\"Baron Bertram Graywater\",\"rating\":3.0,\"comment\":\"There’s a considerable number of ways to create tokens in this set. You need to be able to create vampire tokens for Bertram to be worth playing, but assuming you have a few ways to trigger it, this should be a strong build-around.\"}","{\"name\":\"Cactusfolk Sureshot\",\"rating\":2.5,\"comment\":\"This is a nice solid creature with a bunch of good keywords, but it seems a bit lacking as far as signpost uncommons go. Your other ferocious creatures can gain haste and trample, sure, but that’s not something that makes me want to pick this highly.\"}","{\"name\":\"Congregation Gryff\",\"rating\":3.5,\"comment\":\"An enormous flying lifelinker is something that can take over games with ease. On its own, it becomes a 2/5 while saddled and it’s not hard to make it much bigger. It’s a little sad that despite its high toughness, it won’t be any bigger than a 1/4 when left on defense, but it’s cheap and powerful so it’s fine to have a downside like that.\"}","{\"name\":\"Form a Posse\",\"rating\":1.5,\"comment\":\"While X spells are flexible, this is just horribly inefficient. 3 mana for a single Mercenary, or 4 mana for 2 is just bad. If you’re creating three or more tokens then it’s not so bad, but are red/white decks in this format really going to be wanting to cast expensive spells? I doubt it.\"}","{\"name\":\"Honest Rutstein\",\"rating\":3.5,\"comment\":\"A Gravedigger, one of the best Limited commons of all time, with pure upside is awesome. I don’t care so much for the creature cost reduction, it’s more than enough without it.\"}","{\"name\":\"Intimidation Campaign\",\"rating\":2.5,\"comment\":\"Disinformation Campaign was a ridiculous card back in Guilds of Ravnica, but part of that card’s strength was the ability to discard your opponents’ cards in a much slower format. This version doesn’t look quite as good as that one, but it should still be decent assuming the format is slow enough to accommodate it.\"}","{\"name\":\"Kellan Joins Up\",\"rating\":0.5,\"comment\":\"You’d better have plenty of legendary creatures in your deck for this card to be useful, because spending three colors of mana to just plot a 3-drop is not a winning play. Even then, this probably isn’t worth it given how little it does without them.\"}","{\"name\":\"Laughing Jasper Flint\",\"rating\":4.0,\"comment\":\"Stealing cards from our opponent isn’t usually as good as drawing your own cards, but Jasper Flint steals so many of them that I don’t care. In an outlaws deck specifically, this might even be a win condition, as you keep exiling piles of cards from your opponent’s deck, and they’ll run out very quickly if they can’t kill Jasper.\"}","{\"name\":\"Make Your Own Luck\",\"rating\":2.0,\"comment\":\"Drawing three cards plus getting a bunch of mana is sweet. The only question we need answering is if we have the time to cast a 5-mana draw spell that doesn’t affect the board. I hope the answer is that we can!\"}","{\"name\":\"Pillage the Bog\",\"rating\":1.5,\"comment\":\"I don’t get this design. Why would I want to plot it for more mana? It’s not like having more lands in play allows me to draw extra cards, because looking at a larger pile isn’t all that good. Yeah, this is just a little better than a sorcery Anticipate and that’s about it.\"}","{\"name\":\"Rakdos Joins Up\",\"rating\":2.0,\"comment\":\"No matter how you dress them up, reanimate spells still aren’t great, especially when they cost 5 mana. At least reanimating a small creature is fine with this card, but it’s still not something I’m going out of my way to do.\"}","{\"name\":\"Riku of Many Paths\",\"rating\":1.5,\"comment\":\"Between charms and the like on the bonus sheet and the spree spells in the main set, there are 31 modal spells in this set and 15 in Riku’s colors. Creating a 1/1 flying bird token is a great payoff for casting these spells, but I really don’t know how many you’re going to be able to get into your deck. Riku just seems like a temperamental build-around that’ll be fun to try out every once in a while, but is something that’ll actually fail quite often.\"}","{\"name\":\"Ruthless Lawbringer\",\"rating\":3.5,\"comment\":\"Given the black/white sacrifice theme, this should generally be a strong Nekrataal variant. It’s still quite limiting to need another creature to sacrifice, but given the ability to kill basically any problematic permanent, that’s a price worth paying. Especially when it comes with a legitimate creature attached.\"}","{\"name\":\"Seraphic Steed\",\"rating\":2.5,\"comment\":\"Saddle 4 is a lot to ask for, but given the reward is a 3/3 flying Angel token, I’d say it’s worth it. It won’t be very easy to make happen and as such, this is a bit on the weak side, but it’s a very reasonably-sized creature without that ability anyway.\"}","{\"name\":\"Slick Sequence\",\"rating\":3.0,\"comment\":\"2 mana for a Shock is significantly below rate, but blue/red does have this double spell theme and a lot of plot cards to help enable it. I would always try to hold off on casting this until I could use it on a double spell turn, because killing a creature and drawing a card is a huge tempo swing.\"}","{\"name\":\"Vraska Joins Up\",\"rating\":1.0,\"comment\":\"I don’t like this much. Deathtouch counters don’t do a whole lot unless your deck is full of really small creatures, which is unlikely to happen if you’re green. But the legendary creature trigger might actually be good on this enchantment, because it’s not that hard to trigger and it draws you cards. With no legendary creatures in your deck, this is a flat 0/10, but there are enough of them in the set that this might deserve a look.\"}","{\"name\":\"Wrangler of the Damned\",\"rating\":3.0,\"comment\":\"The power of the flash deck will often come from being able to leave open 5 mana and having the choice of whether to interact with your opponent or do something else. This is the best “something else” that you can probably get, paying you off in a big way for passing the turn without casting anything. If this card is as good as I’m hoping it will be, this will be an exciting Limited format!\"}","{\"name\":\"Boom Box\",\"rating\":0.0,\"comment\":\"Even if you were really short on removal, a total of 8 mana to kill a creature and an artifact is just awful. You should be able to do better.\"}","{\"name\":\"Gold Pan\",\"rating\":1.5,\"comment\":\"This is interesting. 1 mana to equip is nice and cheap and while 2 is quite expensive, getting back a Treasure token as a rebate actually makes it worth it. Not only do you get your mana back, but this might actually help you accelerate into a bigger play ahead of time. I don’t know that every deck is interested in this effect, but it’s definitely playable.\"}","{\"name\":\"Lavaspur Boots\",\"rating\":0.5,\"comment\":\"If you could pay an extra mana when playing a creature to give it +1/+0 and haste, I think you’d take that deal. But spending a whole card to get access to that doesn’t seem good enough. You might be able to find some good homes for this, but you probably shouldn’t bother for the most part.\"}","{\"name\":\"Luxurious Locomotive\",\"rating\":2.5,\"comment\":\"There’s a train a comin’. Choo choo! This is pretty beefy for what it is and I think a lot of decks will be happy to play it. The weird “once each turn” wording is here to stop you from crewing with one creature, attacking, then crewing with a bunch more once your trigger is on the stack. If you want multiple Treasures, you need to crew with multiple creatures, then attack, giving your opponent a window to stop you. Anyway, between this having good stats, a decent trigger, and being a colorless card, I’m sure we’ll see plenty of it.\"}","{\"name\":\"Mobile Homestead\",\"rating\":1.5,\"comment\":\"2 mana for a 3/3 seems good, but not for a conditional 3/3. It can effectively draw you cards and that’s great, but I’m concerned that this vehicle is too small to be effective. Crew 2 is also not trivial. Still, the trigger is nice enough that I could just be wrong, but we’ve seen vehicles this weak in the past that have done next to nothing in their respective formats.\"}","{\"name\":\"Oasis Gardener\",\"rating\":1.5,\"comment\":\"A weak mana dork is probably not great, but the fact this gains you life makes it somewhat appealing. Decks that want an effect like this want life gain more than any other, because they’re not affecting the board against aggro decks, so this could actually be a solid playable.\"}","{\"name\":\"Redrock Sentinel\",\"rating\":1.0,\"comment\":\"I like having ways to draw extra cards in the late game, but I doubt we’ll want that enough to play a weak defender. It might be good enough in a glacially slow deck, given that a 2/4 is a really nasty blocker against aggro decks, but most decks probably want to play more proactive cards than this golem.\"}","{\"name\":\"Silver Deputy\",\"rating\":0.5,\"comment\":\"The classic artifact creature that puts a land on top of your library. These are usually terrible, but this one seems even worse. A 1/2 is significantly worse than a 2/1 and the Mercenary token ability isn’t enough to make up for that. If you really need extra fixing, then I guess you could try this, but it’s so bad that I’d rather just play extra lands.\"}","{\"name\":\"Sterling Hound\",\"rating\":0.5,\"comment\":\"As lovely as having another dog would be, this is just a textbook example of a filler card. No deck should actively want this, but if you’re stuck for playables then it’s not the end of the world to play.\"}","{\"name\":\"Tomb Trawler\",\"rating\":0.0,\"comment\":\"I normally like having access to this ability, but it’s not usually as bad as this. For one thing, there’s no big self-mill strategy for it to combo with, but also a 2-mana 0/4 with no real upside is just awful. This seems really out of place and I don’t expect you should ever run it.\"}","{\"name\":\"Desert Dual Lands\",\"rating\":2.5,\"comment\":\"These lands honestly disgust me just a little. In a world where all the sets have been aggressive, having a bunch of lands that we actively want for fixing also hit our opponents means that sometimes you’ll just be starting on 17 life without any spells being cast. Anyway, these will appear in 50% of Play Boosters and you should take them. I would happily take them on speculation early given the high number of multicolored options in both the main set and on the bonus sheet. They’re also deserts, meaning if you’re doing that, you’ll need a critical mass of these anyway. They also commit crimes, making them one of the simplest ways to do so in the entire set.\"}","{\"name\":\"Arid Archway\",\"rating\":3.0,\"comment\":\"Have you ever played with the Ravnica bounce lands before? If not, you’re in for a treat with this. It only provides colorless mana, but this is effectively just a land that draws you a card when it enters and that’s just amazing. On top of that, it’s a desert to boot. This ought to be a pretty high pick in anything but a really aggressive deck and especially if you’re drafting deserts.\"}","{\"name\":\"The Fast Lands\",\"rating\":2.0,\"comment\":\"As with many sets, rare duals are perfectly fine and you should pick them up to fix your colors if you need them. The desert duals will likely be better in the set because of their obvious synergies, but however you end up fixing your mana is absolutely fine. Plus these fast lands are huge reprints for Standard, so I’m excited for that.\"}","{\"name\":\"Bucolic Ranch\",\"rating\":1.0,\"comment\":\"I doubt any deck will have enough mounts to make the best use of this, because spending effectively 4 mana to Scry 1 is pretty weak. I wouldn’t recommend playing this unless you really need deserts or actually have a lot of mounts.\"}","{\"name\":\"Conduit Pylons\",\"rating\":1.5,\"comment\":\"This isn’t particularly good, but it’s really not the worst. There’s a lot of need to fix your colors, as I’ve already mentioned, and of course most deserts should be at least playable in the desert deck.\"}","{\"name\":\"Mirage Mesa\",\"rating\":2.5,\"comment\":\"Effectively a desert Evolving Wilds, this should be a high priority for a lot of decks that need to fix their mana while also being one of the best deserts you can pick up for your desert deck.\"}","{\"name\":\"Sandstorm Verge\",\"rating\":1.5,\"comment\":\"I don’t think your average deck is going to care too much about this ability, but it’s very useful, so once you’re in deserts this can become a priority.\"}","{\"name\":\"Fell the Mighty\",\"rating\":1.0,\"comment\":\"Board wipes are conditional enough already without throwing another annoying condition into the mix. It might be a fun card in Commander, but it looks far too situational to make a big impact in a 1v1 format.\"}","{\"name\":\"Fierce Retribution\",\"rating\":2.0,\"comment\":\"Destroying any attacking creature for just 2 mana is a godsend for control decks. I don’t think you’re likely to cleave this and we rarely did so back in Crimson Vow. If you’re aggressive, you probably don’t want this at all, but the blue/white deck in particular should love it.\"}","{\"name\":\"Journey to Nowhere\",\"rating\":3.5,\"comment\":\"This set has seven Oblivion Rings, and this is actually one of the better ones. We only want to be killing creatures anyway, so doing so for 2 mana is perfect.\"}","{\"name\":\"Leyline Binding\",\"rating\":3.0,\"comment\":\"Most often, this will cost about 3 or 4 mana. That’s more than fine and flash is a very welcome ability in this set.\"}","{\"name\":\"Pariah\",\"rating\":0.0,\"comment\":\"This is kind of interesting, but not worth spending a whole card on. It’s just too often you’ll end up losing both cards in exchange for a bit of life. Nah, I’ll pass, thanks.\"}","{\"name\":\"Path to Exile\",\"rating\":3.5,\"comment\":\"Giving your opponent a free land is a hefty downside, but it’s not a bad trade off given the ability to exile any target creature for just 1 mana. Plus you could always exile your own creature if you want or need an extra land.\"}","{\"name\":\"Archive Trap\",\"rating\":0.5,\"comment\":\"Milling 13 cards is no joke. Two of these will win you most games, but of course you’re not likely to open two, let alone draw them in the same game. Archive Trap has its uses though. Alongside Deepmuck Desperado, there might be a legitimate mill deck to build, especially since this triggers the Desperado. It might also be a good sideboard card against a really slow control deck. Other than that, it’s basically unplayable.\"}","{\"name\":\"Commandeer\",\"rating\":0.0,\"comment\":\"I don’t want to pitch two blue cards to cast this and I really don’t want to spend 7 mana for it. It’s a powerful effect, but also one that’s far too narrow for Limited.\"}","{\"name\":\"Essence Capture\",\"rating\":1.5,\"comment\":\"Essence Scatter is essentially the blue Doom Blade and deserves our attention. Essence Capture is quite a bit worse, thanks to costing double blue and not having an upside we care that much about. Still, it’s nice and efficient and counters most of what we care about, so it’s fine to play in your slow blue decks.\"}","{\"name\":\"Mana Drain\",\"rating\":5.0,\"comment\":\"Mana Drain is not just one of the best instants in the game: it's by far one of the most broken cards in the history of Magic. It just does so much more than counter a spell. Imagine you’re on the draw. On turn 2 you leave your mana open and counter their 3-drop. Next turn, you play a 6. You might have just won the game because you’re so far ahead and your opponent has to play catchup, plus you didn’t spend any additional resources to get there. It also makes X spells a lot more attractive. This card is just ridiculous.\"}","{\"name\":\"Mindbreak Trap\",\"rating\":0.0,\"comment\":\"Just a note, “exile any number of target spells” means to exile them from the stack and effectively counter them. This was originally designed as a powerful answer to storm spells in Eternal formats. In Limited, it’s basically just a 4-mana Cancel that perhaps gets cast for free every now and again. That’s just far too expensive and it’s probably unplayable.\"}","{\"name\":\"Repulse\",\"rating\":5.0,\"comment\":\"Actual Rating: 6/10\"}","{\"name\":\"Heartless Pillage\",\"rating\":1.0,\"comment\":\"Regardless of getting a Treasure token or not, a Mind Rot is still just a Mind Rot. It’s pretty decent against slow decks and next to unplayable otherwise. You could always pick this up for your sideboard and just be careful of which matchups you play it against.\"}","{\"name\":\"Murder\",\"rating\":2.5,\"comment\":\"That’s two sets in a row now where Murder was an obvious choice to include. With the last couple of years being dominated by aggressive Limited formats, Murder has definitely gone down in playability. It’s still strong, but it’s a touch more inefficient than it used to be.\"}","{\"name\":\"Overwhelming Forces\",\"rating\":2.5,\"comment\":\"This is obviously a pretty broken black board sweeper. Completely one-sided and it draws you cards. You’ll probably win any game in which you cast it. Unfortunately, 8 mana means it’ll never be that simple. I do think it’s castable, but you really need some help to get you there, such as a more controlling deck and preferably some good mana acceleration.\"}","{\"name\":\"Reanimate\",\"rating\":2.0,\"comment\":\"I mean, we get the name “reanimator” from this card, so it’s got to be good. I’ve already talked about how reanimating creatures isn’t a good thing to be doing in Limited (three times already, and I’ll be saying it again later). A lot of that negativity goes away when your Reanimate spell costs 1 mana and not 5.\"}","{\"name\":\"Surgical Extraction\",\"rating\":0.0,\"comment\":\"No. Extractions are so bad that you casting this might actually make it easier for your opponent to win. Just do yourself a favor and don’t.\"}","{\"name\":\"Thoughtseize\",\"rating\":2.5,\"comment\":\"Yet another Vintage Cube all-star that is sadly not that special in regular Limited. Vintage Cube has a lot of powerful combo decks that need to be kept in check and Thoughtseize is one of the best ways to do that. That’s not the case here, so it’s not on the same power level. It is very cheap though, and that alone is enough to keep us interested.\"}","{\"name\":\"Collective Defiance\",\"rating\":3.0,\"comment\":\"3 mana for 4 damage to a creature is absolutely fine, even on a double red spell. The other two modes are kind of weak, but really nice bonuses to escalate onto the removal mode. Because of this, Collective Defiance is certainly a cut above your average removal spells.\"}","{\"name\":\"Crackle with Power\",\"rating\":2.0,\"comment\":\"So, this deals 5 damage to one target for 5 mana, 10 damage to two targets for 8, and so on. This really overperformed in Strixhaven, particularly thanks to the ability to do large amounts of damage to opponents and close out games quickly. It’s a lot of mana to set up, but since it can literally end a game on the spot, it’s definitely worth ramping into.\"}","{\"name\":\"Electrodominance\",\"rating\":2.0,\"comment\":\"Getting to cast an additional free spell from your hand is generally going to be too hard to set up. We are really only interested in the X cost burn mode and that’s honestly decent, though something that has definitely fallen out of favor in recent years.\"}","{\"name\":\"Fling\",\"rating\":1.5,\"comment\":\"Ugh… I hate Fling. It has the potential to do so much damage entirely at random and that’s only fun for the person casting it. This will either end games quickly, kill off something dangerous while costing you too many resources, or just be stuck in your hand with no good opportunity to cast it. Those last two modes are why I really don’t like it, but I’ll still lose to it often because that’s a thing.\"}","{\"name\":\"Indomitable Creativity\",\"rating\":0.0,\"comment\":\"I’m sure this competitive Pioneer and Modern all-star would be great if only we also had access to the stupid gods, Eldrazi and Atraxas that these Constructed formats are cheating out with this card. But sadly, we don’t, so this is useless.\"}","{\"name\":\"Skewer the Critics\",\"rating\":3.0,\"comment\":\"Most of the time you’ll be paying full price for this, but that’s absolutely fine. 3 mana for 3 damage to any target is perfectly fine and then sometimes we’ll get our mana discount and have a sweet turn on our hands.\"}","{\"name\":\"Skullcrack\",\"rating\":0.0,\"comment\":\"Spending a whole card just to damage a player is nowhere near good enough, so no thanks.\"}","{\"name\":\"Clear Shot\",\"rating\":3.5,\"comment\":\"Clear Shot is one of the best green removal spells in Limited. Instant speed, grows your creature to help it take down the opposing creature, but also boosts toughness, turning this into a combat trick. It’s not that hard to engineer a two-for-one blowout, but even if you can’t, it’s still good as a simple kill spell.\"}","{\"name\":\"Force of Vigor\",\"rating\":0.5,\"comment\":\"It’s one of Modern’s most prevalent sideboard cards, and it’s still a decent sideboard card in Limited. There are seven (I know, right…) Oblivion Ring variants in this set, which makes me want to have access to at least some enchantment removal and this is perfectly fine at doing that.\"}","{\"name\":\"Pest Infestation\",\"rating\":4.0,\"comment\":\"Speaking of enchantment removal, Pest Infestation is just absurd. We can main deck it because it doesn’t have to target anything to simply make a big pile of Pest tokens, but it will randomly pick up great targets whenever they pop up.\"}","{\"name\":\"Primal Command\",\"rating\":2.0,\"comment\":\"We last saw Primal Command in Strixhaven’s Mystical Archive. It performed fine in that set, but it was a lot worse than it has been in the past. Not much has changed since then, so I think this is playable, but not something I actively care about.\"}","{\"name\":\"Primal Might\",\"rating\":4.0,\"comment\":\"Fight spells have gotten a lot weaker since they debuted about 13 years ago, but the fact that this gives +X/+X means your creature should be winning every fight as well as getting a massive attack in. So not only is this a very solid removal spell for any green deck, but it’s also a huge tempo swing whenever you play it.\"}","{\"name\":\"Thornado\",\"rating\":0.5,\"comment\":\"Cycling may mean you could potentially put it in the main, but removal for fliers is still just sideboard material.\"}","{\"name\":\"Abrupt Decay\",\"rating\":2.5,\"comment\":\"You do want your removal spells to be flexible and take out anything, but killing any 3-drop or less with no conditions is still strong.\"}","{\"name\":\"Anguished Unmaking\",\"rating\":3.5,\"comment\":\"3 mana to exile any troublesome permanent is pretty nice. The life loss might end up mattering in some matchups, but it shouldn’t dissuade you from playing this incredibly flexible removal spell.\"}","{\"name\":\"Back for More\",\"rating\":1.5,\"comment\":\"This was a decent reanimation spell back in Ikoria, but that set had cards like Void Beckoner and Titanoth Rex which could discard themselves for value. We do have one large creature with a cycling ability in this set, so this isn’t so bad, but there’s still a lot that needs to go right for it to work out.\"}","{\"name\":\"Bedevil\",\"rating\":2.5,\"comment\":\"A Murder that’s a lot harder to cast is still fine. It shouldn’t be that relevant that this can kill planeswalkers, but there are definitely a few artifacts lying around that you might need to deal with.\"}","{\"name\":\"Buried in the Garden\",\"rating\":3.0,\"comment\":\"Oh look… another Oblivion Ring. I swear, I’m getting a little tired of reviewing these. There had better not be any more of them… Yeah, this is solid removal, good for ramping us. We only just had it in the last set so I assume most people are already familiar with how good it is.\"}","{\"name\":\"Cruel Ultimatum\",\"rating\":0.5,\"comment\":\"I do love a Cruel Ultimatum, but it’s wildly uncastable. I doubt it’s ever a good idea to go full Grixis in a 2-color format, because it’s not like this is splashable in a 2-color deck. This should be a flat zero, but it’s so cool and powerful that I want to keep the dream alive. I will hopefully try it at least once.\"}","{\"name\":\"Decimate\",\"rating\":0.0,\"comment\":\"I like that they’ve added the reminder text pointing out you need legal choices for all four of Decimate’s targets. It’s to remind you just how unplayable this card is and that you will never be able to cast it.\"}","{\"name\":\"Decisive Denial\",\"rating\":2.0,\"comment\":\"While this might look like a really powerful and flexible card, it ended up underperforming a fair bit back in Strixhaven. Fights are just not that powerful and neither is a conditional Negate. That being said, the card is a perfectly fine spell to play, it just doesn’t qualify as a premium removal spell.\"}","{\"name\":\"Detention Sphere\",\"rating\":3.0,\"comment\":\"You’re kidding right…? I don’t know, just read the review for literally any of the other six versions of this same card.\"}","{\"name\":\"Endless Detour\",\"rating\":1.0,\"comment\":\"In a 2-color format, you need a very compelling reason to play a third or fourth color. This is not one of those reasons. It’s flexible, but quite weak compared to other removal options and not something I’d actively want to play.\"}","{\"name\":\"Fractured Identity\",\"rating\":5.0,\"comment\":\"Oh my! Fractured Identity is a card that was designed to be fair in multiplayer but is simply broken in 1v1 games. It’s functionally very similar to a Mind Control (which would get an 8/10), except it has a bunch of inherent upsides. You get the “enters the battlefield” triggers of the thing you’ve exiled. Your opponent will never get their permanent back. This is a sorcery and so has synergy with cards like Lilah, Undefeated Slickshot and Archmage's Newt. This is simply a broken card and I’ll find it hard to ever want to pass it.\"}","{\"name\":\"Hindering Light\",\"rating\":2.0,\"comment\":\"This is a pretty sweet reprint actually. It’s a much too situational card to ever seen much play, but it’s a powerful counterspell that can counter most of the cards on this bonus sheet. Thanks to crimes, you can pretty much guarantee that every deck in the format will have multiple cards for you to counter, which is enough to make me want to try this out.\"}","{\"name\":\"Humiliate\",\"rating\":1.0,\"comment\":\"2 mana to take a card out of your opponent’s hand is fine, but it’s something that you really want access to on turn 2. Being multicolored is a huge barrier to that happening, making this a lot worse than Binding Negotiation and a free +1/+1 counter isn’t enough to make up for that downside.\"}","{\"name\":\"Hypothesizzle\",\"rating\":2.0,\"comment\":\"Hypothesizzle was a great common back in Guilds of Ravnica. Draw power plus removal is a powerful combination and you don’t even need to use the removal mode if you really don’t want or need to.\"}","{\"name\":\"Ionize\",\"rating\":1.5,\"comment\":\"This is fundamentally just a Cancel. Some decks are definitely after that, but plenty of others won’t be. I think this set looks slow enough that this will be a decent card, it’s just not that exciting.\"}","{\"name\":\"Ride Down\",\"rating\":1.0,\"comment\":\"Ride Down has been disappointing every time we’ve seenit. It’s just too situational and does nothing from a losing position. Sure, it has its uses and isn’t completely unplayable, but I wouldn’t go out of my way to include it.\"}","{\"name\":\"Savage Smash\",\"rating\":2.5,\"comment\":\"I’ve mentioned a few times that fight spells aren’t very good right now. However, that’s mainly because you can’t guarantee that your creature will be big enough to both kill the opposing creature and survive. Granting +2/+2 is a great way to mitigate that and might even allow your creature to make a good attack in the same turn.\"}","{\"name\":\"Siphon Insight\",\"rating\":1.5,\"comment\":\"Siphon Insight is really just a slightly better Think Twice that’s also much harder to cast. It’s not bad by any means, but it’s not something that a lot of decks will actually want.\"}","{\"name\":\"Terminal Agony\",\"rating\":3.0,\"comment\":\"4 mana to kill any creature at sorcery speed isn’t too bad, but nothing special. What we really care about is whether or not we can discard it for value. Turns out there are a few good ways to do this at common, including Discerning Peddler and Highway Robbery. If I picked this up early, I would start to prioritize ways of discarding it, because if you do get to cast it with madness, you’re in for a treat.\"}","{\"name\":\"Vanishing Verse\",\"rating\":3.5,\"comment\":\"With this set not having a huge multicolor focus, this should be able to target the majority of permanents that you care about in any given game. It’s annoying that it doesn’t hit any of the big multicolored bomb rares, but that’s not too much of a problem when it exiles everything else.\"}","{\"name\":\"Villainous Wealth\",\"rating\":0.0,\"comment\":\"It’s hard to justify any card that does nothing until you have about 7 or more mana. Imagine spending 8 mana on this, only to find a couple of small creatures. I know this is a fun and exciting card and I hope this format is glacially slow so that we might actually cast it every now and again, but I don’t see it happening.\"}","{\"name\":\"Void Rend\",\"rating\":2.0,\"comment\":\"3 mana to destroy any nonland permanent is great, but far less so when it costs three colors to cast. If you already happen to be in all three of these colors then this will be great, but I wouldn’t necessarily advise splashing for it, unless you’re short on removal (seems unlikely given the existence of this bonus sheet).\"}","{\"name\":\"Voidslime\",\"rating\":1.0,\"comment\":\"Like Ionize, this is fundamentally just a Cancel, but one that’s much harder to cast. This is barely playable and definitely not something that makes me want to be green/blue (not that I need much persuasion).\"}","{\"name\":\"Contagion Engine\",\"rating\":3.5,\"comment\":\"Contagion Engine is a pretty expensive card, but one that’s well worth the cost. 10 mana over two turns could be enough to completely wipe the opponent’s board, while potentially also proliferating +1/+1 counters onto your own creatures. It’s a lot to ask, but there are good mana acceleration options to help with it and this is a big payoff for that.\"}","{\"name\":\"Grindstone\",\"rating\":0.5,\"comment\":\"Grindstone is a broken card, but only because of its infinite combo with Painter's Servant. Without that, it’s aggressively mediocre. I would deem it unplayable, if not for the potential of a mill deck that I’ve talked about with Deepmuck Desperado and Archive Trap. Outside of that potential, it’s nowhere near good enough.\"}","{\"name\":\"Mindslaver\",\"rating\":0.0,\"comment\":\"On one hand, I spoke about how Contagion Engine was well worth the 10 total mana you invest into it. Mindslaver is not. Controlling a player through their turn can be a very powerful effect, but it comes at too high a cost given that it might just not do anything relevant at all.\"}","{\"name\":\"Unlicensed Hearse\",\"rating\":3.0,\"comment\":\"We use Unlicensed Hearse quite a lot in Constructed to attack the graveyard, but in doing so it often ends up as an enormous threat. To invest only 2 mana into a vehicle that can easily become a 6/6, 8/8, or even bigger sounds really appealing. Plus it randomly hates on cards like Honest Rutstein for extra value.\"}","{\"name\":\"Dust Bowl\",\"rating\":0.0,\"comment\":\"Even with the deserts around in this set, this ability is never going to be worth a land slot.\"}","{\"name\":\"Grand Abolisher\",\"rating\":2.0,\"comment\":\"Guaranteeing that your opponent won’t be able to do anything on your turns is pretty nice. It’s much more valuable in Constructed where we have combo turns that need to be protected, but I like being able to attack and know that my combat tricks won’t get interrupted in any way. It’s never going to be a priority for any deck, but it’s fine to pick up for free.\"}","{\"name\":\"Oltec Matterweaver\",\"rating\":4.0,\"comment\":\"Very much like Selvala, the fact that this triggers whenever you cast a creature spell means that it should be triggering very often. We can’t make much use of the second mode, but it’s more than good enough to churn out a 1/1 token whenever a creature is played.\"}","{\"name\":\"Rest in Peace\",\"rating\":0.0,\"comment\":\"Even if this was a set built around the graveyard, spending a whole card to do this would still not be a winning play. Here, it’s even worse than that, so this should be nowhere near your deck in any circumstances.\"}","{\"name\":\"Esoteric Duplicator\",\"rating\":0.5,\"comment\":\"As much as I like durdling around and spending mana to draw cards while not doing anything particularly relevant, this is probably a bit too slow for this set. I’ve talked about how slow I hope this set will be, but I still think this is too slow to do anything with.\"}","{\"name\":\"Simulacrum Synthesizer\",\"rating\":0.0,\"comment\":\"This is a really powerful trigger, but one that is way too difficult to trigger. Sadly, the fact that it does next to nothing until you find artifacts to go with it is the biggest knock against it and I don’t think we’ll ever be able to use this effectively.\"}","{\"name\":\"Worldwalker Helm\",\"rating\":0.0,\"comment\":\"I can see play patterns where this works, but once again, it’s a card that does nothing until you play something else. It’s a lot to commit for no immediate payoff and none at all until you find something that can make a Treasure or something similar.\"}","{\"name\":\"Harvester of Misery\",\"rating\":4.5,\"comment\":\"A slightly cheaper Massacre Wurm is pretty disgusting. Knowing this is on the way, you can set up the board to make sure your opponent gets the short end of the stick. But not only that, it’s also a solid removal spell for 2 mana. The option of both sides is absurd.\"}","{\"name\":\"Hostile Investigator\",\"rating\":4.0,\"comment\":\"I don’t know how often you’ll be able to keep triggering the second ability of this detective, but at least it’s nearly always going to trigger at least once. That’s definitely good enough, since this is basically a 4-drop that makes your opponent discard and you draw a card. That’s great, and then you can get some extra value from other discard outlets.\"}","{\"name\":\"Generous Plunderer\",\"rating\":2.0,\"comment\":\"Is it actually going to be worth it to create a Treasure if it also gives your opponent one? I get that this is fuelling the third ability nicely, but it’s not even doing that much to do so. I’m rating this as a 2/2 menace for 2 and I doubt the abilities are going to be worth using or will come up very often.\"}","{\"name\":\"Legion Extruder\",\"rating\":3.0,\"comment\":\"Yet another card that needs other artifacts to work, but it does at least give you a Shock up front, which isn’t so bad for 2 mana. There are enough random Treasures and stuff that can turn into 3/3s that I think this looks pretty good. You do need those throwaway artifacts first, but I would absolutely play this if I just had a few to go with it.\"}","{\"name\":\"Memory Vessel\",\"rating\":0.0,\"comment\":\"Memory Jar might have been one of the most broken cards of all time, but this is considerably worse. For one thing, it actually gives your opponent an opportunity to use their seven cards. I just wouldn’t bother with this and you’ll see it so rarely it’s not worth considering.\"}","{\"name\":\"Molten Duplication\",\"rating\":0.0,\"comment\":\"Maybe you can find some cool scenarios for this, but for the most part it’ll do nothing. It does nothing when you have no good targets and even when you do, you ideally also want a way to sacrifice the token for some value. Too much has to go right to make this a valuable card and I’m not willing to enable that.\"}","{\"name\":\"Territory Forge\",\"rating\":0.0,\"comment\":\"Nope. Demolish isn’t even remotely playable and it doesn’t get better if you make it cost more mana. You could argue this is essentially like Annex or Mwonvuli Acid-Moss, getting rid of an opposing mana source and giving you one, but 5 mana for that is still awful.\"}","{\"name\":\"Ancient Cornucopia\",\"rating\":2.0,\"comment\":\"This reminds me a lot of Pristine Talisman, which is actually a strong Limited card. Repeated life gain on a mana rock is a nice combination that makes up for the downside of playing the mana rock in the first place.\"}","{\"name\":\"Bristlebud Farmer\",\"rating\":4.5,\"comment\":\"When you start at a 5/5 trample for 4 mana and all it has is upsides from there, you’re clearly onto a winner. I’ll generally want to use this ability and turn the Food tokens into real cards. Regardless of how you use them, this card is just great.\"}","{\"name\":\"Omenpath Journey\",\"rating\":0.0,\"comment\":\"On the whole, this looks significantly worse than just playing Explosive Vegetation, which is already not the best. It's worse enough that I don’t want this in my deck at all, and I love ramp spells.\"}","{\"name\":\"Sandstorm Salvager\",\"rating\":4.5,\"comment\":\"It makes me sad that this card’s name is not “Sandstorm Splicer”. That’s literally my only note. 3 mana for a 1/1 plus a 3/3 is already incredible. Blade Splicer is a card that has seen play in multiple Constructed formats, even Legacy. Now this even makes things worse by growing the golem each turn, along with all of your other tokens. Incredible.\"}","{\"name\":\"Vaultborn Tyrant\",\"rating\":5.0,\"comment\":\"Oh dear… How many upsides does thing actually need? It’s a Honey Mammoth that also draws a card. When it dies, it comes back once. And whenever you play another big creature you trigger it again? Just… yeah, ok. I’m more than sold.\"}","{\"name\":\"Pest Control\",\"rating\":1.0,\"comment\":\"“This is not war! This is Pest Control!” – Dalek Sec (Doctor Who, Doomsday)\"}","{\"name\":\"Lost Jitte\",\"rating\":3.5,\"comment\":\"Umezawa's Jitte is basically the strongest Limited card in history. Thankfully, this heavily neutered version is nowhere close, but it still does a lot of nice things. It’s really cheap to cast and equip, it picks up charge counters easily, and the three abilities you can spend your counters on are all good in different contexts. It does a lot, it’s just that these abilities aren’t powerful enough to push the grade any higher, which I am absolutely fine with.\"}","{\"name\":\"Lotus Ring\",\"rating\":2.5,\"comment\":\"An equipment that gives +3/+3 and vigilance for just 3 to cast and 3 to equip is honestly quite good. It’s a large enough amount of stats that it turns any creature into a must-kill threat. It’s a tad expensive, but the effect it has is worth it. I don’t think we’ll be sacrificing our creatures for mana very often, but it’s a nice option to have.\"}","{\"name\":\"Nexus of Becoming\",\"rating\":0.0,\"comment\":\"I really don’t get what this is trying to do. If I already have 6 mana, why do I want to turn the artifacts and creatures in my hand into 3/3s when I can just cast them? The only thing I want this to do is draw me an extra card every turn and it’s not even good at doing that.\"}","{\"name\":\"Sword of Wealth and Power\",\"rating\":4.5,\"comment\":\"This is the ultimate protection sword, giving protection from virtually every removal spell in the game. That alone is pretty disgusting. The only thing holding this back is just how weak and situational its triggered ability is, but a card that makes any and all of your creatures unkillable by most spells is so hard to beat.\"}","{\"name\":\"Torpor Orb\",\"rating\":0.0,\"comment\":\"There are quite a few good “enters the battlefield” triggers in the set, but not enough where it would ever be worth it to spend a whole card only shutting those off.\"}","{\"name\":\"Transmutation Font\",\"rating\":0.0,\"comment\":\"Tapping to create a good artifact token sounds good at first, but then you look at how much mana it costs to cast and I’m immediately turned off. No thanks.\"}","{\"name\":\"Fomori Vault\",\"rating\":2.0,\"comment\":\"How good would a land be if it could be tapped to discard a card and draw a card? I’d say pretty damn good. That’s essentially what this card is, but with a bunch of extra artifact-related text. The fact that it needs artifacts to do anything at all is a big drawback, but in the right deck that can support it, I’d say this is worth the slot in your land base.\"}","{\"name\":\"Tarnation Vista\",\"rating\":2.0,\"comment\":\"I don’t think this is actually better than just Mirage Mesa. Yeah, this fixes your colors in any deck and isn’t a desert. It’s fine, you’ll definitely play it, but it’s never going to be something you’re excited to pick up.\"}","{\"name\":\"Stoneforge Mystic\",\"rating\":1.5,\"comment\":\"Stoneforge Mystic is one of Magic’s best ever 2-drops, but sadly its power level is entirely determined by the equipment you put into your deck. There are some decent options, like Thunder Lasso and Gold Pan, but you do need a couple of targets before this can make the cut.\"}","{\"name\":\"Brazen Borrower\",\"rating\":4.5,\"comment\":\"Brazen Borrower has proven itself time and time again in many formats. I have personally cast this card in Legacy, Modern, Pioneer and a bunch in Standard. The card is awesome. It definitely translates well to Limited too. Petty Theft is a nice bit of essentially free interaction which gets followed up by a nice big flier that can sometimes just end the game by itself. This is basically one of the strongest Man-o'-Wars we’ve ever seen and you should take it whenever you see it early.\"}","{\"name\":\"Desertion\",\"rating\":3.0,\"comment\":\"It is becoming increasingly more difficult to leave large amounts of mana open. But if you were going to leave any big spell open, Desertion is one of the best. Countering their 5-drop and stealing the creature or artifact for yourself is an enormous swing that they’ll struggle to come back from. The blue/white archetype also encourages you to play with big instants like this, so I think this will definitely have a home in the set.\"}","{\"name\":\"Morbid Opportunist\",\"rating\":4.0,\"comment\":\"It hasn’t been that long since we were playing Midnight Hunt and this was the best non-rare card in the whole set. Drawing free cards whenever something happens is great, assuming it happens often. Creatures dying definitely fits that description. It may only trigger once each turn, but even drawing just one or two total cards off of this will be well worth it.\"}","{\"name\":\"Port Razer\",\"rating\":3.0,\"comment\":\"It’s nice that you don’t have to jump through many hoops to get Port Razer to trigger, but it’s a tad undersized to be too excited about it. It’s a great Commander card because you have your choice of opponents to attack, but in 1v1 that doesn’t quite work. If your opponent doesn’t want you taking an additional combat, they can stop you more often than not. Still, if you have some good ways to help it connect then it seems pretty strong to me.\"}","{\"name\":\"Scapeshift\",\"rating\":0.0,\"comment\":\"While it might be funny to close out a game by searching up all of your dual lands and ping your opponent for some damage, a situational and bad Lava Axe is not remotely playable.\"}","{\"name\":\"Mystic Snake\",\"rating\":2.5,\"comment\":\"The classic Grizzly Bears + Counterspell hybrid card is still awesome today. If you get this off, it’s a straight up two-for-one, which is great. It’s just getting it to work that’s problematic. You can’t always leave 4 mana up, since you’ll often need to deal with the board first. In the right deck it should be really strong, but you’ll need to put a little bit of effort in to make that happen.\"}","{\"name\":\"Notion Thief\",\"rating\":0.5,\"comment\":\"Notion Thief is another funny one which is, thankfully, very narrow in application and not very good in Limited. It’s a counter to a thing that we just don’t see very often, so it isn’t good enough to make the cut.\"}","{\"name\":\"Desert\",\"rating\":1.5,\"comment\":\"Come on, you knew this was going to be somewhere in this set! The original Desert had to show up, even though times have changed and it’s not very exciting anymore. 1 damage kills small creatures and lets you trade up for bigger creatures, but the timing restriction holds this back. You can’t stop a creature from getting a hit in and you can’t use it proactively in any way. If you leave this open, your opponent will often be able to ignore it too, so I don’t think it’ll be that impactful. Still, it’s a desert, so sometimes you can grab it just for that.\"}","{\"name\":\"Prismatic Vista\",\"rating\":2.5,\"comment\":\"Vista is just excellent. It’s basically an untapped dual or tri land that fixes your colors perfectly by fetching a basic land while having almost no downsides. If you need incredible fixing for any color, or just an extra $20 in your wallet, you should probably grab this.\"}"]