["{\"name\":\"Fell the Mighty\",\"rating\":3.0,\"comment\":\"A sweeper is a sweeper even if it leaves some incidentals behind. Preferably you get to keep a couple creatures while all of theirs go straight into the bin. There is, of course, the problem of having your sweeper blown out by removal.\"}","{\"name\":\"Fierce Retribution\",\"rating\":2.5,\"comment\":\"The two-mana removal is great and it even let’s you remove anything for a whopping six mana. That might seem like a ton, but you’ll be thrilled it’s an option when you’re the beatdown.\"}","{\"name\":\"Journey to Nowhere\",\"rating\":3.0,\"comment\":\"While there are some enchantment removal spells running around, you’re more likely to just get to use this as two mana removal most of the time.\"}","{\"name\":\"Leyline Binding\",\"rating\":3.0,\"comment\":\"Remember that your deserts don’t count for basic land types so you don’t get the discount on them. That leaves this usually costing around four mana in the average deck. Good, but not amazing.\"}","{\"name\":\"Pariah\",\"rating\":1.0,\"comment\":\"This is what we use to refer to as a “Kiddie card”. They come up with all these scenarios where it’s unbeatable and amazing followed by losing to about 400 different things that they didn’t account for.  \"}","{\"name\":\"Path to Exile\",\"rating\":3.5,\"comment\":\"I know I am down on removal in general and this one even has a very real downside to it, but one mana to exile a creature is very, very good.\"}","{\"name\":\"Archive Trap\",\"rating\":1.0,\"comment\":\"The average deck should never want to be playing this card. If you have some way to replay it or copy it, then that changes the equation a bit. I’d say that you should always be able to pick it up if it’s opened, but we all know the casuals love them some mill (Doing it, not having it done. That’s a whole different story).\"}","{\"name\":\"Commandeer\",\"rating\":0.0,\"comment\":\"It is very rare that I drop the old 0.0, but I really don’t see a plausible scenario where you want to be playing this.\"}","{\"name\":\"Essence Capture\",\"rating\":2.5,\"comment\":\"Two mana counterspell with a bonus is great even if it can only hit creatures.\"}","{\"name\":\"Mana Drain\",\"rating\":5.0,\"comment\":\"Seriously? I’m not even going to elaborate on this one.\"}","{\"name\":\"Mindbreak Trap\",\"rating\":1.0,\"comment\":\"You’re never going to get to play this for free unless your opponent is in the middle of going off. That leaves it as a four mana Dissipate which isn’t good. Maybe a sideboard card against some bombs you can’t otherwise answer.\"}","{\"name\":\"Repulse\",\"rating\":3.5,\"comment\":\"There have been so many cards over the years that are some form of Repulse. They got it right all the way back in Invasion.\"}","{\"name\":\"Heartless Pillage\",\"rating\":1.5,\"comment\":\"Mind Rot certainly has its moments in limited and this set doesn’t seem too fast for it, but it’s still usually dead when you rip it late in the game. The treasure if you attacked that turn is nice, but not a big enough swing to make up for it being so bad in some matchups.\"}","{\"name\":\"Murder\",\"rating\":3.0,\"comment\":\"At least they made sure that Murder was a crime.  It’s solid removal that can help trigger other cards. Not bad, but not game breaking either.\"}","{\"name\":\"Overwhelming Forces\",\"rating\":4.0,\"comment\":\"This is extremely expensive, but wiping only your opponent’s side of the board while drawing a bunch of cards will usually win the game for you.\"}","{\"name\":\"Reanimate\",\"rating\":4.0,\"comment\":\"Significantly better than the other forms of reanimation running around. One mana can turn this into a massive tempo swing while also conveniently committing a crime if you grab one out of your opponent’s graveyard. Great for double spelling, just does a ton for only one mana.\"}","{\"name\":\"Surgical Extraction\",\"rating\":0.0,\"comment\":\"This is a constructed card. You could technically bring it in against someone playing multiple reanimation spells. It could also be a way to double spell easily. Still not something you want to be doing, don’t talk yourself into it.\"}","{\"name\":\"Thoughtseize\",\"rating\":2.5,\"comment\":\"I know, I know. This card is good in old formats, but it’s always been kind of meh in limited. You don’t really have the random misses like you would get with Duress, but it is still two life and can be dead later in the game. I’m still playing it, but I’m not going to be taking it highly.\"}","{\"name\":\"Collective Defiance\",\"rating\":4.0,\"comment\":\"Killing a relevant creature, doming them up, and rummaging away your hand for new cards is a pretty high ceiling. The floor is a reasonably priced removal spell. That all adds up to a great card.\"}","{\"name\":\"Crackle with Power\",\"rating\":3.5,\"comment\":\"Every time I see this card I am reminded of the time I was streaming, told everyone the complicated lethal that I didn’t feel like clicking through, and they top decked this to blast me for 15.\"}","{\"name\":\"Electrodominance\",\"rating\":2.5,\"comment\":\"While it can potentially drop an extra spell, it is really expensive to use this as removal. Solid when everything lines up right, but kind of sad when it doesn’t.\"}","{\"name\":\"Fling\",\"rating\":1.5,\"comment\":\"This can occasionally steal some games out of nowhere, but overall isn’t great when you are just using it as removal. If you are playing multiple Take for a Ride then this is much better.\"}","{\"name\":\"Indomitable Creativity\",\"rating\":0.5,\"comment\":\"Another constructed card with niche limited uses. You can upgrade some of your tokens while potentially downgrading some of their better creatures. Still very expensive and inconsistent. \"}","{\"name\":\"Skewer the Critics\",\"rating\":3.0,\"comment\":\"About in line with most of the removal spells in the set. Being able to go face and potentially play it for one mana make up for its deficiencies.\"}","{\"name\":\"Skullcrack\",\"rating\":0.5,\"comment\":\"Damage only to player or planeswalker isn’t exactly what I’m looking to do. The other abilities are far more likely to come up in constructed.\"}","{\"name\":\"Clear Shot\",\"rating\":3.0,\"comment\":\"While this is usually just a slightly amped up bite spell, there are also times where it straight up wins a combat and kills another of their creatures. I’ve drafted this card a ton in the past and loved it, I feel it will still perform up to snuff here.\"}","{\"name\":\"Force of Vigor\",\"rating\":1.0,\"comment\":\"Sideboard card.\"}","{\"name\":\"Pest Infestation\",\"rating\":4.5,\"comment\":\"The key thing on this is the up to because you can choose 0 targets and still make a pile of pest tokens. That’s pretty dece while the huge upside of killing one or more things at the same time is insane.\"}","{\"name\":\"Primal Command\",\"rating\":3.0,\"comment\":\"Putting a land on top of their deck while fetching your best creature is how this usually works out. The other modes certainly have their moments as well. Good card, not quite a bomb.\"}","{\"name\":\"Primal Might\",\"rating\":3.0,\"comment\":\"Make my creature massive while killing yours. Seems like a good deal to me. Able to easily slide itself into the curve and occasionally hits for a ridiculous lethal.\"}","{\"name\":\"Thornado\",\"rating\":1.5,\"comment\":\"I was really hoping this was a Sharknado situation, but full of Thors. I guess they couldn’t afford to pay that many Chris Hemsworths.\"}","{\"name\":\"Abrupt Decay\",\"rating\":3.0,\"comment\":\"While limited in the creatures it can remove, it does give you an option to kill a random cheap non-creature permanent.\"}","{\"name\":\"Anguished Unmaking\",\"rating\":3.0,\"comment\":\"The three life can hurt, but instant speed exiling any permanent is worth it.\"}","{\"name\":\"Back for More\",\"rating\":3.0,\"comment\":\"A tid bit more expensive than the other reanimation spells, but the fight is a great little bonus. There is also the instant speed thing so you can catch them unawares during attacks.\"}","{\"name\":\"Bedevil\",\"rating\":3.0,\"comment\":\"The cost is really rough, but the versatility is nice. You don’t often need to pick off a Planeswalker, but when you mess OG Oko’s day up, you’ll be glad you had the option.\"}","{\"name\":\"Buried in the Garden\",\"rating\":3.5,\"comment\":\"We just had this in Murders at Karlov Manor and it was great there. Exiling any permanent while providing fixing/ramp is a great combination.\"}","{\"name\":\"Cruel Ultimatum\",\"rating\":4.0,\"comment\":\"I was just talking about needing three colors and this needs that plus at least double of each. There’s a big difference between that and a potential eight for one with a ten point life swing. This card is brutal and will massively swing games.\"}","{\"name\":\"Decimate\",\"rating\":0.5,\"comment\":\"I am so glad they added the reminder text that you need all four targets to cast this. I can’t tell you how many people just tried to kill a creature and a land back in the Odyssey days.\"}","{\"name\":\"Decisive Denial\",\"rating\":2.5,\"comment\":\"Mana Leak or an Instant speed fight spell are pretty good modes to have so I won’t deny that I will be running this when I am in these colors.\"}","{\"name\":\"Detention Sphere\",\"rating\":3.5,\"comment\":\"This is the going rate for this exile effect, but this one can hit any permanent with the really high upside of taking out multiples. It does wonders against anyone making a pile of tokens.\"}","{\"name\":\"Endless Detour\",\"rating\":1.5,\"comment\":\"Three colors for an instant speed Time Ebb isn’t anything to get excited about. When this was in SNC, you were expected to be in a triome. Here it is less likely and this isn’t worth splashing for.\"}","{\"name\":\"Fractured Identity\",\"rating\":5.0,\"comment\":\"Getting a Control Magic that doesn’t let them take back their creature is great. Being able to take out any non-land permanent makes this even better. There are plenty of bad beat stories about this from Vintage Cube and there will be plenty more from being in this set.\"}","{\"name\":\"Hindering Light\",\"rating\":1.5,\"comment\":\"You do have to hold up two mana for this without being able to hit creatures, but protecting yourself or your biggest threat is worth two mana especially when it throws a card into the deal. Better out of the sideboard, but I can see main decking one.\"}","{\"name\":\"Humiliate\",\"rating\":2.5,\"comment\":\"Taking their best card and putting a +1+1 counter on a creature is a great deal early in the game. The value does drastically drop the later the game goes, but at least it’s not totally dead if you whiff.\"}","{\"name\":\"Hypothesizzle\",\"rating\":3.5,\"comment\":\"Draw two cards and pitch my worst nonland to deal four damage to a creature sounds like a bargain to me. I hypothesize that your opponent will be much less happy about this than you are.\"}","{\"name\":\"Ionize\",\"rating\":2.0,\"comment\":\"The two damage is nice as a throw in and all, but you have to basically look at this as a two-color Cancel. \"}","{\"name\":\"Outlaws Merriment\",\"rating\":4.0,\"comment\":\"A very large flavor fail considering you only get an outlaw out of this 1/3 of the time. Still a great card that provides a continuous string of value even if you feel like you’re rolling the dice every turn.\"}","{\"name\":\"Ride Down\",\"rating\":2.5,\"comment\":\"This is great when you’re the beatdown, but pretty worthless if your opponent is the one dropping the beats.\"}","{\"name\":\"Savage Smash\",\"rating\":3.0,\"comment\":\"Killing their creature while making yours a larger trampler can be pretty big game. It also gives you a prime opportunity to yell “HULK SMASH!”.\"}","{\"name\":\"Siphon Insight\",\"rating\":2.5,\"comment\":\"The cards in your opponent’s deck usually don’t synergize with the cards in yours so this can be worse than if you just drew a couple cards. Of course, the upside is huge and there is some selection to it so you’ll be running it if you’re already in these colors.\"}","{\"name\":\"Terminal Agony\",\"rating\":2.0,\"comment\":\"There are very few ways to madness this in so you should mostly just consider it as a four-mana sorcery speed removal spell.\"}","{\"name\":\"Vanishing Verse\",\"rating\":3.0,\"comment\":\"This is much better than it was in Strixhaven because there aren’t all the hybrid mana creatures running around. You’ll still end up disappointed when they drop a busted gold card and you’re staring at this.\"}","{\"name\":\"Villainous Wealth\",\"rating\":3.5,\"comment\":\"This can be an amazing win condition provided that you are playing a deck based around getting to the late game that can support these colors.\"}","{\"name\":\"Void Rend\",\"rating\":2.0,\"comment\":\"Not really worth splashing this unless you are desperate for interaction. If you happen to already be in these colors then this certainly is a removal spell.\"}","{\"name\":\"Voidslime\",\"rating\":2.0,\"comment\":\"Harder to cast Cancel with a tiny bit of upside. Not much more to it.\"}","{\"name\":\"Contagion Engine\",\"rating\":3.0,\"comment\":\"This feels like people will remember when this was crazy good back in the day and overrate it. These days it is a bit too slow to be considered a huge bomb. It’ll still be good, but you would prefer to have synergies such as +1+1 counters to make it truly shine.\"}","{\"name\":\"Grindstone\",\"rating\":0.5,\"comment\":\"Hard pass in Bo1. Very small possibility of bringing it in out of the sideboard in bo3 (probably still shouldn’t).\"}","{\"name\":\"Mindslaver\",\"rating\":3.5,\"comment\":\"Limited is a little too fast these days to consider this a windmill slam dunk. It’s still really good and let’s you come up with creative ways to wreck your opponent.\"}","{\"name\":\"Unlicensed Hearse\",\"rating\":2.5,\"comment\":\"This takes some time to get up to speed, but can end up being a massive threat later on after it destroyed any of their graveyard synergies.\"}","{\"name\":\"Dust Bowl\",\"rating\":0.0,\"comment\":\"I was trying to come up with some scenario where you would want this, but it’s not worth it. A basic land will be better.\"}","{\"name\":\"Grand Abolisher\",\"rating\":1.5,\"comment\":\"Just a dude. Unfortunately, it’s a hard to cast dude that mostly just shuts down counterspells.\"}","{\"name\":\"Oltec Matterweaver\",\"rating\":4.0,\"comment\":\"You were going to be casting creatures anyways so you might as well make a bunch of 1/1s while you’re doing it. You are ahead as soon as you get one token and everything from there is just gravy.\"}","{\"name\":\"Rest in Peace\",\"rating\":0.5,\"comment\":\"You really shouldn’t be playing this in limited. There might be some really far out there reasons to do it, but even then you should have better options.\"}","{\"name\":\"Esoteric Duplicator\",\"rating\":1.5,\"comment\":\"Mindslaver is in this format so the dream is alive to make your opponent cry (or just concede, which lets be honest is the better response). There are multiple other comical things to do with this, but you need to have something nutty because the four mana draw a card isn’t up to snuff.\"}","{\"name\":\"Simulacrum Synthesizer\",\"rating\":0.5,\"comment\":\"I’m sure that someone will come up with some crazy deck to pull off with this, but for the vast majority of the decks it is hot garbage.\"}","{\"name\":\"Worldwalker Helm\",\"rating\":1.0,\"comment\":\"Another far too situational card to want in most limited decks. I would be interested if it triggered off any token instead of needing to be an artifact token.\"}","{\"name\":\"Harvester of Misery\",\"rating\":4.0,\"comment\":\"This has two good modes with either the instant speed removal that can be used as a trick or the big old beater that casts Infest when it hits play. Can’t go wrong with that as long as you don’t play out too many small creatures first.\"}","{\"name\":\"Hostile Investigator\",\"rating\":3.5,\"comment\":\"As long as they have a card in hand, this is amazing right out of the gate. If they are empty handed, it’s actually pretty bad. There is a huge difference between a 3 for 1 and paying four mana for a 4/3. That’s what’s holding it back from bomb status.\"}","{\"name\":\"Generous Plunderer\",\"rating\":2.5,\"comment\":\"I hate giving my opponent treasure tokens. You never know when they might have an ill-advised splash that you just let them cast or have some synergies that need it. Still a solid creature that might get a few extra damage in based off of what they are doing.\"}","{\"name\":\"Legion Extruder\",\"rating\":3.0,\"comment\":\"Not really worth it on its own because a two-mana sorcery speed Shock is a bit below the curve these days. As long as you have some ways to make treasures this can crank it up from meh to OMG in a hurry.\"}","{\"name\":\"Memory Vessel\",\"rating\":1.0,\"comment\":\"Memory Jar was a true classic… in constructed. It still had a place in limited because you could set it up so you were the only one getting the value. This is not that. I could go through all the ways this isn’t that great of a card, but just don’t play it and you’ll be better off.\"}","{\"name\":\"Molten Duplication\",\"rating\":0.5,\"comment\":\"If I was a betting man (and I do have a bit of a gambling problem), I would say that I will never play this card in limited. I’m leaving it at 0.5 for the off chance some of you find something interesting to do with it.\"}","{\"name\":\"Territory Forge\",\"rating\":0.5,\"comment\":\"There are a few cards that you can sideboard this in against, but you’re still probably better off leaving it there.\"}","{\"name\":\"Ancient Cornucopia\",\"rating\":1.5,\"comment\":\"We’ve already established that you don’t want to be rocking Manalith these days. This one at least gains you a decent chunk of life through out the game.\"}","{\"name\":\"Bristlebud Farmer\",\"rating\":4.5,\"comment\":\"Somewhere Juzam Djinn is crying himself to sleep wishing he went into farming. A 5/5 trample for four is already a great card. This gives you two extra relevant game pieces that have multiple synergies running around the set including on this card that can turn them into actual factual cards.\"}","{\"name\":\"Omenpath Journey\",\"rating\":1.5,\"comment\":\"I don’t know about this one, there will certainly be matchups where the long-term value ends up being worth it. There are also times your opponent plays Bristlebud Farmer and this is your follow up.\"}","{\"name\":\"Sandstorm Salvager\",\"rating\":4.5,\"comment\":\"We’re usually thrilled getting 3/3 worth of stats across two bodies for this cost. Here we’re up to 4/4 to start off with that also puts counters on ALL of your tokens when you activate it.\"}","{\"name\":\"Vaultborn Tyrant\",\"rating\":4.0,\"comment\":\"This sure is pricy, but packs a ton of value into it. You already get an extra card and three life when this ETBs, then it offers the same deal every time you drop another chonker onto the field. Dies to removal you say? It comes back the first time that happens along with another card and 3 life package.\"}","{\"name\":\"Pest Control\",\"rating\":1.0,\"comment\":\"Even with cycling, this is still just a sideboard card against a token heavy opponent.\"}","{\"name\":\"Lost Jitte\",\"rating\":1.5,\"comment\":\"Umezawa's Jitte this is not. While half the cost to both cast and equip, this is slow and really underwhelming.\"}","{\"name\":\"Lotus Ring\",\"rating\":3.0,\"comment\":\"This is pricy and the sacrifice ability is very rarely going to come up. That said, the +3+3 and vigilance can dominate the board. The indestructible definitely matters so you don’t get it blown up after you committed to an attack.\"}","{\"name\":\"Nexus of Becoming\",\"rating\":3.5,\"comment\":\"This is a nice long-term effect that really adds up over time. The extra card every turn is great and you don’t even have to wait to get that first one provided you drop this in your first main phase. Turning any random creature or artifact into a 3/3 can prevent you from falling behind on board, but I suspect that after the first one you’ll usually be better off just casting your creatures.\"}","{\"name\":\"Sword of Wealth and Power\",\"rating\":3.5,\"comment\":\"One of the cool things about the other swords were the random auto-wins against someone playing those two colors. Even if only one color matched up, it put them in a bad position blocking wise threatening to get one of those busted triggers. Instants and sorceries is cool and all, but it doesn’t affect them blocking at all.\"}","{\"name\":\"Torpor Orb\",\"rating\":0.5,\"comment\":\"Not a limited card. Extreme corner case of sideboard against a deck stacked with creature ETBs.\"}","{\"name\":\"Transmutation Font\",\"rating\":4.0,\"comment\":\"Want to draw an extra card every turn for only two mana? This has your back. Need to stabilize on life? Also, here for you. Only have one mana and need to filter a card right now? I guess you can use this for that too.\"}","{\"name\":\"Fomori Vault\",\"rating\":2.0,\"comment\":\"The cost of playing a colorless land is very real even if it comes into play untapped. This also asks you to have artifacts (at least one) to do anything else. On top of that it’s pricy to activate essentially costing four mana. I’m not done yet, it’s not actual card advantage, just rummaging.\"}","{\"name\":\"Tarnation Vista\",\"rating\":2.0,\"comment\":\"What in tarnation?!? Sorry, had to get that one out of the way. \"}","{\"name\":\"Stoneforge Mystic\",\"rating\":3.0,\"comment\":\"Do you have equipment in your deck? Then this card is amazing as long as there is still one in your deck when you draw this. If you don’t this is unplayable.\"}","{\"name\":\"Brazen Borrower\",\"rating\":4.0,\"comment\":\"Brazey B can do a lot for you. Bouncing one of your opponent’s permanents followed by an on-rate flyer continues to show how good of a mechanic adventure is.\"}","{\"name\":\"Desertion\",\"rating\":4.0,\"comment\":\"The cool thing about this is that you aren’t restricted on which cards you can counter, just whether or not you get to steal it. While you would obviously prefer to steal a creature, you can still say no when they try to kill you with a removal spell.\"}","{\"name\":\"Morbid Opportunist\",\"rating\":3.0,\"comment\":\"This was an easy 3.5 if not 4.0 in Midnight Hunt so you’re probably wondering why I have it so low here. Decayed was one of the things that made this so amazing. You could just swing your random 2/2 that you got as a throw in and cash it in for an entire card.\"}","{\"name\":\"Port Razer\",\"rating\":1.5,\"comment\":\"Five mana creature that provides zero value when it enters or leaves. Understatted without any abilities that helps it get through. Needs to connect with their face to be more than a 4/4. Pretty sure you can do better.\"}","{\"name\":\"Scapeshift\",\"rating\":0.5,\"comment\":\"This is a constructed card, but technically you can use this to make sure you only draw gas for the rest of the game. Wouldn’t really recommend it.\"}","{\"name\":\"Mystic Snake\",\"rating\":3.5,\"comment\":\"A 2/2 really meant something when this was originally around, now it’s just outclassed by a lot of things. Still a strong card with a difficult mana cost. Not going to stop me from slamming this snake if I’m already in these colors.\"}","{\"name\":\"Notion Thief\",\"rating\":2.5,\"comment\":\"This is an odd one to rate because against some decks it is just straight up a 3/1 flash for four. You’d never play that card.\"}","{\"name\":\"Desert\",\"rating\":3.0,\"comment\":\"While the cost of a colorless land is real, this shuts down all of your opponent’s one toughness creatures or lets you trade up. It also conveniently commits a crime every time you do so. You could even combo it with Taii Wakeen, Perfect Shot to blast bigger creatures while drawing a card.\"}","{\"name\":\"Prismatic Vista\",\"rating\":3.0,\"comment\":\"You always play Evolving Wilds and paying one life instead of coming into play tapped is a deal you would make most of the time.\"}","{\"name\":\"Akul the Unrepentant\",\"rating\":4.0,\"comment\":\"The casting cost is kind of rough, but not really a problem if you are straight up Rakdos. I don’t have to explain to you how a 5/5 flying trample for four mana is really, really good. That other ability might be flavor text in most games, but it’ll be memorable when you sacrifice three random tokens to drop a bomb.\"}","{\"name\":\"Annie Joins Up\",\"rating\":1.5,\"comment\":\"All of these cards that give triggers for legendary creatures are going to massively fluctuate in value and that portion of the card should be an after thought that feels like a bonus when it happens.\"}","{\"name\":\"Assimilation Aegis\",\"rating\":4.0,\"comment\":\"Three mana to exile a creature is the going rate these days, but this lets you copy whatever you removed when you equip it. There are plenty of ways to make 1/1 tokens which would love an upgrade into your opponent’s (former) best creature.\"}","{\"name\":\"At Knifepoint\",\"rating\":2.0,\"comment\":\"Another card that is heavily dependent on the rest of your deck. If you have multiple Deadeye Duelist and other repeatable ways to commit crimes, this is probably a 3.5. If you’re a goody two shoes who lives life on the straight and narrow then this is most likely unplayable.\"}","{\"name\":\"Badlands Revival\",\"rating\":3.5,\"comment\":\"I can’t begin to express how disappointed I am that this isn’t a Rakdos card. Everyone who grew up tapping badlands for red or black should feel slighted here.\"}","{\"name\":\"Baron Bertram Graywater\",\"rating\":3.5,\"comment\":\"This dude definitely sounds like he should have been in the Clue set.\"}","{\"name\":\"Cactusfolk Sureshot\",\"rating\":3.5,\"comment\":\"Giving your other large beasties trample and haste feels great considering that you would be fine playing a four mana 4/4 reach with ward two on its own.\"}","{\"name\":\"Congregation Gryff\",\"rating\":3.0,\"comment\":\"This counts itself so you’ll always have at least one mount when you saddle this up. While it doesn’t seem too impressive, the lifelink makes this hard to race when it can crack in for a decent amount. It’s also a great defensive creature early on.\"}","{\"name\":\"Form a Posse\",\"rating\":2.5,\"comment\":\"Kind of an odd card because it’s dead without being actually dead early on. You’re certainly not going to want to be casting it for three mana to make a 1/1. I’d say it’s “playable” around when you can make three tokens and is a fantastic late game top deck.\"}","{\"name\":\"Honest Rutstein\",\"rating\":3.5,\"comment\":\"Bigger, cheaper Gravedigger that makes all of your other creatures cheaper. Yes, please.\"}","{\"name\":\"Intimidation Campaign\",\"rating\":2.5,\"comment\":\"This is going to range from pretty bad to completely busted depending on your ability to commit crimes and what your opponent is doing. I’m rating it here based off of what it should be like on average.\"}","{\"name\":\"Kellan Joins Up\",\"rating\":0.5,\"comment\":\"This is definitely a nepo hire. Someone needs to talk to Oko about that.\"}","{\"name\":\"Laughing Jasper Flint\",\"rating\":4.5,\"comment\":\"You’ll be the only one laughing at your table when Jasper is robbing your opponent blind. All it takes is some mercenaries (Jasper doesn’t live that lifestyle so you need at least one to get the party started) to quickly start wrecking their deck while beating them with their best cards.  \"}","{\"name\":\"Make Your Own Luck\",\"rating\":3.5,\"comment\":\"One of the problems with expensive card draw spells is that you fall behind on mana. While you do only get to plot one of these, it still lets you get some mana value out of it while pulling ahead on cards.\"}","{\"name\":\"Pillage the Bog\",\"rating\":2.5,\"comment\":\"You’re looking at a pretty decent card when the floor is a Golgari sorcery speed Impulse and the ceiling is Demonic Tutor.  \"}","{\"name\":\"Rakdos Joins Up\",\"rating\":3.0,\"comment\":\"I’ve been a fan of all of the reanimate with a bonus spells as long as they don’t have additional hoops to jump through. This fills that slot with the two +1+1 counters making even a small creature a very real threat. Your mileage will vary with the other ability, but having them take a chunk of damage when one of your legendary creatures dies certainly isn’t nothing.\"}","{\"name\":\"Riku of Many Paths\",\"rating\":3.0,\"comment\":\"Spree cards count as modal spells so as long as you have a few of them this can get pretty bonkers. If you end up with zero, then there’s also an almost zero percent chance you should be running this.\"}","{\"name\":\"Ruthless Lawbringer\",\"rating\":3.5,\"comment\":\"You obviously want some creatures that you don’t mind sacrificing to maximize your value, but this is still fine when you trade a random bear for a 4/4.\"}","{\"name\":\"Seraphic Steed\",\"rating\":4.0,\"comment\":\"You all know I love 2/2 lifelinkers for two and this sweet ride even adds first strike. Oh, what’s that? It can also pump out 3/3 angels when you attack. There are plenty of green creatures you can drop on turn three that have four power letting you immediately start the angel party.\"}","{\"name\":\"Slick Sequence\",\"rating\":3.5,\"comment\":\"Totally fine in a situation where you absolutely have to hit something for two. You’ll start to feel pretty slick when it draws you a card though.\"}","{\"name\":\"Vraska Joins Up\",\"rating\":1.5,\"comment\":\"It’s going to take some special boards for this to really shine. Do you have a bunch of stuff with first strike or trample? How about a bunch of legendary creatures? If so, then feel free to pick this, if not let Vraska sit on the bench.\"}","{\"name\":\"Wrangler of the Damned\",\"rating\":3.0,\"comment\":\"While a bit pricy, you are pretty even as soon as you get your first 2/2 out of this. Just like all the other “haven’t cast a spell from your hand” cards, this loves plotting and instants.\"}","{\"name\":\"Boom Box\",\"rating\":1.0,\"comment\":\"I don’t ever really want to be running this because it is so expensive. There are decks that are going to need it and it will be a card to occasionally consider out of the sideboard.\"}","{\"name\":\"Gold Pan\",\"rating\":1.5,\"comment\":\"Not a big fan of this. If your deck somehow both needs an early treasure and wants a Short Sword, then feel free to run this.\"}","{\"name\":\"Lavaspur Boots\",\"rating\":2.0,\"comment\":\"These are cheap enough that they have a place in the right deck. They can help all the four or greater power things get that last little oomph such as equipping it on a Bristlepack Sentry to trigger themselves.\"}","{\"name\":\"Luxurious Locomotive\",\"rating\":1.5,\"comment\":\"Expensive and fairly underwhelming unless you need a late game way to make a lot of treasures.\"}","{\"name\":\"Mobile Homestead\",\"rating\":2.5,\"comment\":\"When you have an early mount and hit on this, it is amazing. When it lacks haste and misses, it’s less than stellar. I’m viewing it somewhere in between those two outcomes.  \"}","{\"name\":\"Oasis Gardener\",\"rating\":1.5,\"comment\":\"I’m more likely to play this in sealed when I don’t have many other options. In draft, you should be able to pick up better fixing.\"}","{\"name\":\"Redrock Sentinel\",\"rating\":2.0,\"comment\":\"If your plan is to setup for a long game then this is a great blocker that can turn your extra lands into new cards later.\"}","{\"name\":\"Silver Deputy\",\"rating\":1.5,\"comment\":\"I’m really only looking to play this if I’m splashing and have some other cards that really want to take advantage of the ability.\"}","{\"name\":\"Sterling Hound\",\"rating\":1.5,\"comment\":\"I’m not saying that this pooch is a bad boi or anything like that, but it is your classic card twenty-three.\"}","{\"name\":\"Tomb Trawler\",\"rating\":1.0,\"comment\":\"There isn’t enough self-mill to easily get to the bottom of your deck. You can consider sideboarding it in a long control mirror, but even then there are probably better things to be doing.\"}","{\"name\":\"Arid Archway\",\"rating\":3.0,\"comment\":\"For those of you who have never had the pleasure of playing with Bouncelands, they are basically card advantage. You bounce that other land without going down on the quantity of mana you produce while still having it to replay. The only caveat on this one is that you need to be able to take advantage of the double colorless it produces.\"}","{\"name\":\"Bucolic Ranch\",\"rating\":2.0,\"comment\":\"If your deck looks like the local chocobo ranch, then you probably want this card. If you only have one or two mounts, you should pass on this.\"}","{\"name\":\"Conduit Pylons\",\"rating\":2.0,\"comment\":\"I always like the variants of this land and this one is even a desert on top of the normal stuff. While I’ve had plenty of 8/8/Crystal Grotto mana bases in my time, I don’t see that happening here with the abundance of duals running around. I’ll still happily run this in anything playing three colors though.\"}","{\"name\":\"Mirage Mesa\",\"rating\":2.5,\"comment\":\"A good comparison to this is Shimmerdrift Vale because it’s a tapped land of the color you choose with the land type of the set’s mechanic. This isn’t quite as good because there were way better payoffs for being heavy snow than there are for having a desert. Good card, not in the same range as the ping deserts.\"}","{\"name\":\"Sandstorm Verge\",\"rating\":1.5,\"comment\":\"The ability is one that aggressive decks would like, but the cost of a colorless land is probably too high for them.\"}","{\"name\":\"Fast Lands\",\"rating\":2.5,\"comment\":\"I’m always playing these if they are in my colors, but I would slam one of the ping deserts over them almost every time.\"}","{\"name\":\"Ping Deserts\",\"rating\":3.0,\"comment\":\"Tapped duals are almost always solid picks when they are in your colors. These are good enough that you might even play one or two that you only have one color of. Pinging your opponent makes everyone recalculate how much damage they can take over the course of the game because they don’t want to die to a land drop. On top of that they commit a crime when they come into play which is just great in this set. You should probably be taking them higher than you were planning to.\"}","{\"name\":\"Aloe Alchemist\",\"rating\":2.5,\"comment\":\"This alchemist smoothly slides into your curve as a 3/2 trample for two. While it’s not really a trick since it is only a sorcery speed, it does add a decent chunk of damage. It can even be used on your opponent’s creature when you don’t care about the effect, but just want to commit a crime.\"}","{\"name\":\"Ankle Biter\",\"rating\":2.0,\"comment\":\"I can’t hear Ankle Biter without picturing my Shih Tzu. Not that she would ever actually bite someone, but she will let you know that she could really mess your ankle up if she wanted to.\"}","{\"name\":\"Beastbond Outcaster\",\"rating\":3.0,\"comment\":\"The floor is a Centaur Courser, but being able to stash it on turn two to either drop it on turn three or wait until you have something big enough to draw a card off of it is pretty sweet.\"}","{\"name\":\"Betrayal at the Vault\",\"rating\":3.0,\"comment\":\"You’ll feel betrayed when things go horribly wrong with this, but being able to pick off two creatures with one card is a beating. Combine with a deathtouch creature for maximum betrayal.\"}","{\"name\":\"Bristlepack Sentry\",\"rating\":2.0,\"comment\":\"Drowsing Tyrannodon makes a return in a new form. While you can get it to attack the old fashioned way by playing a big beater. You can also toss some equipment or a +1+1 counter to get this to trigger itself.\"}","{\"name\":\"Cactarantula\",\"rating\":1.5,\"comment\":\"Having a desert is a pretty small ask to get a discount on this chonker. Getting a card out of them targeting it adds a decent amount of value to it. It’s just in that category of too expensive to play too many cards in this slot.\"}","{\"name\":\"Colossal Rattlewurm\",\"rating\":4.5,\"comment\":\"I can’t imagine showing this card to someone from twenty years ago. Getting a 6/5 trample that might eat a creature when you flash it in all for four mana seems insane. If they deal with it, you can still get value by searching up a desert. Amazing limited card.\"}","{\"name\":\"Dance of the Tumbleweeds\",\"rating\":2.0,\"comment\":\"Three mana is too much for a land ramp even if you can get a desert out of it. The creature is totally fine, but nothing too exciting. It’s when you get both that this card really matters. Spree does some things.\"}","{\"name\":\"Drover Grizzly\",\"rating\":1.5,\"comment\":\"While giving all your creatures trample can help, needing to saddle this just to give itself trample leaves it a bit behind the curve.\"}","{\"name\":\"Freestrider Commando\",\"rating\":2.0,\"comment\":\"This is nice as it can fill two different spots in your curve depending on what you draw and the game state. The 5/5 is probably going to happen more often, but sometimes you just need a three drop.\"}","{\"name\":\"Freestrider Lookout\",\"rating\":3.5,\"comment\":\"Obviously, this is going to fluctuate in value based off of your ability commit crimes. If you have Deadeye Duelist, then it can get downright silly especially since you can do it twice per turn cycle if you have other ways to commit crimes.\"}","{\"name\":\"Full Steam Ahead\",\"rating\":2.0,\"comment\":\"These cards always make me miss good old-fashioned Overrun. That extra power and toughness really matters when it comes to ending the game right here, right now. As this is, it’s a good finisher for a go wide deck.\"}","{\"name\":\"Giant Beaver\",\"rating\":2.5,\"comment\":\"One of my friends (You know exactly who you are) has been an eager beaver waiting for me to review this hoping that I put something ridiculous. Instead I will leave him (and all of you) with a Disney quote “Well, gee, eh, you’re one big beaver.”\"}","{\"name\":\"Gold Rush\",\"rating\":2.5,\"comment\":\"While this is +2+2 and a treasure at it’s base, it can actually get out of hand with some of the treasure producers running around.\"}","{\"name\":\"Goldvein Hydra\",\"rating\":4.0,\"comment\":\"Speaking of cards that can make a crap ton of treasures. You’d usually prefer that your big beasty sticks around to rule the board, but those treasures are at least a decent consolation prize.\"}","{\"name\":\"Hardbristle Bandit\",\"rating\":2.5,\"comment\":\"Fixing for any color off of a two-mana dork is solid, but being able to double dip when you commit a crime is great.\"}","{\"name\":\"Intrepid Stablemaster\",\"rating\":3.0,\"comment\":\"There’s a lot to like about this nightmare chocobo including that it’s a bear with reach that can tap for mana. The absurd part is when you get to tap for two to cast a Mount or Vehicle well ahead of curve.\"}","{\"name\":\"Map the Frontier\",\"rating\":1.5,\"comment\":\"We’ve come quite a long way from the times when Explosive Vegetation was a good limited card. This can get deserts so there might be some scenarios where you still want it.\"}","{\"name\":\"Ornery Tumblewagg\",\"rating\":4.5,\"comment\":\"The finest Brushwagg that has ever been printed. He can get mighty ornery on your opponents face while your side gets riled up. Great card that is going to win a lot of games.\"}","{\"name\":\"Outcaster Greenblade\",\"rating\":3.5,\"comment\":\"This depends on how many deserts you have in your deck, but this is probably still decent in most decks even if they don’t have any. It can get downright nutty when it’s a three mana 4/5 that replaces itself.\"}","{\"name\":\"Outcaster Trailblazer\",\"rating\":3.0,\"comment\":\"While the card by itself doesn’t do much besides possibly help double spell, it does cheaply trigger synergies with other cards that want a creature with power four or greater. Once it’s down, it can start drawing you extra cards for every time you play a new giant monster.\"}","{\"name\":\"Patient Naturalist\",\"rating\":2.5,\"comment\":\"You’ll hit a land the majority of the time with this, but even if you whiff you still get a treasure to ramp or fix. Hopefully you have some graveyard synergies that this can help you out with as well.\"}","{\"name\":\"Railway Brawler\",\"rating\":4.5,\"comment\":\"Well, this card is nuttier than squirrel poo. A 5/5 reach trample that can be plotted for four (or hard cast for five) is a good card. All of your future creatures coming in at double strength is going to end any resistance your opponent was putting up.\"}","{\"name\":\"Rambling Possum\",\"rating\":3.0,\"comment\":\"There is a ton of possible value to be had by bouncing some of your other creatures with this. This possum even gets extra rowdy when you do it. Definitely ahead of the curve when it comes to self-bounce effects.\"}","{\"name\":\"Raucous Entertainer\",\"rating\":3.0,\"comment\":\"This puts a small tax on making all of your future creatures just a little bit bigger. With plot, you should be able to double spell and get counters on two creatures with this. This can generate a ton of value  over the course of a long game and worst case scenario it is still a bear.\"}","{\"name\":\"Reach for the Sky\",\"rating\":1.5,\"comment\":\"There are going to be times when this wins a combat and sticks around to make life miserable for your opponent. There are also going to be times they kill your creature in response leaving you down four mana and a card.  \"}","{\"name\":\"Rise of the Varmints\",\"rating\":2.0,\"comment\":\"This is difficult to grade because it can be around a 3.0 in the right deck (Heavy on creatures and self mill) all the way down to a 0.5 in some decks (heavy spells while extremely light on creatures). I’ll just leave it here and give you the opportunity to make that decision yourself.\"}","{\"name\":\"Snakeskin Veil\",\"rating\":2.5,\"comment\":\"This card existing in a limited format can dictate so much of what people choose to do. Just leaving up a green can put the fear of losing their removal in them. It also enables stacking a bunch of counters and effects on one creature. It does a lot for very little.  \"}","{\"name\":\"Spinewoods Armadillo\",\"rating\":3.0,\"comment\":\"While two mana to land cycle is a bit much these days (LotR ruined us) this does let you get any basic or a desert while chucking three life in. That’s a much better situation while just casting a giant warded up reach creature doesn’t look too bad either.\"}","{\"name\":\"Spinewoods Paladin\",\"rating\":2.5,\"comment\":\"We keep getting new takes on Ravenous Lindwurm and this one looks like a hit. Dropping it down to five mana makes the small drop in stats and life worth it. Premium common top end.\"}","{\"name\":\"Stubborn Burrowfiend\",\"rating\":3.0,\"comment\":\"A great enabler for some graveyard shenanigans while also providing a payoff at the same time. Sure, it needs saddled, but still a great two drop that could possibly get massive.\"}","{\"name\":\"Throw from the Saddle\",\"rating\":3.0,\"comment\":\"Getting the small boost (which is permanent on a mount) brings this Rabid Bite variant up to snuff with a lot of the other removal in the set. Being in green with Snakeskin veil running around to prevent getting blown out makes this that much better.\"}","{\"name\":\"Trash the Town\",\"rating\":3.5,\"comment\":\"This has a lot going for it and is a great example of what a good spree card should be doing. All of the modes can be reasonable in different situations while being great when you get the whole shebang.\"}","{\"name\":\"Tumbleweed Rising\",\"rating\":1.5,\"comment\":\"This feels too situational for me to want to run it and if I do, I sure don’t want multiples. It’s potentially really efficient later in the game, but vulnerable to removal in response. Too many what ifs for me.\"}","{\"name\":\"Voracious Varmint\",\"rating\":2.5,\"comment\":\"A great way to be able to run artifact and enchantment removal without having it be a potential dead slot. A 2/2 vigilance for two isn’t lighting the world on fire, but is great when it has such a high upside.\"}","{\"name\":\"Brimstone Roundup\",\"rating\":1.5,\"comment\":\"Dropping this early will probably end up giving you 3-4 tokens over the course of the game. Drawing it late is close to a disaster. It feels like it needed to do something on its own like make a token when it ETBs to be worth it.\"}","{\"name\":\"Caught in the Crossfire\",\"rating\":3.0,\"comment\":\"A selective Pyroclasm can put a serious hurting on your poor opponent because you don’t have to make it obvious by not playing creatures. It’s limited to two damage and gets pricy if you want to do both, but still well worth it for the potential blowouts.\"}","{\"name\":\"Cunning Coyote\",\"rating\":2.5,\"comment\":\"I would make the joke about chasing the roadrunner, but everyone else already has. Something something.. Looney Tunes.\"}","{\"name\":\"Deadeye Duelist\",\"rating\":2.5,\"comment\":\"I wouldn’t be this high on this card in most sets, but it’s like striking gold here in Thunder Junction. It is prepared to commit a crime every single turn for the low cost of one mana. Bring on the synergy.\"}","{\"name\":\"Demonic Ruckus\",\"rating\":1.5,\"comment\":\"This is a card I am only playing if it has some great synergy in my deck (which admittedly will be more often than this grade suggests). If you have a lot of things that trigger off playing two spells a turn, then this is a very cheap way to plot something and make that happen.\"}","{\"name\":\"Discerning Peddler\",\"rating\":2.0,\"comment\":\"Getting to rummage away an extra land (or for one early on) is a solid addition on a bear. I can see myself happily adding a couple of these to most red decks.\"}","{\"name\":\"Explosive Derailment\",\"rating\":3.0,\"comment\":\"While the three-mana damage-based removal is just fine, the possibility of hitting an artifact as well puts this in the same grouping as most of the other removal in the set.\"}","{\"name\":\"Ferocification\",\"rating\":2.5,\"comment\":\"While the +2+0 mostly acts like an only on offense Bonesplitter, the hasty menace option is a great way to keep the pressure on.\"}","{\"name\":\"Gila Courser\",\"rating\":2.5,\"comment\":\"Most of the time I doubt you’re going to get more than one attack in with this, but it’s already done its job as long as you get an extra card out of it.\"}","{\"name\":\"Great Train Heist\",\"rating\":3.5,\"comment\":\"Oh man, this is going to cause some problems in combat. Guess I first strike out all your blocks, oh here’s another attack step, maybe I even get some treasure tokens. Who knows? It’ll be a great time.\"}","{\"name\":\"Hell to Pay\",\"rating\":2.5,\"comment\":\"It’ll be hell to pay x+1 toughness to kill a creature. That rate is pretty terrible for killing the creature, but at least you can make some treasures.\"}","{\"name\":\"Hellspur Brute\",\"rating\":3.5,\"comment\":\"It’s not hard to play a couple of cheap outlaws to drop this onto the battlefield for three mana early on. A big ol trampler that early is going to crush some dreams even if it doesn’t do anything else.\"}","{\"name\":\"Hellspur Posse Boss\",\"rating\":4.0,\"comment\":\"Getting three bodies for four mana feels great, giving two of them (and all of your other outlaws) haste feels even better. Those tokens having haste is wonderful because it lets you pump up one of your other creatures right away to get some damage in.\"}","{\"name\":\"Highway Robbery\",\"rating\":2.5,\"comment\":\"They took away the part of Tormenting Voice where you had to consider whether or not to hold lands. Now you just play them out and this will work itself out later.\"}","{\"name\":\"Irascible Wolverine\",\"rating\":2.5,\"comment\":\"This cranky wolverine is about to get aggro on anyone who touches his stuff.\"}","{\"name\":\"Iron-Fist Pulverizer\",\"rating\":1.5,\"comment\":\"This does give you some reach without asking too much of you. There are plenty of cards like Irascible Wolverine that make double spelling as easy as ABC. Still the same problem as other five drops where you can’t really play more than one of them.\"}","{\"name\":\"Longhorn Sharpshooter\",\"rating\":4.0,\"comment\":\"Certainly not in the same range as a Ravenous Chupacabra, but can pull off a decent impression even if you don’t get the creature until the next turn. Plus, there is the old “Oh are you at two?” moments.\"}","{\"name\":\"Magebane Lizard\",\"rating\":1.5,\"comment\":\"I don’t really see a deck that wants to run this. Maybe you can bring it in against a really heavy spells deck. In most cases, it’s hoping to be a card twenty-three curve filler.\"}","{\"name\":\"Mine Raider\",\"rating\":2.0,\"comment\":\"In reality this is going to range from a 1.5 up to 2.5 depending on how many outlaws you have in your deck.\"}","{\"name\":\"Prickly Pair\",\"rating\":3.0,\"comment\":\"I think we all know how these cards perform at this point. While it lacks any form of evasion, it does give you an outlaw with the ability to pass around the pump.\"}","{\"name\":\"Quick Draw\",\"rating\":1.0,\"comment\":\"I may love one mana tricks, but this is not the type that I am looking for.\"}","{\"name\":\"Quilled Charger\",\"rating\":2.0,\"comment\":\"Being able to attack as a 5/5 menace sounds nice and all, but you do have to saddle it up. I would be fine with this as a top end in a very low to the ground deck.\"}","{\"name\":\"Reckless Lackey\",\"rating\":2.5,\"comment\":\"Raging Goblin has seen some serious power creep over the years. This is a great little early beater that makes things awkward because of first strike. When he runs out of uses, you can cash him in for a new card and a treasure token.\"}","{\"name\":\"Resilient Roadrunner\",\"rating\":3.0,\"comment\":\"To quote the Road Runner, “Beep Beep Mother Funker!” (Editor’s note: Josh, I obviously edited that word and I also highly doubt the validity of that quote)\"}","{\"name\":\"Return the Favor\",\"rating\":2.0,\"comment\":\"This feels like one of those cards that you either stare at all game or completely demolish your opponent with. They might as well scoop the poop if you redirect a removal spell and copy it, but it can be extremely awkward at other times.\"}","{\"name\":\"Rodeo Pyromancers\",\"rating\":2.0,\"comment\":\"This is a great way to double or even triple spell on turn five, but the body is merely alright. You don’t really want to draw it later in the game either. Feels like it will be a cut from really good decks, but slide right into ones that got into the right lane a little too late.\"}","{\"name\":\"Scalestorm Summoner\",\"rating\":3.5,\"comment\":\"It’s great that you just have to control (instead of attack with) a beefy creature to get the trigger because you can curve into it. Don’t forget that it can trigger off of itself if you pump it precombat with one of those handy dandy 1/1 mercenaries or a combat trick.  \"}","{\"name\":\"Scorching Shot\",\"rating\":3.0,\"comment\":\"This is pretty close to hard removal for only two mana. Sorcery speed and double red aren’t the greatest, but still a really solid removal spell.\"}","{\"name\":\"Slickshot Show-Off\",\"rating\":3.0,\"comment\":\"I’m sure fellow Draft Lab member Dafore is going to be hyped every time he busts this since we all know his love for Festival Crasher. Flying and haste make this that much sweeter.\"}","{\"name\":\"Stingerback Terror\",\"rating\":4.5,\"comment\":\"Yeah, I know this doesn’t have any extra value tacked on to it. The value is having an extremely cheap, very large trampling flyer. I’m not going to break the math out for this, just trust me it will get the job done.\"}","{\"name\":\"Take for a Ride\",\"rating\":3.0,\"comment\":\"Those of you who remember the days of Ray of Command are well aware of how much you can screw someone’s day up with an instant speed Threaten. If you don’t have anyway to commit a crime at instant speed, you probably shouldn’t be playing this at all.\"}","{\"name\":\"Terror of the Peaks\",\"rating\":4.5,\"comment\":\"This is a messed-up Magic card in limited. Your opponent basically has to have a removal spell that can actually deal with this and pay three life to prevent themselves from taking a one way trip to Wrecksville USA.\"}","{\"name\":\"Thunder Salvo\",\"rating\":2.5,\"comment\":\"This is fine, but really doesn’t do it for me unless I’m playing a heavy spells deck or am really light on removal. If you’re planning on double or triple spelling often, then bump it up a bit.\"}","{\"name\":\"Trick Shot\",\"rating\":2.0,\"comment\":\"This gets significantly better if you’re playing it with cost reducers such as Geyser Drake. Without that, you probably want to limit yourself to one of these per deck so you don’t get stuck staring at multiples.\"}","{\"name\":\"Ambush Gigapede\",\"rating\":1.5,\"comment\":\"I can’t imagine ever wanting to play more than one of these, but it does have some uses if your curve can afford it fit it in.\"}","{\"name\":\"Binding Negotiation\",\"rating\":2.0,\"comment\":\"They call this binding because you’re locked into being stuck with it when you top deck it later. Fine as a one off or a sideboard card against busted bombs. It is a bit better when you can grab their card that they already invested mana into plotting. It is what it is.\"}","{\"name\":\"Blacksnag Buzzard\",\"rating\":1.5,\"comment\":\"This is good if you can get it down with a counter, but pretty lackluster if you can’t. It’ll also be difficult to get them to trade when this is plotted. In that case you can still get there with a removal spell or a sacrifice.\"}","{\"name\":\"Blood Hustler\",\"rating\":3.0,\"comment\":\"This big money hustler is a great way to have a repeatable source of committing a crime that also grows itself in the process. Since the ability is instant speed, you can get two triggers per turn cycle by pinging on their turn.\"}","{\"name\":\"Boneyard Desecrator\",\"rating\":1.5,\"comment\":\"The sacrifice ability is overcosted for something as small as adding a +1+1 counter to this. The treasure if it’s an outlaw really doesn’t make up for the cost. Outside of that, being a 3/4 menace is a little below what I am looking for out of four mana.\"}","{\"name\":\"Caustic Bronco\",\"rating\":3.5,\"comment\":\"While many people have images of Dark Confidant dancing in their heads, needing to attack to get the trigger is significantly worse. The late game option to saddle up to deal damage to them is solid to have so you don’t have to worry about dying to your own card. This still falls into that really good, but not quite great box.\"}","{\"name\":\"Consuming Ashes\",\"rating\":3.0,\"comment\":\"It’s just so difficult to rank removal above this these days unless it does something else great. Surveil two is nice, but you’re only getting it when you trade down on mana. I’m never going to cut this card in a black deck, but I’m also not going to be happy slamming it first pick.\"}","{\"name\":\"Corrupted Conviction\",\"rating\":1.5,\"comment\":\"We’ve had this card a ton of times and it almost always falls into the category of playable in some decks, but often gets played in more than it should. I feel like it’ll be the same here.\"}","{\"name\":\"Desperate Bloodseeker\",\"rating\":2.5,\"comment\":\"Desperate Bloodseeker sounds like something out of a Twilight book. Do people even remember what that was to make fun of it anymore? Anyway, this vamp can really sparkle.\"}","{\"name\":\"Fake Your Own Death\",\"rating\":2.0,\"comment\":\"Faking your own death can really pay off whether it’s through insurance fraud or just getting those pesky bookies off your back. It can also let you trade up with a creature while getting yours back along with a treasure token. Especially great with ETB effects, but still a solid card when it does the thing.\"}","{\"name\":\"Forsaken Miner\",\"rating\":2.0,\"comment\":\"More of a constructed card than a limited one, but still fine in an aggressive deck. It starts the curve off at one and can come back anytime you commit a crime, but not being able to block does take a big chunk out of the usefulness of a recursive creature.\"}","{\"name\":\"Hollow Marauder\",\"rating\":3.5,\"comment\":\"I like the effect; I don’t love the price for it. Even with a couple creatures in your graveyard, it still costs five mana. If you have some self-mill or plan to play a late game, it gets a lot more manageable. \"}","{\"name\":\"Insatiable Avarice\",\"rating\":1.5,\"comment\":\"I’m grading this with the assumption that you are heavy black, if not then you don’t ever want to play this card. Tutors aren’t great in limited especially when you go down a card to put a card on top of your library. The draw three is solid, but as we discussed it takes a very heavy investment in black.\"}","{\"name\":\"Lively Dirge\",\"rating\":2.0,\"comment\":\"Whether you want this is entirely dependent on how much value you can get out of cheap creatures. Being able to tutor for one is nice, but you really need to have some good targets once you’re up to five mana.\"}","{\"name\":\"Neutralize the Guards\",\"rating\":2.0,\"comment\":\"While a great sideboard card against some decks, you can mainboard this if you plan to be in combat a lot. The instant speed -1-1 to all their creatures can usually turn a trade into a victory and has potential to be a giant blowout.\"}","{\"name\":\"Nezumi Linkbreaker\",\"rating\":2.5,\"comment\":\"You can’t really go wrong with a one mana creature that dies into another creature. It feels like something that might be undervalued early on, but will be a higher pick once people figure out the format.\"}","{\"name\":\"Overzealous Muscle\",\"rating\":1.5,\"comment\":\"While you can’t stuff too many five drops in your deck, this is going to be very annoying to deal with and hits like a truck.\"}","{\"name\":\"Pitiless Carnage\",\"rating\":1.5,\"comment\":\"A nice late game way to filter your extra lands into new cards, but really doesn’t do much earlier in the game. There are going to be times you’re like “OMG they drew six cards and I lost to it”. There are also going to be times its sitting in their hand all game doing nothing.\"}","{\"name\":\"Rakish Crew\",\"rating\":3.0,\"comment\":\"Not quite Bastion of Remembrance but it does a reasonable facsimile. Just have a pile of outlaws and this is going to be extremely annoying for your opponent.\"}","{\"name\":\"Rattleback Apothecary\",\"rating\":2.5,\"comment\":\"Menace plays so well with deathtouch making this very difficult to block as long as you’re committing some crimes. Being able to pass lifelink around can make it very difficult for your opponent to race.\"}","{\"name\":\"Raven of Fell Omens\",\"rating\":2.5,\"comment\":\"Adding a drain to every crime is good, but limiting to once per turn is a bit of a downer. This can also slowly peck them to death in the air along with those drains. \"}","{\"name\":\"Rictus Robber\",\"rating\":3.5,\"comment\":\"Great value as long as you can coax a trade out of your opponent. Even if they are unwilling to comply, the old removal into this will do the trick.\"}","{\"name\":\"Rooftop Assassin\",\"rating\":2.5,\"comment\":\"I’m normally pretty low on these Manticore type effects, but the lifelink is a decent bump up for me. It even had a relevant creature type. Sometimes it’s the little things that add up.\"}","{\"name\":\"Rush of Dread\",\"rating\":4.0,\"comment\":\"This is one of those cards where all the effects are situational, but it’s still great because you can select which ones you want including all of them. It can lead to a lot of interesting lines where you are trying to maximize value out of it which bumps it up a bit for me.\"}","{\"name\":\"Servant of the Stinger\",\"rating\":3.5,\"comment\":\"I am a fan of cheap deathtouch creatures and this makes attacking extremely awkward for your opponent. Turning into a Demonic Tutor if it gets through and you’ve committed a crime is alright, but I feel like the three toughness deathtoucher is going to matter a lot more.\"}","{\"name\":\"Shoot the Sheriff\",\"rating\":2.5,\"comment\":\"Very cheap efficient removal, but there are going to be a lot of games where it doesn’t hit anything you want it to. My buddy Floridamun was notorious for always having Go for the Throat in BRO while his opponent had all artifact creatures (well that and also notorious for that time he threw a gator in a Wendy’s drive through window).\"}","{\"name\":\"Skulduggery\",\"rating\":2.0,\"comment\":\"Those of you who have gotten wrecked by Subtle Strike will have some flashbacks with this. Not getting a counter out of it is a huge step down, but only costing one mana is pretty nice.\"}","{\"name\":\"Tinybones Joins Up\",\"rating\":1.0,\"comment\":\"You would have to have a pretty big chunk of legendary creatures to want to play this. Target player discards a card for one mana just isn’t good unless you have multiple ways to bounce it. Maybe if you have a couple Nurturing Pixie.\"}","{\"name\":\"Treasure Dredger\",\"rating\":2.5,\"comment\":\"This looks very innocuous but can enable a ton of shenanigans. If you see your opponent drop this on turn two, do not expect a normal game of Magic to occur.\"}","{\"name\":\"Unfortunate Accident\",\"rating\":3.0,\"comment\":\"Getting extra value is pretty key on one for one removal and this gives you that even if it is a bit pricy. That’s what is wonderful about Spree, it’s an option when you need it and doesn’t hinder you when you don’t.\"}","{\"name\":\"Unscrupulous Contractor\",\"rating\":3.0,\"comment\":\"Do you really need to add the unscrupulous to this? At least you can assume all of the contractors here in Florida meet the description.\"}","{\"name\":\"Vault Plunderer\",\"rating\":2.5,\"comment\":\"Phyrexian Rager has always been a good limited card and while everything else has value too these days, getting a card when you play it always felt good. I would typically prefer that 2/2 to the 3/1, but there will be times this is better.\"}","{\"name\":\"Canyon Crab\",\"rating\":2.5,\"comment\":\"Is this the Canyon Crab? No, this is Patrick.\"}","{\"name\":\"Daring Thunder-Thief\",\"rating\":1.5,\"comment\":\"Thunder thief? Sounds like someone wanted to be called the lightning thief and ran into copyright issues. Everyone at this dude’s school 100% still called him Percy Jackson. “What up Percy, steal any thunder today?”\"}","{\"name\":\"Deepmuck Desperado\",\"rating\":1.5,\"comment\":\"You would need multiples of this and plenty of ways to commit crimes to go all in on the mill plan. Still the floor of a decent blocker isn’t atrocious so you could just run it with the fallback plan of situational milling coming up.\"}","{\"name\":\"Double Down\",\"rating\":4.0,\"comment\":\"I’m grading this as a pack one pick one so that you know you should be prioritizing outlaws. If it’s pack three and you don’t have any, go ahead and pass it along.\"}","{\"name\":\"Duelist of the Mind\",\"rating\":3.5,\"comment\":\"I’m sure this can do some real work in constructed. In limited, its going to be harder to get to go off with it. A vigilant, flyer with varying power that lets you loot when you commit a crime is still a bargain for two mana.\"}","{\"name\":\"Emergent Haunting\",\"rating\":3.5,\"comment\":\"It won’t be too difficult to turn this into a 3/3 flyer as long as you plot or just want to hold up something at instant speed. The Surveil even gives you an option to still do something relevant while chilling.\"}","{\"name\":\"Failed Fording\",\"rating\":2.0,\"comment\":\"This is what happens to me every time on the Oregon Trail. Well, either that or I die of dysentery.\"}","{\"name\":\"Fleeting Reflection\",\"rating\":2.0,\"comment\":\"This does just enough different things to make me want to play a copy of it. The hexproof and untap is nice if a little overcosted, but the surprise turning into the best creature on the field can pull some surprise victories.\"}","{\"name\":\"Geyser Drake\",\"rating\":2.5,\"comment\":\"The stats are at least better than a Wind Drake and you can cast cheaper instants during their turn. Solid bread and butter card.\"}","{\"name\":\"Harrier Strix\",\"rating\":2.0,\"comment\":\"Not on the same level as Network Disruptor despite being almost a straight upgrade because this format doesn’t have ninjutsu. Still a fine addition to a deck trying to win through the air that gives you some card selection.\"}","{\"name\":\"Jailbreak Scheme\",\"rating\":3.0,\"comment\":\"While sorcery speed, three mana to put a creature on top or bottom of their library is a huge step up from the four mana ones. Having the option to make one of your creatures unblockable (while adding a +1+1 counter) or even getting both options is huge.\"}","{\"name\":\"The Key to the Vault\",\"rating\":2.5,\"comment\":\"This one is a little rough to rate because the ability is undeniably powerful, but it is expensive and usually requires some evasion. It also does very little if you are behind without a way to sneak through damage. I’m sure there will be games where it just takes over, but we have to account for all the scenarios that it does nothing.\"}","{\"name\":\"Loan Shark\",\"rating\":3.0,\"comment\":\"My biggest disappointment in this set is that this shark doesn’t have a fedora on.\"}","{\"name\":\"Marauding Sphinx\",\"rating\":3.5,\"comment\":\"The riddle that this Sphinx presents is how your opponent is going to get through it. The ward two makes it rough to get out of the way and a vigilant flyer with five toughness is a real problem. The surveil two whenever you commit a crime is just the icing on the cake.\"}","{\"name\":\"Metamorphic Blast\",\"rating\":2.5,\"comment\":\"Another great example of why Spree is a fantastic limited mechanic. The two mana turn something into one toughness has been a solid limited card for a while. You can either use it as a combat trick or wait until after damage is dealt to kill the creature off once it is guaranteed to have damage on it. While no one is looking to play Inspiration these days, there are certainly times you would be happy to draw it. This gives you the ability to get both out of one card. You’ll be the only one having a blast when you do it.\"}","{\"name\":\"Nimble Brigand\",\"rating\":2.5,\"comment\":\"The real crime is the cards you drew along the way. Oh, maybe I should have went with “in this case, crime does pay”. Whatever, being able to grip an extra card every turn that you commit a crime is pretty solid.\"}","{\"name\":\"Outlaw Stitcher\",\"rating\":3.5,\"comment\":\"You’re probably better off plotting something else first then playing this on turn four than plotting this on turn five to play on six after playing other cards. Even if you don’t play anything it is 3/6 worth of stats across two bodies, but with even one spell it is suddenly up to 5/8 which is a freaking bargain. I might be underrating this, but it does have potential to be a bit clunky sometimes.\"}","{\"name\":\"Peerless Ropemaster\",\"rating\":1.5,\"comment\":\"I don’t know about the whole peerless thing; they may be overstating their abilities. Only hitting tapped creatures makes this much better as a defensive card. It’ll occasionally be a one of, but I don’t see it doing much more than that.\"}","{\"name\":\"Phantom Interference\",\"rating\":3.0,\"comment\":\"Anytime we’re talking about Quench cards, it really depends what you get thrown in. The fallback of an overcosted Wind Drake is better than nothing, but getting both for a total of five mana feels great off of a common.\"}","{\"name\":\"Plan the Heist\",\"rating\":2.5,\"comment\":\"Back in the original OTJ (Odysey, Torment, Judgement), Concentrate was a great first pick. This is a straight upgrade in multiple ways and it will be just fine. I don’t really want to plot this just to wait until I run out of cards unless it helps with other plot centric cards.   \"}","{\"name\":\"Razzle-Dazzler\",\"rating\":1.5,\"comment\":\"I do like double spelling, but I feel like the downside of drawing this late matters more than the possibility of slowly growing it.\"}","{\"name\":\"Seize the Secrets\",\"rating\":2.5,\"comment\":\"Another strict upgrade on Divination, but I feel like I will be trying to use my card draw spots on Phantom Interference when possible. This will work great in any deck focusing on casting multiple spells a turn though.\"}","{\"name\":\"Shackle Slinger\",\"rating\":3.0,\"comment\":\"A card that pays you off for slinging spells. I was planning on double spelling anyway, might as well get something extra out of it.\"}","{\"name\":\"Shifting Grift\",\"rating\":1.5,\"comment\":\"Do you have ways to make crappy creatures you don’t care about? Then this might make the cut. Sometimes you’ll come off as a genius and a grifter, but there’s a chance you’re the one who gets grifted. \"}","{\"name\":\"Slickshot Lockpicker\",\"rating\":3.5,\"comment\":\"Snapcaster Mage that we have at home is still pretty good. The extra mana and lack of flash are definitely real hits, but the plot makes it really easy to cast a relevant spell as well as get a double spell trigger.\"}","{\"name\":\"Slickshot Vault-Buster\",\"rating\":2.0,\"comment\":\"For clarity, this isn’t a trigger every time you commit a crime, it is just an effect if you have committed a crime. It will still be difficult to block or attack through because they have to consider that it is pretty easy to commit a crime.\"}","{\"name\":\"Spring Splasher\",\"rating\":1.5,\"comment\":\"This really only goes into an aggro blue deck and one toughness can get punished pretty hard in a format that makes 1/1 tokens. It does commit plenty of crimes though. \"}","{\"name\":\"Step Between Worlds\",\"rating\":2.0,\"comment\":\"It’s sort of a Timetwister except that it’s more expensive and they can choose whether or not they do it. Potentially powerful, but I’m going to be very selective about which decks I play this in.\"}","{\"name\":\"Stoic Sphinx\",\"rating\":4.0,\"comment\":\"Five power flyer for four mana on their end step seems good. The hexproof is great because you can usually attack with it before they have a chance to do anything about it. It also makes it very difficult to ever hit with sorcery speed removal unless you cast something before their end step.\"}","{\"name\":\"Stop Cold\",\"rating\":3.0,\"comment\":\"While it doesn’t exile the creature, it does take away all of its abilities so it is close.  The flash makes me think that this will be a valuable removal spell.\"}","{\"name\":\"Take the Fall\",\"rating\":3.0,\"comment\":\"I might seem like I am massively overvaluing this card, but it does so many things that you want to be doing in this set. A one mana instant speed way to commit a crime that replaces itself would just be a good card in this format. This does that with the potential to win a combat. Trust me, you should take this higher than you were planning to.\"}","{\"name\":\"Three Steps Ahead\",\"rating\":4.0,\"comment\":\"While not quite Sublime Epiphany, this does a solid impersonation while also having the option to just have a straight up Cancel when you need it. Versatility with huge power potential.\"}","{\"name\":\"Visage Bandit\",\"rating\":2.5,\"comment\":\"Clone that can only hit your creatures is very situational, but getting to plot it for three and bring it in at a better time bumps it up a bit.\"}","{\"name\":\"Another Round\",\"rating\":1.0,\"comment\":\"This has so many things going against it. It’s sorcery speed, potentially mana intensive, and can only hit your own creatures. I believe they have a phrase for this. That’s right, it’s another commander plant.\"}","{\"name\":\"Archangel of Tithes\",\"rating\":4.5,\"comment\":\"The main knock on this is the triple white in the casting cost. It’s well above rate at four mana, but it loses some value if you have to wait until turn six of seven to play it.\"}","{\"name\":\"Armored Armadillo\",\"rating\":1.5,\"comment\":\"This looks pretty bad on the surface, but you’ll want it in any deck that wants to stall. That’s for either winning through the air or because your deck can take over in the late game. While very mana intensive, later in the game your wall turns into a very real threat.\"}","{\"name\":\"Aven Interrupter\",\"rating\":4.0,\"comment\":\"This feels like one of those cards that will end up causing a lot of complaints. It is such a huge tempo play on turn three and even helps delay them later in the game. That’s not even getting into how bad it wrecks tricks or counterspells.\"}","{\"name\":\"Bounding Felidar\",\"rating\":1.5,\"comment\":\"As fun as riding a cat beast mount sounds, this costs a whopping six mana and it is 2024. A card better be taking over the game when you cast something for that price. This does have the potential to do that and certain decks will want this when lacking other good ways to end the game. I suspect that you can usually do better.\"}","{\"name\":\"Bovine Intervention\",\"rating\":1.5,\"comment\":\"I am required to grade this while ignoring the excellent dad level pun here. Two mana to kill any creature is a bargain, but giving them a 2/2 matters a lot. These effects giving even a 1/1 have always been a problem and a bear is certainly going to be more annoying. It can still be worth it to kill problem creatures, but not something I’m ever going to be excited about main boarding.\"}","{\"name\":\"Bridled Bighorn\",\"rating\":2.0,\"comment\":\"A vigilant 3/4 for four mana isn’t anything to write home about, but this does poop out a token every turn as long as you have something to hop in the saddle. That’ll help it make the cut more often than not, you just can’t stack up too many of them.\"}","{\"name\":\"Claim Jumper\",\"rating\":3.0,\"comment\":\"The value of this is going to heavily swing based off of whether you are on the play or the draw. You’re either going to need them to ramp or be kind of mana screwed to repeat it, but just getting one Plains makes this a great deal.\"}","{\"name\":\"Dust Animus\",\"rating\":4.0,\"comment\":\"You’ll leave your opponent in the dust with this card as long as you hit your fifth land drop. It’s so much better than a suspend creature because even if you draw it turn four, you can still cast it “on curve”. In the way late game, you don’t even have the delay since you can just cast it with five more lands untapped.\"}","{\"name\":\"Final Showdown\",\"rating\":4.0,\"comment\":\"When your opponent plays their last card in hand, you can start singing it’s The Final Showdown. They’ll get it if they were alive in the 80s.\"}","{\"name\":\"Frontier Seeker\",\"rating\":3.5,\"comment\":\"A two power for two mana creature that can replace itself is the exact kind of card that I’m going to be seeking for my deck. Five is a decent chunk to be looking at so as long as you have some mounts this is likely to hit something. Just don’t do something silly and splash this which would make it far less likely that you get something off of it.\"}","{\"name\":\"Getaway Glamer\",\"rating\":3.0,\"comment\":\"Only requiring a creature to have the highest power instead of above a certain number makes this far more likely to just work as a Murder. Having the option to exile another one of their creatures until the next end step could give you great attacks. It can also be used to save one of your creatures. That’s a lot of options for not a lot of mana.\"}","{\"name\":\"High Noon\",\"rating\":1.0,\"comment\":\"The first effect has always been pretty sad in limited. If you really want to spend seven mana in two colors to hit something for five damage, then this is the card for you. I really hope you’re not that hard up for playables.\"}","{\"name\":\"Holy Cow\",\"rating\":2.5,\"comment\":\"Wizards may have let a bunch of people go, but they sure did make sure their resident dad joke guy was still there.\"}","{\"name\":\"Inventive Wingsmith\",\"rating\":1.5,\"comment\":\"Plot makes not casting a spell from your hand much more feasible early in the game. Once this takes to the skies, its got a big butt to make things difficult for your opponent up there.\"}","{\"name\":\"Lassoed by the Law\",\"rating\":3.5,\"comment\":\"Being able to tie up any permanent is nice, but at four mana needs something else tossed in. Getting the 1/1 Mercenary that can pump certainly qualifies as enough to be extremely happy when the ropes come out.\"}","{\"name\":\"Mystical Tether\",\"rating\":3.0,\"comment\":\"It wasn’t that long ago that you would have been happy with this card even without the option to flash it in. While removal isn’t what it used to be, this still gets the job done when it comes to dealing with problematic threats.\"}","{\"name\":\"Nurturing Pixie\",\"rating\":3.0,\"comment\":\"As long as you have some things that make the bounce worth having then this is a bargain. This being so cheap can let you drop what you just picked up right away while adding this now relevant threat to the board. It can even do a Scryb Sprite impression if you really need it to.  \"}","{\"name\":\"Omenport Vigilante\",\"rating\":3.0,\"comment\":\"This can go crazy early on as long as you have some cheap ways to commit some crimes. It is the wild west. There should be plenty of ways to do that.\"}","{\"name\":\"One Last Job\",\"rating\":2.5,\"comment\":\"While there aren’t a ton of equipment or auras running around, just getting to bring back a creature and a Mount will be a pretty big swing in the game.\"}","{\"name\":\"Outlaw Medic\",\"rating\":2.5,\"comment\":\"This is going to be an extremely annoying blocker that lets you win through the air while your opponent throws things. They usually have to use a real card to deal with it which just lets you replace it. Outside of that it shuts down their bear attacks while gaining you life.\"}","{\"name\":\"Prairie Dog\",\"rating\":3.5,\"comment\":\"You shouldn’t have too much trouble growing this because of Plot, but it also has the built-in option of just using its ability to add two counters instead. Outside of that a 2/2 lifelink for two is just a good limited card.\"}","{\"name\":\"Prosperity Tycoon\",\"rating\":3.5,\"comment\":\"5/3 worth of stats across two bodies for four mana is a pretty solid way to kick things off. The threat of activation will usually let you freely crack in with this and you’re not going to be too disappointed if they decide to trade a real card for one of your tokens. Obviously, this improves if you have treasure tokens.\"}","{\"name\":\"Requisition Raid\",\"rating\":2.5,\"comment\":\"I would love this card if it was instant speed, but the sorcery speed aspect holds it back from being a great trick. Paying two mana to put a +1+1 counter on all of your creatures is fine in any deck looking to go wide and this gives you a way to deal with artifacts/enchantments without it being a dead card. \"}","{\"name\":\"Rustler Rampage\",\"rating\":2.5,\"comment\":\"This is a decent trick that gets bumped up a bit because of its versatility. Whether you’re blowing out their attack or sneaking through an unexpected lethal, it’s a rampage worth doing.\"}","{\"name\":\"Shepherd of the Clouds\",\"rating\":3.5,\"comment\":\"This is amazing if you put the creature directly into play and merely solid if you don’t. Just make sure you have some other mounts because no one is riding this Pegasus.\"}","{\"name\":\"Sheriff of Safe Passage\",\"rating\":1.5,\"comment\":\"It’s weird that the Sheriff of Safe Passage has zero correlation with Safe Passage. Oh well, what are you going to do.\"}","{\"name\":\"Stagecoach Security\",\"rating\":2.0,\"comment\":\"A decent top end payoff for making all of those Mercenary tokens. Plotting it gives them time to prepare, but it’s a nice option for when you don’t have anything else to add to the board that turn.  \"}","{\"name\":\"Steer Clear\",\"rating\":1.5,\"comment\":\"Another expert level dad pun that’ll have the kids face palming while muttering soemthing about cringe. This is cheap enough that it can usually make the cut as long as you have some mounts.\"}","{\"name\":\"Sterling Keykeeper\",\"rating\":2.0,\"comment\":\"One of the cool things about tappers is how much it messes with vehicles because they can’t crew them without letting you basically tap two creatures. That doesn’t pop up with mounts because this not so Sterling Keykeeper can’t tap them.\"}","{\"name\":\"Sterling Supplier\",\"rating\":2.5,\"comment\":\"It’s Aeronaut Cavalry without the soldier restriction. That card was an early overperformer in that format and while this is a completely different situation, I suspect it could be here as well.\"}","{\"name\":\"Take Up the Shield\",\"rating\":2.5,\"comment\":\"This is a reprint from DMU where it could swing games out of nowhere with the lifelink or protect a key creature while pumping it. There are plenty of relevant creatures in this format that will love to take advantage of the same circumstances.\"}","{\"name\":\"Thunder Lasso\",\"rating\":2.0,\"comment\":\"Thunder! Thunder! Thunder Lasso! Oh man that was bad. \"}","{\"name\":\"Trained Arynx\",\"rating\":2.0,\"comment\":\"While 3/1 for two is a pretty disappointing stat line these days, the possibility of first strike changes the equation a bit. Needing to saddle two is a bit harsh, but at least you can use creatures that are still summoning sick to do it.\"}","{\"name\":\"Vengeful Townsfolk\",\"rating\":2.5,\"comment\":\"Creatures with this type of effect have always been hit or miss depending on the game. The difference here is that you’re starting out with a Centaur Courser so you’re not too far behind the curve when it comes down.\"}","{\"name\":\"Wanted Griffin\",\"rating\":2.0,\"comment\":\"When this creature dies effects are so much worse than comes into play effects. A clunky flyer that dies into a 1/1 is still playable, but not that great. I don’t know who it’s wanted by, but it sure isn’t me.\"}"]