["{\"name\":\"Ankle Biter\",\"rating\":2.0,\"comment\":\"I like a good deathtoucher in Limited. They trade up against larger creatures and hold the ground against attackers. I wouldn't be embarrassed to start an Ankle Biter, and there are matchups where I'd be quite excited to sideboard it in.\"}","{\"name\":\"Goldvein Hydra\",\"rating\":4.0,\"comment\":\"Goldvein Hydra is a borderline bomb. It hits hard and dominates the battlefield with vigilance. If-and-when they do fight through it, you get an influx of Treasures out of the deal.I really love cards that are scalable like this, although Goldvein Hydra is almost \\\"too good\\\" to justify playing it for a low X value. I think you really want to be spending five or more mana on this to get the most bang for your buck.\"}","{\"name\":\"Smuggler's Surprise\",\"rating\":2.5,\"comment\":\"Smuggler's Surprise has a collection of weird abilities that look like they're designed more for Constructed than for Limited. That said, I really like the first mode, which has you spending three mana for a -style effect. The second mode is mostly useless in Limited. The third one is powerful, but highly situational.In short, you get a decent baseline and the blowout potential of spending four mana to save a big creature and \\\"draw\\\" two cards. I'd play Smuggler's Surprise if I had a few strong four-power creatures, but I'm unlikely to spend an early pick on it.\"}","{\"name\":\"Snakeskin Veil\",\"rating\":2.5,\"comment\":\"Snakeskin Veil is a reprint of a useful card, and is highly efficient at what it does. The best use case is saving a creature from a removal spell. You can also use it as a combat trick, although +1/+1 can rarely swing a losing combat into a winning combat - it's more likely to shift a losing combat into a trade. Overall a solid card and you should typically start your first copy.\"}","{\"name\":\"Trash the Town\",\"rating\":3.5,\"comment\":\"Trash the Town is just what I want in a spree. It has multiple affordable modes that I'm okay using individually. On the other hand, when you max out your investment, you get a synergistic effect that gives you a game swinging amount of value.Two-drop going unblocked on turn three? Feel free to cash in your two mana to draw two cards. Two-drop getting blocked on turn three? Unload some counters to win combat and leave behind a giant threat. Have more mana in the mid or late game? Make a big trampler to steamroll the opponent and draw some cards! You can even target separate creatures with each mode if you prefer it.\"}","{\"name\":\"Aloe Alchemist\",\"rating\":3.5,\"comment\":\"Similarly, Aloe Alchemist is a totally sick aggressive creature that helps you unload a ton of damage. Granting +3/+2 and trample (note that it is sorcery speed) likely makes it impossible for the opponent to block, and can easily be worth four or five damage. Next turn, you get to double-spell with an above-rate creature that you already plotted. Your opponent is gonna need something for that level of burn!\"}","{\"name\":\"Bristlepack Sentry\",\"rating\":2.0,\"comment\":\"We've seen similar creatures in a variety of forms. At 2/3, they're passable defenders, but unexciting on the whole. At 3/3, Bristlepack Sentry seems like a pretty strong card, where you can brickwall the opponent early and then close the game quickly once your big monsters start sticking on the battlefield. Even so, I doubt you'll need to spend a high pick on these, and should be able to pick them up later.\"}","{\"name\":\"Bristly Bill, Spine Sower\",\"rating\":4.5,\"comment\":\"Even without the activated ability, Bristly Bill would do a nice  impression, distributing permanent bonuses in a way that makes things as difficult as possible on the opponent. However, once the five mana activation comes online, it's going to be completely impossible for your opponent to keep up with the size of your creatures.Bristly Bill is an outright bomb that can dominate any stage of the game. I'm tempted to give him a perfect 5.0, but I suppose there can be some games where you miss land drops, or draw Bill late without enough counters to leverage.\"}","{\"name\":\"Dance of the Tumbleweeds\",\"rating\":2.0,\"comment\":\"Dance of the Tulmbleweeds is slightly below rate in any form. That said, the flexibility adds up to a solid, playable card. I wouldn't be thrilled to toss this into any old G/W or G/R beatdown deck, but I'm sure I'll draft some multicolor ramp decks where I'll be ready to tango.\"}","{\"name\":\"Gold Rush\",\"rating\":3.0,\"comment\":\"Winning combat and leaving a little something behind is a tried and true recipe. Gold Rush even has the potential to scale up the stat boost into something massive if you happen to have a few other treasures lying around.\"}","{\"name\":\"Hardbristle Bandit\",\"rating\":3.0,\"comment\":\"I'm basically always on board for a two-drop mana dork in Limited. Hardbristle Bandit is a good version because it fixes for any color of mana, and because it can give you two mana to help double-spell on turns where you're committing crimes.\"}","{\"name\":\"Intrepid Stablemaster\",\"rating\":3.0,\"comment\":\"As you'd expect the uncommon Intrepid Stablemaster is even stronger than the common mana dork. A 2/2 with reach is actually a formidable body. And with how strong some of the Mounts are, powering one out way ahead of schedule will lead to some easy wins.\"}","{\"name\":\"Raucous Entertainer\",\"rating\":3.0,\"comment\":\"Raucous Entertainer has a very different impact than the mana dorks. However, it's similar in the sense that it will help green decks overpower opponents on midgame turns. Getting two counters out of this makes it a great card. And with plot abilities, it'll be easy to get two counters in the same turn, to say nothing of the value you'll accumulate in longer games.\"}","{\"name\":\"Stubborn Burrowfiend\",\"rating\":3.0,\"comment\":\"Stubborn Burrowfiend earns the same 3.0 rating as the other green two-drops, although this one is more of a standalone brawler and less of a setup creature. You can realistically be attacking as a 3/3 on turn three, and it can become absolutely massive in the late game.\"}","{\"name\":\"Throw from the Saddle\",\"rating\":3.0,\"comment\":\" doesn't need a bonus to be a strong removal spell, but we got one here. Throw from the Saddle gives any creature a temporary bonus to kill larger threats and unload damage in combat. If you target a Mount, you pick up a permanent +1/+1 counter. This is very pushed for a common removal spell!\"}","{\"name\":\"Tumbleweed Rising\",\"rating\":2.0,\"comment\":\"The plot mechanic already makes OTJ heavy on cards that require long-term planning. Tumbleweed Rising is a particularly extreme version, where you can't cast it early at all, but then can wind up with a highly efficient play on a midgame turn. I don't like to prioritize cards like this, since things have to be going reasonably well before you can get your money's worth. That said, it's a solid card and I'm sure it'll have its moments and its place.\"}","{\"name\":\"Voracious Varmint\",\"rating\":2.5,\"comment\":\"Voracious Varmint is yet another solid two-drop that maintains its value in the late game. I wouldn't describe OTJ as particularly heavy on artifacts and enchantments, but there's really no downside to the Varmint considering its mana cost and stats. I'll usually play as many of these as I can get, and consider it a bonus when juicy targets show themselves.\"}","{\"name\":\"Beastbond Outcaster\",\"rating\":3.0,\"comment\":\"Beastbond Outcaster is among the stronger payoffs for the power four or greater theme. When things go well, it's like a  that only costs you two or three mana instead of the full four. Even if you can't present a big creature, the buyout of a reasonably-priced 3/3 makes Beastbond Outcaster a good card that can potentially be great.\"}","{\"name\":\"Drover Grizzly\",\"rating\":2.5,\"comment\":\"Drover Grizzly isn't particularly impressive as a standalone, since it can trade down against cheaper creatures, or ones that have already given your opponents value. On the other hand, it works perfectly with everything green wants to do. It's the cheapest and most reliable way to present both a Mount and a four-power creature. With the way green's creatures and combat tricks are sized, giving your whole team trample ain't nothin' either!\"}","{\"name\":\"Freestrider Commando\",\"rating\":2.5,\"comment\":\"Freestrider Commando is a little more of what I look for in a standalone creature. I like three mana for a 3/3 more than three mana for a 4/2 (that's true in a vacuum, but not true in the context of this format). More importantly, you can choose to invest four mana to wind up with a 5/5 if patience seems appropriate in the given situation. The combination of stats and flexibility makes the Commando a good card.\"}","{\"name\":\"Freestrider Lookout\",\"rating\":3.0,\"comment\":\"I'm a fan of Freestider Lookout. Three mana for a 3/3 with multiple upsides is just where I wanna be. Picking lands out of your deck is pretty slow, as you won't get to use the mana until quite deep into the game. Still, green looks like a color that can put extra lands to good use, and I'm a sucker for this kind of accumulated long-term value.\"}","{\"name\":\"Ornery Tumblewagg\",\"rating\":4.5,\"comment\":\"Ornery Tumblewagg resembles  – a certified bomb that distributes +1/+1 counters to make your team massive. Tumblewagg costs one additional mana, and you have to risk it in combat in order to get full value. On the other hand, it requires no additional mana investment, and still works when you're missing land drops.Honestly, a head-up comparison between Bill and Tumblewagg isn't particularly helpful, since they're both outrageous cards, and you should take them whenever you see them.\"}","{\"name\":\"Outcaster Greenblade\",\"rating\":3.5,\"comment\":\"Outcaster Greenblade is another banger. A reasonably body that finds a land is always good, and Greenblade is much better than that. It can find a Desert, which is a value land; and, Greenblade can easily grow to be a 3/4 or a 4/5! If you actually wind up with zero Deserts - which will be rare - I suppose you could consider cutting this (though I'd still play it in most decks). With a single Desert, it's a great value card. If you get a bunch, then enjoy an above-rate creature that also gives you value when you cast it.\"}","{\"name\":\"Outcaster Trailblazer\",\"rating\":3.5,\"comment\":\"Outcaster Trailblazer is like a supercharged version of . At three mana, it's the cheapest way to turn on your four-power synergies. Importantly, it's also a payoff for these same synergies, making it a great inclusion in a well-built green deck.With the plot ability, you can set up to cast Trailblazer and then leverage the mana to cast a fatty and draw a card immediately all in one turn.\"}","{\"name\":\"Patient Naturalist\",\"rating\":3.0,\"comment\":\"Patient Naturalist is yet another way to generate a body and get some value while you do it. About 80 percent of the time you'll get the card advantage of putting a land into your hand. The other 20 percent, you'll ramp your mana with a Treasure (this could wind up being better or worse, depending on the circumstances. Note that you can't choose). If you have some graveyard synergies, that's even better!\"}","{\"name\":\"Rambling Possum\",\"rating\":3.0,\"comment\":\"Rambling Possum looks like a classic Mount in the sense that it attacks as an oversized creature while saddled. On the other hand, it's atypical in giving you the option to return the creatures you used to saddle to your hand. You might choose to do this if you want to replay them as untapped blockers. Alternatively, you can get a lot of value if you're returning creatures with enters-the-battlefield abilities.\"}","{\"name\":\"Colossal Rattlewurm\",\"rating\":4.0,\"comment\":\"Colossal Rattlewurm is an enormous trampler, and it shouldn't be difficult to take advantage of both of its additional abilities (having three Deserts in your deck puts you in good shape).Between the rarity (which makes it hard to play around) and the sizing, I'd expect to be able to flash this in and gobble up an opposing attacker more often than not. In the world where you kill an opposing creature and then bash in for six, even if your opponent can then answer the Rattlewurm, it's likely too late for them to get back into the game. You even capture some graveyard value if this dies, or if you happen to mill or discard it. Quite honestly, 4.0 is more likely to be an underestimation than an overestimation.\"}","{\"name\":\"Giant Beaver\",\"rating\":2.5,\"comment\":\"Giant Beaver is yet another solid creature that can power up both your Mount synergies and your four-power synergies. Vigilance is big here, since it means you can make a saddled attack while still having a blocker available for opponents trying to race.\"}","{\"name\":\"Map the Frontier\",\"rating\":1.5,\"comment\":\"Map the Frontier might have excited me six or seven years ago, but most Limited formats these days move too fast for this type of effect. Compared to , Map the Frontier is better for the decks that are extremely dedicated to the ramp, mana fixing or Desert plan, but it's worse for any old deck. Be sure you've carefully mapped out your game plan before you put this in your deck.\"}","{\"name\":\"Reach for the Sky\",\"rating\":2.0,\"comment\":\"Flash plus put into the graveyard trigger corrects a few of the traditional weaknesses of Reach for the Sky. This is fine card that can help you profitably win a combat step, or make a giant threat and push extra damage. All of that said, it's a pricey card that does nothing but enhance an existing creature, so I wouldn't put much of a premium on it. It'll be sketchy in multiples, and you'll often be able to pick one up later in the draft.\"}","{\"name\":\"Rise of the Varmints\",\"rating\":1.5,\"comment\":\"Rise of the Varmints is a build-around payoff for self-mill strategies. It could be passable in a normal deck to try for two or three tokens, but I wouldn't be excited about that due to the inability to cast it in the early game.On the other hand, if you have a high creature count and a bit of dedicated self-mill, it seems realistic to generate four or more Varmints, which is a game-winning play. This isn't quite  because you have to actually draw your payoff card rather than milling it incidentally. Still, it's something that's potentially both fun and powerful.\"}","{\"name\":\"Full Steam Ahead\",\"rating\":2.0,\"comment\":\"Full Steam Ahead is a pretty strong version of the  effect (not quite as strong as the original Overrun, but we haven't seen that in many years). That said, this type of effect is less appealing than it used to be, as today's Limited games tend to be more about efficiency and double-spelling on key turns.I think you should grab Full Steam Ahead when it happens to fit with your game plan. I don't think you should pick Full Steam Ahead early and try to build around it.\"}","{\"name\":\"Railway Brawler\",\"rating\":4.5,\"comment\":\"Spending four or five mana for a 5/5 reach, trampler would've been good enough for me already. But Railway Brawler also doubles the size of all future creatures!The common play pattern here will be to plot the Brawler, then cast it plus another creature in the same turn. In practice, what this means is that your opponent will have to spend their removal on the Brawler itself, and then still have to rumble with the 6/6 or 8/8 creature it helped generate.\"}","{\"name\":\"Spinewoods Paladin\",\"rating\":3.0,\"comment\":\"Spinewoods Paladin looks like OTJ's version of . My 3.0 rating is definitely generous, but I absolutely love this style of card, and can't wait to get my hands on some of these.\"}","{\"name\":\"Betrayal at the Vault\",\"rating\":3.5,\"comment\":\"Six mana is pricey, but Betrayal at the Vault will often result in killing your opponent's best two creatures at instant-speed. That will often result in a game win, and it's hard to imagine a better way to top out your curve. I'll feel betrayed if green mages don't start at least their first copy.\"}","{\"name\":\"Cactarantula\",\"rating\":2.0,\"comment\":\"Cactarantula is a totally solid filler creature that will often come down for the affordable price of five mana. I do think that  is better (plus whatever bomb uncommons and rares you wind up with). That means the Plant Spider will be a useful card, but a low-priority one.\"}","{\"name\":\"Spinewoods Armadillo\",\"rating\":3.0,\"comment\":\"Spinewoods Armadillo is a landcycler with upside - almost like a toned down version of . There's a ton to like here, ranging from the ability to search for any basic or a Desert to incidental life gain to putting a body into the graveyard for future synergies. And of course, when you do cast it as a creature, ward and reach is a lovely combination for stabilizing the battlefield. I love it.Top 5 Green CommonsGreen looks strong and deep, with no commons that I'd consider to be bad. It looks like a \\\"no-frills\\\" type of color, with most of the appealing cards being well-statted creatures, and I love that. The rares and mythics tend to either supercharge your team with +1/+1 counters, or else they're absolutely massive bodies on their own. I have no complaints about anything I've seen here, and I'm excited to dig in. \"}","{\"name\":\"Explosive Derailment\",\"rating\":3.0,\"comment\":\"Explosive Derailment is a solid removal spell at instant speed, and you even get to pick off an artifact here and there. This is a winner in my book.\"}","{\"name\":\"Great Train Heist\",\"rating\":3.5,\"comment\":\"I like Great Train Heist a lot - the main mode is 2R for +1/+0 and first strike, with the other two being situationally quite powerful. I like that you can play this is a strong mass pump spell and have it scale really well into the late game, as getting all the effects together likely ends the game. Make sure to draft enough creatures, and if you do, it's heist time.\"}","{\"name\":\"Hell to Pay\",\"rating\":3.0,\"comment\":\"Killing a creature and getting a couple Treasures isn't bad, with Hell to Pay scaling up as necessary throughout the game. It's never going to be the most efficient, but it does have a strong effect.\"}","{\"name\":\"Quick Draw\",\"rating\":1.5,\"comment\":\"This is a solid combat trick, but nothing too exciting. It's also somewhat offensive that the second Quick Draw beats the first - that's the opposite of what the name implies!\"}","{\"name\":\"Reckless Lackey\",\"rating\":3.0,\"comment\":\"One-drops don't appear to be getting any weaker here - Reckless Lackey is a solid beater at most points in the game, and you can cash it in for a card and a Treasure whenever you want. This also plays well with combat tricks, so grab a couple to play alongside your Lackeys.\"}","{\"name\":\"Brimstone Roundup\",\"rating\":1.0,\"comment\":\"If you can reliably churn out two spells per turn, this gives you a solid advantage over the course of the game. You kind of get one for free thanks to plot, and just need to get two more triggers before you've turned a profit. I hope this kind of deck is good, because setting up double-spell turns sounds like a lot of fun.\"}","{\"name\":\"Caught in the Crossfire\",\"rating\":3.0,\"comment\":\"I suspect this will be good in most games, even if it will take a little maneuvering. Pay close attention to your creature types while drafting and the opponent's while in play, since this makes them matter a ton.\"}","{\"name\":\"Cunning Coyote\",\"rating\":3.5,\"comment\":\"You get a lot of hasty stats from Wile E. here, with plot into a big attack looking juicy. This is also just a good two-drop, and any aggressive deck will be able to make good use of this.\"}","{\"name\":\"Deadeye Duelist\",\"rating\":3.0,\"comment\":\"Deadeye Duelist looks like a staple for a variety of decks. It blocks well, commits crimes at will and pecks the opponent's life total, all while being an outlaw. This is great across just about every strategy, and will be hotly contested.\"}","{\"name\":\"Demonic Ruckus\",\"rating\":3.5,\"comment\":\"Demonic Ruckus offers a good combo of stats and abilities, and even gets you your card back in the end. Add plot to that and you've got a strong card, one that any aggressive deck will be happy to include.\"}","{\"name\":\"Discerning Peddler\",\"rating\":1.5,\"comment\":\"If you need a two-drop, you can't afford to be too discerning (which is good, because this isn't anything special).\"}","{\"name\":\"Highway Robbery\",\"rating\":2.5,\"comment\":\"I like this a bit more than the usual effect of this type, mainly because it lets you sacrifice a land. That plus plot gives it a bump, and I bet that most double-spell decks will be quite happy to pick these up.\"}","{\"name\":\"Magda, the Hoardmaster\",\"rating\":4.0,\"comment\":\"Magda accumulates Treasures with ease, and even gives you a nice outlet for them. At just two mana, Magda is a massive win for any red deck, and a card that requires an immediate answer. The Dragons even have haste, making this into a verified bomb.\"}","{\"name\":\"Magebane Lizard\",\"rating\":1.5,\"comment\":\"Magebane Lizard is a decent sideboard card and a passable blocker, though I can't imagine most decks will be falling over themselves to run it. I suppose if you are aggressive and light on spells, this could be a decent way to get some chip damage in, but my inclination is to start this in the sideboard.\"}","{\"name\":\"Resilient Roadrunner\",\"rating\":3.5,\"comment\":\"A 2/2 haste for two that becomes nearly-unblockable in the late game is a good deal, and this looks like a solid way to fill out the two-drop slot.\"}","{\"name\":\"Return the Favor\",\"rating\":2.0,\"comment\":\"Return the Favor is a massive blowout if you can ever snipe a removal spell with it, and doubly so if you copy it as well. Unless you have some good cheap spells to copy, this is best left in the sideboard, but it will be absurd every time it goes on the stack.\"}","{\"name\":\"Scorching Shot\",\"rating\":3.5,\"comment\":\"Double red is a real cost, but five damage is five damage. I'll always be happy to run this, and if you get it early, try and draft heavy red to minimize the cost.\"}","{\"name\":\"Slickshot Show-Off\",\"rating\":3.5,\"comment\":\"Flying is what really does it here, as this can easily attack for three a turn starting immediately. Plot is a nice addition, and this will do some good showing off in most decks (though the rate is high enough that I'd play this in just about every deck).\"}","{\"name\":\"Thunder Salvo\",\"rating\":3.0,\"comment\":\"In most decks, this is a  that occasionally can be a , which is passable. With just a little work, you can get this to three or four damage easily, at which point it becomes premium removal. If you aren't good at double-spelling, you can pass this, but it won't be hard to make it work.\"}","{\"name\":\"Ferocification\",\"rating\":3.0,\"comment\":\"Ferocification is a powerful card, though it does run the risk of doing nothing. As long as you consistently have creatures you want to attack with, this will work, so make sure your count is high. It's nice that it makes small creatures hit harder and big creatures hard to block, with haste meaning your opponent is never completely safe.\"}","{\"name\":\"Gila Courser\",\"rating\":3.5,\"comment\":\"Gila Courser is an easy two-for-one, and I imagine it'll die the first time it attacks in most games. It does combine very nicely with combat tricks, so pick up a couple ways to give it first strike and you will profit wildly.\"}","{\"name\":\"Irascible Wolverine\",\"rating\":3.0,\"comment\":\"The Wolverine also gets you a nice two-for-one with minimal effort, and unless you are really under pressure, it's better to plot this and give yourself the best chance of playing your bonus card.\"}","{\"name\":\"Longhorn Sharpshooter\",\"rating\":4.0,\"comment\":\"Four mana for  plus a (delayed) 3/3 is awesome, and this isn't a card I expect to pass very often. I'd only cast this for three if I was desperate, since the four mana version is excellent (and even has secret reach).\"}","{\"name\":\"Mine Raider\",\"rating\":2.0,\"comment\":\"If you've got a ton of outlaws, this is a solid three-drop, and trample plays nicely with combat tricks. If you are unlikely to get the Treasure, this is cuttable, but most red decks will be happy to run it.\"}","{\"name\":\"Outlaws' Fury\",\"rating\":1.5,\"comment\":\"Getting a card back out of this is nice, but it's a little at odds given when you want to cast it.  this is not, though this is a fine inclusion in any aggressive outlaw deck.\"}","{\"name\":\"Prickly Pair\",\"rating\":3.0,\"comment\":\"Two-for-one creatures are always great these days, and Prickly Pair is no exception. You get two outlaws, 3/3 worth of stats and the 1/1 even has a useful ability. I'm in.\"}","{\"name\":\"Scalestorm Summoner\",\"rating\":3.0,\"comment\":\"If you can get one trigger from this, you are golden, and all it asks is to get to attack while you have something beefy in play. This even works nicely with pump effects, like say, a Mercenary +1/+0? Scalestorm Summoner is another creature that pays you off for playing combat tricks, so keep that in mind.\"}","{\"name\":\"Take for a Ride\",\"rating\":3.5,\"comment\":\"If you can set things up correctly, Take for a Ride is a very nice two for one. They attack you, you  something and then steal their 3/3 and block their other 3/3, leading to a hell of a blowout. If you don't have instant-speed crime options, this drops all the way to a 1.5, so it's important to fully support this.\"}","{\"name\":\"Hellspur Posse Boss\",\"rating\":4.0,\"comment\":\"The Boss is here, and they've got reinforcements by their side. Hellspur Posse Boss is a ton of stats, multiple on-board pumps and a haste ability that can keep paying dividends.\"}","{\"name\":\"Quilled Charger\",\"rating\":2.5,\"comment\":\"Quilled Charger is a beater if you can saddle it, and even if you can't still has decent stats. This is a great way to reward yourself for playing lots of creatures, with a good baseline and strong upside on top of that.\"}","{\"name\":\"Rodeo Pyromancers\",\"rating\":2.0,\"comment\":\"In the right deck, this is a great way to double-spell, and the stats are good enough that you can justify it basically anytime. Adding two mana is no joke, and I look forward to my second, third and even fourth rodeos at this rate.\"}","{\"name\":\"Stingerback Terror\",\"rating\":4.5,\"comment\":\"Stingerback Terror is a truly ridiculous card. You can plot it for just three mana, and hold off on playing it until your hand is nearly empty. If you are on the play and play two cards a turn starting on turn two, this comes out as a 4/4 already, and probably attacks as a 5/5 or even 6/6. Just be careful about bounce spells - they can shrink this unexpectedly.\"}","{\"name\":\"Hellspur Brute\",\"rating\":1.0,\"comment\":\"In the heavy outlaw deck, this can come down for two or three mana, which is a fantastic deal. It won't be on turn three (most games), but even one  already does it. I like Hellspur Brute - it's giving my shades of  (which was a house in Mirrodin).\"}","{\"name\":\"Iron-Fist Pulverizer\",\"rating\":1.5,\"comment\":\"In the right deck (a defensive double-spell deck), the Pulverizer will live up to its name. Most of the time, it'll ride the sideboard, since there are so many playables in this set.\"}","{\"name\":\"Terror of the Peaks\",\"rating\":5.0,\"comment\":\"If your opponent can't kill Terror, the game just ends. You play another creature, it shoots something and you have a 5/4 flier that they already couldn't deal with. If they can kill it, well, at least you made them lose three life. This card is a monster, and one of the scariest cards in the set.\"}","{\"name\":\"Trick Shot\",\"rating\":1.5,\"comment\":\"Killing a token as a bonus is nice, since there are plenty running around, but I'm not that interested in paying five mana to kill something. This is playable if you need removal, but best avoided if you have cheaper interaction.\"}","{\"name\":\"Calamity, Galloping Inferno\",\"rating\":5.0,\"comment\":\"Calamity comes down for six mana, immediately attacks and does so alongside two copies of whatever you want to send in. You can even saddle it with multiple creatures and make two different copies if you so desire, though I doubt that will be necessary most of the time. Line this up with an ETB creature for maximum value, though again, not likely needed to win.Top 5 Red CommonsRed has some nice commons, with multiple others that are about the same power level here. Prickly Pair stands out, but you can't really go wrong - there are not really any misses.\"}","{\"name\":\"Corrupted Conviction\",\"rating\":2.0,\"comment\":\"A functional reprint of , Corrupted Conviction can be played as a one-of in any old deck to sacrifice a creature targeted by a removal spell or throw away a disposable token for two cards. It's not obvious whether or not there'll be a dedicated sacrifice archetype in the format, but this is a fine card nonetheless.\"}","{\"name\":\"Forsaken Miner\",\"rating\":3.0,\"comment\":\"Starting off the game with a 2/2 can make for some highly aggressive openings. If your opponent is forced to trade with Forsaken Miner, it's quite easy to rebuy it from the graveyard one or more times over the course of the game.\"}","{\"name\":\"Insatiable Avarice\",\"rating\":2.0,\"comment\":\"I'm in for three mana and three life to draw three cards. I'm most certainly not in for three mana to tutor a card to the top of my library. Given that the stronger mode is triple-black, even the greediest among us can't consider this a high-value card. However, if I knew I was going to have 10+ Swamps in my deck, I'd take it and play with it.\"}","{\"name\":\"Nezumi Linkbreaker\",\"rating\":2.0,\"comment\":\"You'll likely want Nezumi Linkbreaker if you have two or more ways to make use of disposable bodies. You should likely skip it if you have no synergies, as it's rather unimpactful.\"}","{\"name\":\"Skulduggery\",\"rating\":3.0,\"comment\":\"Skulduggery was one of the most desirable combat tricks when it was first printed back in Ixalan. I expect it will be no different in Thunder Junction, and even has the additional appeal of being a low-cost way to commit a crime.\"}","{\"name\":\"Tinybones Joins Up\",\"rating\":1.0,\"comment\":\"A cool card that just doesn't really do much in Limited. One mana to make the opponent choose and discard is weak, and the dream scenario of triggering the ability two or three times doesn't move the needle enough. Perhaps the best thing about this card is the prospect of committing multiple crimes over the course of the game. It's not a disaster if you put this in your deck, but I think you'd rather have any creature join up instead of this.\"}","{\"name\":\"Tinybones, the Pickpocket\",\"rating\":3.5,\"comment\":\"Tinybones itself is extremely far above rate. One mana for a 1/1 deathtouch already threatens to block and trade up against stronger creatures. Plus, Tiny's ability can make for a huge swing when you connect in combat.Unfortunately, the opponent needs to have a nonland permanent in the graveyard before the ability is relevant. So this isn't some  that starts snowballing right on turn two. And later in the game, the opponent will very often have the ability to trade with Tiny if the ability would be scary. Given all of that, I'm willing to say \\\"above rate,\\\" but I'm not willing to say \\\"bomb.\\\"\"}","{\"name\":\"Unfortunate Accident\",\"rating\":3.0,\"comment\":\"For four mana you  a creature. For five mana you Murder a creature and get a token. And if you really need a buy-out, you can create a body for two mana. I like everything going on here, and would consider Unfortunate Accident to be premium removal.\"}","{\"name\":\"Binding Negotiation\",\"rating\":3.0,\"comment\":\"Binding Negotiation has the format-specific benefits of committing a crime and being able to pluck a plotted card from exile. The fact that you can take a card the opponent has already invested mana into makes Binding Negotiation a great version of what it is. While this effect is average in most formats, I'm going to start out planning to maindeck this in 100 percent of my black decks.\"}","{\"name\":\"Blood Hustler\",\"rating\":4.0,\"comment\":\"Committing crimes isn't trivial, but it's easy enough that Blood Hustler will probably grow to be a 3/3 or a 4/4 fairly quickly, and with minimal effort. Add the fact that it can commit it's own crimes (in addition to bleeding out opponents at a low life total), and you have a creature that's going to do a ton of work. This thing looks really scary, and I won't be surprised if it proves to be of first-pick quality.\"}","{\"name\":\"Caustic Bronco\",\"rating\":4.0,\"comment\":\"If Caustic Bronco is able to attack uncontested, then it's a . If it's able to attack while saddled, it's a Dark Confidant with no downside that can randomly spike the opponent for six or seven damage! This thing is squishy enough that it won't always survive several rounds of combat, but you really only need to get one or two cards out of it before it's very, very strong.\"}","{\"name\":\"Desert's Due\",\"rating\":3.0,\"comment\":\"The average deck will probably have a couple of deserts, meaning Desert's Due can kill small creatures in the early game and mid-sized creatures in the mid and late game. Add the ability to use it as a combat trick to take down larger creatures and we should really give this removal spell its due.\"}","{\"name\":\"Desperate Bloodseeker\",\"rating\":3.0,\"comment\":\"I'm reading this as two mana for a 2/2 lifelink that commits a crime, and I'm quite happy with that. If you don't need a crime and you're desperate to enable some graveyard synergies, you can mill yourself as well.\"}","{\"name\":\"Fake Your Own Death\",\"rating\":2.0,\"comment\":\"Sure. There's one of these in every set and they're usually okay. This one gives you a Treasure. Sure.\"}","{\"name\":\"Lively Dirge\",\"rating\":1.5,\"comment\":\"I'm not terribly excited about the Dirge. The best case scenario if you send two above-rate two drops from your graveyard to the battlefield, but I feel like you'll typically have to spend the extra mana to help set that up. At four or five mana with some setup and deckbuilding requirements, that doesn't seem like the liveliest payoff.\"}","{\"name\":\"Mourner's Surprise\",\"rating\":2.5,\"comment\":\"I think we have a surprise case of the common version being stronger than the uncommon version. Mourner's Surprise is like a two-mana  (granted you can't Gravedigger your Gravedigger in this case). Regardless, it looks much cleaner and simpler than . I'll be happy to start one of these in my black decks.\"}","{\"name\":\"Raven of Fell Omens\",\"rating\":2.5,\"comment\":\"There's a relatively higher likelihood that I'll misevaluate a card like Raven of Fell Omens. It's unusual and format-specific. It could range from the low end of \\\"under-rate for its mana cost\\\" to \\\"build-around for one of the best archetypes in the set.\\\" On day one, I'll say that it's between those two poles, hopefully leaning more towards the high side than the low.It seems like without much effort, a \\\"normal\\\" deck in this format will trigger the Raven two or three times in a medium-length game simply through the normal course of removal spells and abilities of creatures. That's pretty reasonable and balanced, and roughly makes up for the lack of a second point of power. However, to make it really good you want to find repeatable ways to commit crimes, like the ability on Blood Hustler.\"}","{\"name\":\"Servant of the Stinger\",\"rating\":3.5,\"comment\":\"Servant of the Stinger is a cool card, as a 1/3 deathtouch is already a nightmare to get into combat with. Without a ton of effort, you can put your opponent in a spot where they're making an unfavorable block, or else letting you upgrade Servant into your best card. With the way Play Boosters and bonus sheets factor into modern-day Limited, almost every deck has at least a couple of rares, and one of those is likely to sting!\"}","{\"name\":\"Shoot the Sheriff\",\"rating\":3.5,\"comment\":\"Shoot the Sherriff kills roughly half the creatures in the format, and does it at tremendous efficiency. I like that it's really good against Mounts, which will represent a lot of the largest creatures on the battlefield, and the ones that are most profitable to kill at instant-speed.While this will range in quality based on the opponent's deck, everyone will have targets. So I believe this is a case where you should take and play as many as you can get, and rarely sideboard them out. You want to be the one who shot the sheriff (and not the deputy).\"}","{\"name\":\"Treasure Dredger\",\"rating\":3.0,\"comment\":\"Treasure Dredger is a cool card that allows you to \\\"bank\\\" an unused mana on any turn for use later. Better yet, you might find other uses for the material, in which case you'll truly be rich.\"}","{\"name\":\"Vadmir, New Blood\",\"rating\":4.0,\"comment\":\"Vadmir is very similar to . It has better stats, but lacks an activated ability. In a heads-up situation, I wouldn't be surprised if Blood Hustler was actually better. That said, I suspect the two cards will both be great and will fall pretty close to one another in the pick order.\"}","{\"name\":\"Blacksnag Buzzard\",\"rating\":2.5,\"comment\":\"In the worst case scenario, you're paying three mana for a 2/1 flying. That's weak, but not disastrous. In the best case scenario, you're paying two mana for a 3/2 flying, which is massively above rate. Across the range of outcomes, and factoring some snags related to setting up optimal conditions, I consider Blacksnag Buzzard to be a strong filler-level creature.\"}","{\"name\":\"Kaervek, the Punisher\",\"rating\":4.0,\"comment\":\"Kaervek represents yet another payoff for committing crimes. Where other payoffs are about gradual accumulation of value, what makes Kaervek special is that a single well-executed crime can swing the game into your favor. So while repeatable crimes are still welcome, a single turn where you play a removal spell and then cast the best black card in your graveyard might be all you need. Kaervek is awesome, and will represent a \\\"must-kill-immediately\\\" from the opponent's perspective.Two notes that may not be obvious. First, if you cast a removal spell, Kaervek will trigger before the spell hits your graveyard, so you don't get to effortlessly double all of your spells. Second, Kaervek is a black-heavy commitment, as you'll want a density of both black mana and black spells. He'll be a lot weaker if black is your secondary color.\"}","{\"name\":\"Neutralize the Guards\",\"rating\":2.5,\"comment\":\"This type of effect can range from sideboard material to borderline bomb based on context and format. In this case, I love that it's an instant, that it commits a crime and that surveil 2 is tacked on as a substantial bonus. I'm starting out pretty high on Neutralize the Guards.\"}","{\"name\":\"Rakish Crew\",\"rating\":3.0,\"comment\":\"Rakish Crew is a powerful build-around card. It would be weak in a deck with no other outlaws, and amazing in a deck full of outlaws and sacrifice synergies. What remains is the important question of how strong we can expect it to be in a typical black deck. How worthwhile is Rakish Crew is 60 percent of your creatures are outlaws? My suspicion is that the enchantment will still be strong under those conditions, making it a card that will range from good to great depending on your deck.\"}","{\"name\":\"Rattleback Apothecary\",\"rating\":3.0,\"comment\":\"Rattleback Apothecary joins a posse of black creatures that are solid on their own, and get even better when you start committing crimes. The threat of giving your creatures either menace or lifelink on key turns makes both blocking and racing very difficult on your opponents, which is a deadly combination.\"}","{\"name\":\"Rush of Dread\",\"rating\":4.0,\"comment\":\"Rush of Dread can do a lot, and these effects have the potential to be very brutal. Picture the baseline scenario where the opponent has three creatures and you spend four mana to force them to sacrifice two of them. That's a great effect! While it is possible for Rush to wind up weaker than that, it's more likely to scale up in power than down. When you start attacking life total, cards in hand, or consider board stall situations, things can get really scary.\"}","{\"name\":\"Unscrupulous Contractor\",\"rating\":3.0,\"comment\":\"This type of card is always solid, where you have the optionality of a creature, a card-drawing spell (should you choose to sacrifice the Contractor itself) or a valuable sacrifice outlet. The plot ability won't give you a discount, but gives you greater flexibility to set things up. I'll sign up with the Unscrupulous Contractor.\"}","{\"name\":\"Vault Plunderer\",\"rating\":3.0,\"comment\":\"Vault Plunderer won't be as strong as  was in Streets of New Capenna. It also won't be as strong as  was in Murders at Karlov Manor. That said, an affordable creature that replaces itself is always great, and I hope to be caught red-handed with multiple Vault Plunderers in every draft deck.\"}","{\"name\":\"Boneyard Desecrator\",\"rating\":2.5,\"comment\":\"In the past I've overrated creatures with sacrifice-based activated abilities. That said, Boneyard Desecrator has reasonable stats and menace right up front, and I love that you can activate the ability at any time, rather than only at sorcery speed. There's no way this can be worse than a filler-level creature, and it could prove to be a bit better than that.\"}","{\"name\":\"Consuming Ashes\",\"rating\":2.5,\"comment\":\"Consuming Ashes is a little pricey, but you pay for quality. It's instant-speed, unconditional and even exiles the creature. Plus, surveil 2 is a nice bonus in the cases where you do wind up trading down on mana. I'm confident that the first copy will be a welcome addition to any black deck. Whether you'll be happy playing three or more copies remains to be seen.\"}","{\"name\":\"Pitiless Carnage\",\"rating\":1.5,\"comment\":\"Generally speaking, a permanent on the battlefield is going to be worth more than a card in your hand. However, there are some important exceptions, such as Treasure and Mercenary tokens, or excess lands in the very late game. I can envision games where you plot Pitiless Carnage, float a bunch of mana and draw eight cards off tokens and lands in the very late game.That said, you shouldn't put this in your deck without a very clear plan. If you find yourself sacrificing a land and your worst creature to draw two cards, you've gotten a terrible deal and I'll have no pity for you.\"}","{\"name\":\"Rictus Robber\",\"rating\":3.5,\"comment\":\"Once again we have a creature that needs to be evaluated across a range of possible outcomes. At worst, you have four mana for a 4/3 - passable but unexciting. At best, you have three mana for a 4/3 and a 2/2, which is game-breaking. I imagine that seeing the opponent plot Rictus Robber face up will make the game very stressful, as any future removal spell or trade in combat will allow them to generate a massive board. This is a big effect and an overall great card.\"}","{\"name\":\"Rooftop Assassin\",\"rating\":2.5,\"comment\":\"This creature takes a card template that has historically been \\\"just okay,\\\" and takes the power level through the roof. Flash, flying and lifelink are all great abilities, such that you won't mind passing with open mana and casting Assassin at the end of the turn, even when you can't kill a creature for your troubles.\"}","{\"name\":\"Gisa, the Hellraiser\",\"rating\":4.5,\"comment\":\"Gisa is a certified bomb. She's difficult to kill, and if you commit even one crime while she's on the battlefield, you're almost certain to win the game. Commit more crimes than that, and you're kind of just showing off.I can't justify a perfect 5.0 because Gisa technically does need some support. However, if your deck is anything better than Gisa and 39 Swamps, you're not gonna have a hard time making her work.\"}","{\"name\":\"Overzealous Muscle\",\"rating\":2.0,\"comment\":\"Overzealous Muscle is the first black creature that hasn't jumped off the page for me. It's totally fine as a filler creature to top off your mana curve, but it's not better than that. Don't be overzealous in picking these, as they'll float around the table relatively late.\"}","{\"name\":\"Ambush Gigapede\",\"rating\":2.5,\"comment\":\"Ambush Gigapede is a scary card. It can come down and pick off a small creature, or you can flash it in at the end of the turn to set up a massive attack. You're getting what you pay for, but six mana is a lot. I'd expect most decks to want the first copy, but to hesitate at playing multiples.\"}","{\"name\":\"Hollow Marauder\",\"rating\":3.5,\"comment\":\"Similarly, Hollow Marauder gives you a ton of value in exchange for a (potentially) high price tag. It's realistic to wind up with three-for-one card advantage (imagine your opponent has cards to discard, but doesn't have or doesn't want to discard something expensive) and a massive flier that can end the game in short order.You can probably expect to cast Marauder for five mana in the normal course of a Limited game. It's probably not worth going far out of your way to power this out, although if you get multiples there might be some interesting things you can do.Top 5 Black CommonsBlack looks awesome, and I had trouble narrowing the commons down to just five. Honorable mention to , which is a great card and deserves to be on the list. Honorable mention to , which is tricky to evaluate, and could wind up being a great build-around for a top archetype.Even more than the commons, black's uncommons look like absolute bangers. Some are highly-impactful standalones like  and . Others are fun build-arounds like  and . I'll say again that black looks incredible, and I can't wait to draft it! \"}","{\"name\":\"Harrier Strix\",\"rating\":2.5,\"comment\":\"I like the total package here - you get an aggressive flier, it can tap down blockers in the midgame and you can sink mana into it if you stall out. It also helps with the double-spell, theme, making it a card many decks at the table will be interested in.\"}","{\"name\":\"Jailbreak Scheme\",\"rating\":3.0,\"comment\":\"I love Jailbreak Scheme, and anticipate casting it many times. The baseline of 2U to top/bottom an artifact or creature is great, and I'd happily play numerous copies, so getting the option to make something bigger and unblockable is a treat. This is a strong card, and you'll be happy every time you see it.\"}","{\"name\":\"Metamorphic Blast\",\"rating\":2.0,\"comment\":\"Metamorphic Blast is a neat combination of a combat trick and card draw spell, even if neither is the most efficient. I'm definitely willing to go up on this after playing with it, since the possibility of a three-for-one is enticing.\"}","{\"name\":\"Phantom Interference\",\"rating\":3.0,\"comment\":\"This is a really pushed card, since you get the now-staple 1U counter unless they pay two with a flier tacked on later. You can even play it as just a flash flier if you want, which offers a ton of flexibility and power both.\"}","{\"name\":\"Take the Fall\",\"rating\":3.0,\"comment\":\"I like Take the Fall as a nice little combat trick that can become a nice big combat trick, and at the worst can just cycle. Don't sleep on this one, and be aware of it when getting into combat.\"}","{\"name\":\"Three Steps Ahead\",\"rating\":3.5,\"comment\":\"The choice of  plus instant-speed  (your team only) plus  is an impressive one, and sometimes you will even get all three. This is solid at any cost, and has enough options that it will always do something strong. I'd imagine the most common mode is 3UU counter target spell and draw two/discard, which is a card I'd be happy to play.\"}","{\"name\":\"Archmage's Newt\",\"rating\":2.5,\"comment\":\"Despite being the first 1U 2/2 with no drawback, this still isn't anything too amazing. It's a nice value creature when it hits, but getting a 2/2 with no evasion past blockers and needing a spell in the graveyard isn't the simplest task. I'd still play this to fill out your curve and threaten to get value, but it's not a high priority.\"}","{\"name\":\"Canyon Crab\",\"rating\":3.5,\"comment\":\"I'm high on the Crab, thanks to the good stats, cheap cost and free card selection. It won't be hard to get some loots from this, and they even show up on turns where you are heavy on lands. Crab is a sweet one, and good even in non-plot decks.\"}","{\"name\":\"Duelist of the Mind\",\"rating\":3.5,\"comment\":\"The Champ is here, and he's ready to start looting. Nathan hits hard, easily churns through your deck and does so at a low cost. This is a strong card, and worthy of being a World Champion indeed.\"}","{\"name\":\"Emergent Haunting\",\"rating\":3.5,\"comment\":\"Getting a 3/3 for 1U is a sick deal, even if you have to wait a little bit for it to materialize. With plot around, it shouldn't be too hard to spend your mana without playing a spell, and at worst you can surveil in order to flip this. I'd play this in any deck, though it clearly gets better when you have a bunch of plot cards or instants.\"}","{\"name\":\"Failed Fording\",\"rating\":2.0,\"comment\":\"The first bounce spell in your deck is worth a fair amount, though the returns diminish rapidly. The Desert part of this isn't super important, but it's a nice bonus to pick up.\"}","{\"name\":\"Fleeting Reflection\",\"rating\":1.0,\"comment\":\"Fleeting Reflection tries to do two things at once, but doesn't do a great job at either. It's a two-mana way to counter a removal spell (mediocre) or a weird combat trick that won't always work. I'm not big into this, though I can see the places where it can be wildly powerful.\"}","{\"name\":\"Jace Reawakened\",\"rating\":4.0,\"comment\":\"Jace is cheap enough that I'm always going to be happy to pick it up and play it. You may not be able to slam Jace early, but casting Jace on turn six alongside a four-drop is a great turn. You get to start looting and/or plotting, and the ultimate isn't weak either. At just two mana, Jace is a steal.\"}","{\"name\":\"Razzle-Dazzler\",\"rating\":3.0,\"comment\":\"The ol' Dazzler here takes some work to enable, but will be a strong part of any deck with plot and/or cheap spells. If you get just one counter in the first few turns, it's already good, and the second and third counter make this a fantastic deal.\"}","{\"name\":\"Shifting Grift\",\"rating\":1.0,\"comment\":\"For the most part, I think Shifting Grift is exactly what it's called - a grift. Giving them a creature is a huge cost, and unless you are making a really extreme swap, it's not worth the effort. This also gets blown out by removal or bounce, and the noncreature options are pretty much irrelevant.\"}","{\"name\":\"Spring Splasher\",\"rating\":3.0,\"comment\":\"I expect this to make the cut in any deck that plays to the board or is interested in committing crimes, since it's a free way to get that going. It's a good aggressive two-drop, and will open the door to some very nice attacks.\"}","{\"name\":\"The Key to the Vault\",\"rating\":1.0,\"comment\":\"The key to winning in Limited is to avoid playing Equipment that doesn't grant stats and requires your creature to hit them (and even costs five total to boot).\"}","{\"name\":\"Deepmuck Desperado\",\"rating\":3.0,\"comment\":\"Deepmuck Desperado seems sneakily good to me. At a low cost, you get a recurring win condition, and it even has passable stats for its cost. You do need to make sure you can trigger this, but that doesn't seem difficult - I'm glad this isn't common.\"}","{\"name\":\"Fblthp, Lost on the Range\",\"rating\":3.5,\"comment\":\"If you are able to take a turn off to cast this and play with a one-turn delay, Fblthp does provide some nice card advantage. This is cheap enough to be worth playing, but I suspect it will be slow enough that you won't always be able to make use of it.\"}","{\"name\":\"Geralf, the Fleshwright\",\"rating\":4.5,\"comment\":\"Your second spell gets you a 2/2, and your third a 3/3? This would be awesome if it stopped there, but it even has the dream of going deeper, making Geralf a windmill slam. This won't be hard to set up, and even just one 2/2 for free is enough to put it well over the top.\"}","{\"name\":\"Geyser Drake\",\"rating\":3.0,\"comment\":\"Geyser Drake gives you a great set of stats for the cost, which makes the ability all upside. This looks like a strong card in any blue deck, with bonus points if you plan on casting spells during the opposing turn.\"}","{\"name\":\"Nimble Brigand\",\"rating\":4.0,\"comment\":\"When Nimble Brigand is in play, anything you do will result in you drawing an extra card. This is a massive threat for just three mana and puts you ahead even if you just hit once. Pick this early, pick this often.\"}","{\"name\":\"Seize the Secrets\",\"rating\":2.5,\"comment\":\"The main question to answer here is whether your deck wants a . If you're happy enough playing that to begin with, this is pure upside, and will work especially nicely when you commit a crime that doesn't cost you any mana. I wouldn't quite call this a build-around, but it's at least close to that.\"}","{\"name\":\"Shackle Slinger\",\"rating\":3.0,\"comment\":\"Getting a half a stun (of sorts) is a great ability to have when you're double-spelling though, this is a bit feast or famine. Sometimes it'll be awesome, and sometimes non-functional, so just be aware of that when building your deck.\"}","{\"name\":\"Slickshot Lockpicker\",\"rating\":3.5,\"comment\":\"Assuming you have enough spells in your deck, this is a nice little 2 for 1. You just plot it and play it the turn you want to play a spell out of your bin, then just do that. It's really easy to pull off, with the main limiting factor just being spells - make sure you have some you want to flash back.\"}","{\"name\":\"Slickshot Vault-Buster\",\"rating\":2.0,\"comment\":\"The Vault-Buster will do solid work in crime-heavy decks, and at least blocks well regardless. It also lets you make free attacks into 2/2's and 3/3's, which will often result in damage getting through.\"}","{\"name\":\"Daring Thunder-Thief\",\"rating\":2.5,\"comment\":\"The Thunder Thief is a nice way to enable \\\"play no spells this turn\\\" cards, as you just get to fire it off at the end of the opponent's turn. It's also got solid stats, and is a decent filler card in any deck that needs more creatures. Don't worry, it really won't steal any thunder - this is about as middle-of-the-road as it gets.\"}","{\"name\":\"Double Down\",\"rating\":1.0,\"comment\":\"If you can pack your deck full of outlaws, this will go quite hard. Doubling Down is a risky strategy with a nice payoff, and this looks like a fun build-around. Once you've copied two things, you more than have your money back, and anything past that is a blowout.\"}","{\"name\":\"Loan Shark\",\"rating\":3.0,\"comment\":\"Waiting a turn to get an extra card isn't a big ask, and Loan Shark has stats that you can really brawl with. I like this, and would want to play it in decks that don't get behind early.\"}","{\"name\":\"Outlaw Stitcher\",\"rating\":4.0,\"comment\":\"At the very worst this is a 1/4 and a 2/2, and it's trivial to get a 4/4 or even a 6/6. That's a ton of value for 4/5 mana, and this looks like one of the mythic uncommons of the set.\"}","{\"name\":\"Plan the Heist\",\"rating\":2.0,\"comment\":\"The main issue I have with planning the heist is that you are spending mana and not affecting the board. This is a good payoff for stabilizing, so make sure your deck is one that can do so quickly.\"}","{\"name\":\"Stoic Sphinx\",\"rating\":4.5,\"comment\":\"A 5/3 hexproof with flash and flying for just four mana? Sign me up and say no more.\"}","{\"name\":\"Stop Cold\",\"rating\":2.0,\"comment\":\"This is passable blue removal, with the removal of abilities being a nice little touch.\"}","{\"name\":\"Visage Bandit\",\"rating\":3.0,\"comment\":\"If you have a lot of good creatures, this is a good way to take advantage of that. For three mana, you get to clone a four or five-drop, and all it took was having to wait a turn for the desired creature to show up. Don't play this with less than 12 creatures or so, and make sure you have at least a couple that you'd be excited to copy.\"}","{\"name\":\"Djinn of Fool's Fall\",\"rating\":3.0,\"comment\":\"This has good stats and comes out swinging - I like this cycle of commons, and they all look strong to me.\"}","{\"name\":\"Marauding Sphinx\",\"rating\":4.0,\"comment\":\"This Sphinx is hard to kill, a beast in combat and even gives you card selection. What's not to love? I'd play this in any deck, though it clearly gets better if you are committing crimes.\"}","{\"name\":\"Peerless Ropemaster\",\"rating\":2.0,\"comment\":\"The creature needing to be tapped takes away a lot of the power here, since bouncing blockers is a huge reason creatures like this are good. Still, this has solid stats and will put you ahead on board if your opponent has been attacking you.\"}","{\"name\":\"Step Between Worlds\",\"rating\":1.0,\"comment\":\"This is an optimistic 3.5, but I can imagine a world I'd like to step into, one where you can take turn six off and then fire this on turn seven, overwhelming your opponent with spells. Realistically, this is pretty bad, but it is at least powerful.\"}","{\"name\":\"This Town Ain't Big Enough\",\"rating\":3.5,\"comment\":\"Double-bounce for five mana isn't bad, and giving this a cheaper option if you cast  makes it very flexible. This is a powerful card, and one that will reward those who draft lots of ETBs and can use this tactically.Top 5 Blue CommonsBlue has some nice commons this time around, and all of them are tricky and give you lots of options. That's what I like to see, and I anticipate playing a lot of blue.\"}","{\"name\":\"Armored Armadillo\",\"rating\":2.5,\"comment\":\"Armored Armadillo is the type of card that typically gets deprioritized. It's not aggressive, not synergistic and doesn't fit into your dream curve-outs. All of that said, the stats are great and this Armadillo is very pushed! Every deck needs cheap creatures, and I'll be very happy to play Armored Armadillo as a defensive play that maintains (or increases) its value in the late game. Better in midrange and controlling decks than in pure aggro.\"}","{\"name\":\"Final Showdown\",\"rating\":5.0,\"comment\":\"Six to eight mana is rather pricey as board sweepers go, and triple white isn't trivial. However, Final Showdown is a  that kills all opposing creatures while leaving your best one intact. It also has a totally reasonable buy-out as a two mana trick to save one of your creatures. If you're missing land drops or ahead on the board, it'll be fine to use that rather than setting up for the late game.I toyed with a few different ratings for this one, but finally landed on a perfect 5.0. Don't pass it.\"}","{\"name\":\"Getaway Glamer\",\"rating\":2.5,\"comment\":\"For three mana you can  a big creature. For two mana you can save or blink a creature.You can also do both, though it seems tricky to get maximum value from both modes at once. It's more likely to come up if you want to hide your big creature while you kill there's, or if your opponent makes an alpha strike and you need to remove two attackers.\"}","{\"name\":\"Nurturing Pixie\",\"rating\":2.5,\"comment\":\"One mana for a 2/2 flying is an amazing rate, even if you are locked out of playing it on the first turn. However, there's a range of outcomes here. If you return a two-drop with no enters-the-battlefield ability, then the Pixie effectively costs you three mana. On the other hand, if you are able to reset a profitable ability, you can get a ton of bang for your buck.Since the worst case scenario is a cheap 1/1 flier, I'm viewing this as a good card that I'll want to put in my deck.\"}","{\"name\":\"Requisition Raid\",\"rating\":2.5,\"comment\":\"No individual mode would be good enough to play, but the combination of flexibility and high upside makes Requisition Raid fairly appealing. If you can destroy a relevant permanent and pick up two or three counters, you've gotten a lot of value.\"}","{\"name\":\"Rustler Rampage\",\"rating\":1.5,\"comment\":\"Rustler Rampage strikes me as the weakest of the sprees I've covered so far. You can certainly imagine it doing good work, but with lots of other good options and limited bandwidth for noncreature cards, I'm likely to pass on this one.\"}","{\"name\":\"Steer Clear\",\"rating\":2.0,\"comment\":\"Nice and efficient when you can kill a cheap creature or double-spell on an important turn, but I can't exactly call this a powerful card. Incidentally, powering it up with Mounts is cool, but not something I'd go far out of my way for.I see this as a marginal main deck option, or something I'll be very happy to sideboard in when on the draw against fast decks.\"}","{\"name\":\"Bovine Intervention\",\"rating\":2.0,\"comment\":\"Typically cards like this have been playable, but unexciting. Giving the opponent a 2/2 if quite a significant drawback, and means you'll rarely be very happy with any exchange you make. Still, you can certainly play this, or at least sideboard it in.\"}","{\"name\":\"Dust Animus\",\"rating\":5.0,\"comment\":\"Two mana for a 2/3 flying - sounds pretty good, huh? How about two mana for a 4/5 flying, lifelinker? Well, that's what we get these days. Dust Animus is completely unbelievable, and earns another flat 5.0 from me.\"}","{\"name\":\"Eriette's Lullaby\",\"rating\":2.5,\"comment\":\"I like the cheap mana cost and the two life tacked on. I dislike that Lullaby can't remove blockers, and that you may have to take a hit from an opposing attacker while you set up. Still, I think this will be very good for defensive decks.\"}","{\"name\":\"Frontier Seeker\",\"rating\":3.5,\"comment\":\"Getting a card off of Frontier Seeker results in Constructed-quality efficiency. Even when you miss, two mana for a 2/1 isn't a disaster. Considering the range of outcomes, I think this is an excellent card that will be on-par, or perhaps better than the best commons.With just nine Plains in your deck, you're around 70 percent to hit one, and I'd be happy to play those odds. If you have one or two powerful mounts to dig towards, you're talking about something truly special.\"}","{\"name\":\"High Noon\",\"rating\":1.0,\"comment\":\"Letting High Noon sit on the battlefield as an enchantment should be considered worthless. It might inconvenience the opponent, it might inconvenience you, but most likely it'll hardly have any impact at all. That leaves the option to spend seven mana for five damage in a Boros deck. While that's not useless, it's still inefficient. Overall, I'm quite low on this one.\"}","{\"name\":\"Omenport Vigilante\",\"rating\":3.0,\"comment\":\"Two mana for a 2/2 double-strike would be great, but I don't think Omenport Vigilante is quite that. Committing crimes will happen a few times in the course of the game, but it doesn't seem like you can count on it happening effortlessly every turn starting on turn three.So imagine you untap on turn three with Omenport Vigilante and the prospect that you're planning to commit a crime two turns from now. Is that enough of a payoff that you're going to protect Vigilante and take efforts to set up the double strike turn? Your two-drops lose value if you're unwilling to put them in combat, so I picture myself wanting to trade off in a lot of these situations.Maybe I'll be impressed, but right now I'm viewing the Vigilante as a  with some modest upside. That's still a solid card, but not exactly an ace in the hole.\"}","{\"name\":\"Outlaw Medic\",\"rating\":2.5,\"comment\":\"Since I like my two-drops to protect me and trade off for value, Outlaw Medic is a bit more my speed. This is a nightmare of a roadblock for folks trying to attack you aggressively, as they may need to spend removal or a combat trick to fight through the Medic, and leave you with a card and some life points in the exchange.\"}","{\"name\":\"Prairie Dog\",\"rating\":3.5,\"comment\":\"Prairie Dog is awesome. Two mana for a 2/2 lifelink is already good, and two mana for a 3/3 lifelink is genuinely bonkers. If Prairie Dog sits around for awhile, you can invest mana into its activated ability, or by plotting to set up for future turns. A cute little friend and a first-pick quality card.\"}","{\"name\":\"Sterling Keykeeper\",\"rating\":2.5,\"comment\":\"Probably a bit worse than the three two-drops covered above, but Sterling Keykeeper is still a totally solid body for the most important spot in your mana curve.\"}","{\"name\":\"Take Up the Shield\",\"rating\":2.5,\"comment\":\"Take Up the Shield was one of the most desirable combat tricks when it was printed in Dominaria United. I'm expecting nothing different in Thunder Junction.     \"}","{\"name\":\"Trained Arynx\",\"rating\":2.5,\"comment\":\"Trained Arynx is nothing terribly special, but there are payoffs for mounts in this format, and Arynx is as good as you're likely to get for this mana cost.\"}","{\"name\":\"Another Round\",\"rating\":0.0,\"comment\":\"This rare is designed for another format. It's not impossible to invent a scenario where it's useful, but this level of build-around and setup is typically not worthwhile in Limited. I recommend skipping this one.\"}","{\"name\":\"Aven Interrupter\",\"rating\":3.5,\"comment\":\"A flash flier that delays a spell has the potential to seriously interrupt the opponent's plans. However, I think the best part of the Aven is the passive ability which will tax all of their other plot cards for as long as it hangs out on the battlefield. It's not a game-winner on its own, but like all of white's best hatebears, Aven Interrupter does enough to put you in a great position in close games.\"}","{\"name\":\"Claim Jumper\",\"rating\":3.5,\"comment\":\"Three mana for a 3/3 vigilance is a pretty reasonable baseline for Limited these days. If you can get one or two Plains out of it - which you will fairly often - this card is great.\"}","{\"name\":\"Fortune, Loyal Steed\",\"rating\":3.5,\"comment\":\"Fortune gives you a lot for minimal effort. It's a nice defensive body that comes along with a scry and can attack with pseudo-vigilance (by blinking back to the battlefield untapped). If you're able to assemble some combos by blinking enters-the-battlefield triggers, you've created something really special.\"}","{\"name\":\"Holy Cow\",\"rating\":2.5,\"comment\":\"Holy Cow is not , but it is an above-rate flier that should pretty much always make your deck.\"}","{\"name\":\"Inventive Wingsmith\",\"rating\":2.0,\"comment\":\"Inventive Wingsmith can pick up a flying counter at a relatively low cost, but it won't do it in time to block the round you cast it, or to attack the turn following. This just seems like a filler-level creature.\"}","{\"name\":\"Mystical Tether\",\"rating\":3.0,\"comment\":\"Being a baseline  effect will likely land Mystical Tether as one of white's best removal spells in the format. I could be roped into playing this.\"}","{\"name\":\"One Last Job\",\"rating\":2.5,\"comment\":\"One Last Job has weak (though not disastrous) baseline of returning one creature for the price of four or five mana. However, if you can sprinkle in a handful of Mounts, Auras or Equipment, then you have a reasonable chance of returning multiple permanents, which is quite good.Overall, this card will have its big moments, but I'm not personally excited about it. Maybe I'm getting too old for this stuff.\"}","{\"name\":\"Sheriff of Safe Passage\",\"rating\":2.5,\"comment\":\"Expect to get a 3/3 for three mana, and be pleasantly surprised when you do better than that. You won't be able to call on the Sheriff on turn three if you want full value, but I think the discount you get by plotting more than makes up for requiring a bit of setup.\"}","{\"name\":\"Thunder Lasso\",\"rating\":2.5,\"comment\":\"I'm a hater on Equipment, and I dislike cards that don't perform well when you're on the back foot. So for me, that's already two strikes against Thunder Lasso. On the other hand, this is a real beating for anyone trying to block, so if you're confident you can get ahead and stay ahead, then this might be just the card for you.\"}","{\"name\":\"Vengeful Townsfolk\",\"rating\":2.5,\"comment\":\"Three mana for a 3/3 with a little upside is pretty much baseline rate these days. No complaints about Vengeful Townsfolk.\"}","{\"name\":\"Archangel of Tithes\",\"rating\":3.5,\"comment\":\"A triple-white mana cost is pretty taxing. But given that Archangel of Tithe has a bigger impact than most six-drop creatures, it's worth going out of your way for. You should be happy to play this with nine Plains, even with the understanding that you won't play it on-curve reliably. If you can get up to 11 or 12 Plains, you should be very excited.\"}","{\"name\":\"Bridled Bighorn\",\"rating\":2.5,\"comment\":\"Bridled Bighorn has decent stats. If it attacks once and trades off, you've gotten good value. If it actually gets to attack multiple times, then it can dominate a game. I'd consider this filler (but strong filler) for the four-mana slot.\"}","{\"name\":\"Lassoed by the Law\",\"rating\":4.0,\"comment\":\"Lassoed by the Law is unconditional removal for any card type and it gives a relevant creature token as a bonus. I'm forced to rate this as one of the best non-rares in the set. My hands are tied.\"}","{\"name\":\"Prosperity Tycoon\",\"rating\":3.0,\"comment\":\"As yet another solid card plus a token, Prosperity Tycoon is one that you should take reasonably highly and put in your deck.\"}","{\"name\":\"Wanted Griffin\",\"rating\":2.5,\"comment\":\"All of the non-rare four-drops are slightly different takes on a body plus a 1/1 token. As you might expect, the uncommon versions are very good, but the common versions of  and Wanted Griffin are totally fine as well. Three-power bodies with upside? What more can you want?\"}","{\"name\":\"Shepherd of the Clouds\",\"rating\":4.0,\"comment\":\"Shepherd of the Clouds is closer to  than I ever thought we'd get from a non-rare card. The stats are close to , and you get to  one of your cheaper creatures that had traded off earlier in the game. If you actually control a Mount when you do it, the on-the-board swing can only be described as pie in the sky.\"}","{\"name\":\"Stagecoach Security\",\"rating\":2.5,\"comment\":\"A decent body, an ability that helps you keep pushing damage and a plot ability that can give you a nice discount. It's hard to expect more from a common curve-topper.\"}","{\"name\":\"Sterling Supplier\",\"rating\":2.5,\"comment\":\"Everything I wrote about  holds true for Sterling Supplier. It's unclear which of these five-drops is stronger (I guess I'd give a slight nod to the flying Supplier). However, they're both solid-filler options for those looking to fill this spot on the mana curve.\"}","{\"name\":\"Bounding Felidar\",\"rating\":3.0,\"comment\":\"Not every draft deck wants six-drop creatures, but Bounding Felidar is powerful enough that most of them should make an exception. If this thing sticks around, its impact on the battlefield will feel more like a mythic rare. The only thing missing to make it a true bomb would be an enters-the-battlefield trigger, as it sadly can be answered cleanly by many removal spells.Top 5 White CommonsI suspect Outlaw Medic will be the most surprising pick on this list, but it's my type of card and I'm excited to play with it.White looks deep, with a pretty flat power level. All 15 of its commons seem perfectly playable, and 12 or 13 of those I'd consider good.Personally, I'm not usually much of a white mage, but it's refreshing to see that the power level isn't all centered in aggression and go-wide type of stuff in OTJ. Instead there's flexibility and card quality that should make white playable across a range of archetypes and strategies. \"}","{\"name\":\"Fell the Mighty\",\"rating\":3.5,\"comment\":\"It isn't that hard to set up Fell the Mighty, and it can be a huge swing when you do it right. Ideally you have a bunch of small creatures and they have some big ones, though reducing the board to like one creature on each side will do in a pinch. Note that you can target their creature, which plays better against removal (since removing the target in response stops the entire Wrath).\"}","{\"name\":\"Fierce Retribution\",\"rating\":3.0,\"comment\":\"You aren't casting this for six mana very often, but it's a fine defensive play at two.\"}","{\"name\":\"Journey to Nowhere\",\"rating\":3.5,\"comment\":\"Unconditional exiling removal is always great, with the only downside here being enchantment removal. Still, I'm always in for a Journey.\"}","{\"name\":\"Leyline Binding\",\"rating\":3.5,\"comment\":\"Leyline Binding at four mana is a totally fine deal, and you don't need to go out of your way to make this any better. Ironically, the five-color deck actually uses this worse than some two-color decks, since all the Deserts don't count as land types.\"}","{\"name\":\"Pariah\",\"rating\":1.0,\"comment\":\"I'm not really sold on Pariah. You can put it on one of their creatures and force them to attack and kill it if they want to start getting damage in, but a lot can go wrong. Their creature can still block, they can bounce or exile their creature and you take a ton of damage out of nowhere, or they can just have enchantment removal. I'll pass on this.\"}","{\"name\":\"Path to Exile\",\"rating\":4.0,\"comment\":\"This is about as good as removal gets. Path exiles anything for just one mana, at instant speed. The drawback is real, so try to wait as long as possible to cast this to minimize it.BlueLimited: 1.0 // 3.5I would have dismissed this if I hadn't had the chance to play with it already, and combining it with  is a real win condition. Turn three you plot the Slickshot, then turn five you Trap them end of turn. On your turn six, Slickshot comes in, you flashback the Trap, and they get milled for 26. That's enough to win most games, and if you see an early Trap, you could go for the deck.\"}","{\"name\":\"Archive Trap\",\"rating\":1.0,\"comment\":\"I would have dismissed this if I hadn't had the chance to play with it already, and combining it with  is a real win condition. Turn three you plot the Slickshot, then turn five you Trap them end of turn. On your turn six, Slickshot comes in, you flashback the Trap, and they get milled for 26. That's enough to win most games, and if you see an early Trap, you could go for the deck.\"}","{\"name\":\"Archmage's Charm\",\"rating\":1.5,\"comment\":\"The juice isn't really worth the squeeze on this one - Archmage's Charm is too hard to cast for the effects it offers, though if you did end up with 11 to 12 Islands in your deck, this is a strong card.\"}","{\"name\":\"Commandeer\",\"rating\":0.0,\"comment\":\"You'd have to have an absurd amount of blue cards and side this in against deck full of removal for it to be worth considering, and even then I'm skeptical.\"}","{\"name\":\"Essence Capture\",\"rating\":3.0,\"comment\":\"If you can swing the mana cost here, Essence Capture is a totally fine card. It counters a creature for just two mana, and even gives you a little bit of value to boot.\"}","{\"name\":\"Mana Drain\",\"rating\":4.5,\"comment\":\"Mana Drain is an amazing card, and certainly among the best cards in the set. If you ever drain something in the first three to four turns of the game, getting to slam six or seven mana worth of plays is an incredible swing. At worst, it's a two-mana counter, and most definitely worth stretching your mana for.\"}","{\"name\":\"Mindbreak Trap\",\"rating\":0.0,\"comment\":\"This is too expensive to cast and the alternate cost will never be online. It is indeed a trap.\"}","{\"name\":\"Repulse\",\"rating\":4.0,\"comment\":\"Repulse is just some good, clean fun. It's cheap and an instant, replaces itself and is great to cast on your own creatures or theirs. This is about as good as it gets when it comes to bounce.BlackLimited: 3.0If you can reliably get a Treasure out of this, I'm in.  with upside is nice, and this format hasn't seemed so fast that this puts you too far behind.\"}","{\"name\":\"Heartless Pillage\",\"rating\":3.0,\"comment\":\"If you can reliably get a Treasure out of this, I'm in.  with upside is nice, and this format hasn't seemed so fast that this puts you too far behind.\"}","{\"name\":\"Imp's Mischief\",\"rating\":1.0,\"comment\":\"This is a fantastic sideboard card against removal-heavy decks, but isn't something I'd be looking to maindeck. The life loss doesn't concern me, but the potential lack of targets does.\"}","{\"name\":\"Murder\",\"rating\":3.5,\"comment\":\"Murder looks solid in this set. There are plenty of medium to large creatures, the format isn't blazing fast and it even commits a crime.\"}","{\"name\":\"Overwhelming Forces\",\"rating\":1.0,\"comment\":\"This is a build-around, plain and simple. Most decks won't ever get to eight mana naturally, but if you can construct a good ramp/control deck, this will end the games where you cast it. I have high hopes that this is viable, and plan to try at as soon as I can.\"}","{\"name\":\"Reanimate\",\"rating\":4.5,\"comment\":\"Reanimate is incredibly efficient and quite powerful. Working on either graveyard is huge, and you can't beat the mana cost here. Don't sleep on Reanimate, it's amazing.\"}","{\"name\":\"Surgical Extraction\",\"rating\":0.0,\"comment\":\"Please don't play this card - it won't ever actually do anything.\"}","{\"name\":\"Thoughtseize\",\"rating\":3.0,\"comment\":\"Thoughtseize is a fine card, but certainly not as powerful as it is in Constructed. You are just trading one-for-one after all, and Limited decks rarely have the kinds of synergies that Thoughtseize excels at disrupting.RedLimited: 3.5Dealing four to a creature is a great place to start, and getting to nug your opponent for a little damage isn't bad either. Worst comes to worst, you can discard a bad hand for a new one too, making Collective Defiance a strong pickup.\"}","{\"name\":\"Collective Defiance\",\"rating\":3.5,\"comment\":\"Dealing four to a creature is a great place to start, and getting to nug your opponent for a little damage isn't bad either. Worst comes to worst, you can discard a bad hand for a new one too, making Collective Defiance a strong pickup.\"}","{\"name\":\"Crackle With Power\",\"rating\":1.0,\"comment\":\"This is just too expensive to be reliable in the average deck, and isn't quite as powerful a build-around as I'd like. The dream is casting this for eight mana, but if you haven't been attacking them, dealing 10 won't finish things off.\"}","{\"name\":\"Electrodominance\",\"rating\":2.5,\"comment\":\"Electrodominance is an inefficient removal spell that makes up for the cost by letting you cast a spell for free. That's hard to line up exactly right, and the net result is a card that's mostly clunky and sometimes passable.\"}","{\"name\":\"Fling\",\"rating\":1.0,\"comment\":\"In a deck with some  and an aggressive bent, Fling is pretty good. Otherwise, it's best left at home.\"}","{\"name\":\"Indomitable Creativity\",\"rating\":0.0,\"comment\":\"There are too many moving pieces required to get this to work, not the least of which is the mana cost and the fact that it might not hit anything particularly good.\"}","{\"name\":\"Skewer the Critics\",\"rating\":3.0,\"comment\":\"Skewer is solid at three mana and will occasionally have games where you sneak in damage and cast it for one mana, which makes it a decent removal spell overall.\"}","{\"name\":\"Skullcrack\",\"rating\":1.0,\"comment\":\"Face burn isn't that valuable in Limited, even if it does stop life gain.GreenLimited: 4.0Clear Shot plays out much better than you might think, as it often ends up being a combat trick that also kills something. When you cast this on your 3/3 that's being blocked by another 3/3, you'll see that as clear as day.\"}","{\"name\":\"Clear Shot\",\"rating\":4.0,\"comment\":\"Clear Shot plays out much better than you might think, as it often ends up being a combat trick that also kills something. When you cast this on your 3/3 that's being blocked by another 3/3, you'll see that as clear as day.\"}","{\"name\":\"Force of Vigor\",\"rating\":1.0,\"comment\":\"Force is worth considering as a sideboard option against a deck with multiple good targets, but you still won't want it most of the time. Pitching to cast it is unappealing, and hardcasting it is a bit expensive, so you really want to nab two things to make it worth it.\"}","{\"name\":\"Pest Infestation\",\"rating\":5.0,\"comment\":\"This is one of the best cards in the set. Pest Infestation blows up all of their artifacts and enchantments and leaves behind a ton of tokens. You don't even need any targets to cast this, so it's never dead, and getting a token per mana is an absurd rate. This is even splashable, so you basically should never pass it.\"}","{\"name\":\"Primal Command\",\"rating\":4.0,\"comment\":\"The most common pair of modes you'll choose on this are to put a land back on top and to go find a creature, making it a nice two-for-one. If you need to, gain some life instead, and in the super late game, a reshuffle can be nice.\"}","{\"name\":\"Primal Might\",\"rating\":3.5,\"comment\":\"Primal Might hits hard, as you get to eat a creature and bash the opponent for a ton of damage. This also can be as cheap or expensive as you need, making it flexible and powerful both.\"}","{\"name\":\"Thornado\",\"rating\":3.0,\"comment\":\"I'd be happy to maindeck this in any deck that could struggle with fliers, as cycling is an easy out if they don't have targets. This is a nice little sideboard card for Best-of-One decks, as maindecking it is very low cost.MulticolorLimited: 3.0Abrupt Decay is solid removal for Golgari decks, but not powerful enough to really be worth splashing (and being uncounterable is mostly irrelevant).\"}","{\"name\":\"Abrupt Decay\",\"rating\":3.0,\"comment\":\"Abrupt Decay is solid removal for Golgari decks, but not powerful enough to really be worth splashing (and being uncounterable is mostly irrelevant).\"}","{\"name\":\"Anguished Unmaking\",\"rating\":3.0,\"comment\":\"The life loss on this really matters, and takes it down a notch for sure. This is certainly playable, but nothing too exciting.\"}","{\"name\":\"Back for More\",\"rating\":3.5,\"comment\":\"If you can set this up nicely, it's a huge beating. Getting a creature plus a fight in one card is great, and this is exactly what GB self-mill/graveyard decks want.\"}","{\"name\":\"Bedevil\",\"rating\":3.0,\"comment\":\"This is about as easy to cast as  in a RB deck, and does about the same thing. It's fine, but not a signal that you should be in Rakdos or the like.\"}","{\"name\":\"Buried in the Garden\",\"rating\":4.0,\"comment\":\"Now this is what I'm talking about. Buried is a sick two for one that ramps/fixes you, and is easy to splash. I'm in.\"}","{\"name\":\"Crime // Punishment\",\"rating\":3.5,\"comment\":\"If you can cast both halves, this will do something good over the course of the game. It's a weird removal spell and a decent enemy-only , which is enough for me. I generally wouldn't play this for only half the card though - you do need to be Abzan.\"}","{\"name\":\"Cruel Ultimatum\",\"rating\":1.0,\"comment\":\"If you can make the mana work (and that's a big if), Cruel Ultimatum is a game-ender. I'd definitely try and build a multicolor deck with Treasures if I saw this early, but I'm not sure how viable that is yet.\"}","{\"name\":\"Decimate\",\"rating\":0.0,\"comment\":\"The joke with Decimate is that you need every target to cast it, which makes it essentially uncastable. Hard pass.\"}","{\"name\":\"Decisive Denial\",\"rating\":2.5,\"comment\":\"Neither mode here is all that exciting, so this is relegated to \\\"playable\\\" and nothing more.\"}","{\"name\":\"Detention Sphere\",\"rating\":3.5,\"comment\":\"Exile removal that can hit any permanent is nice, and every now and then you might even hit two things (though that's not very likely).\"}","{\"name\":\"Endless Detour\",\"rating\":1.5,\"comment\":\"The casting cost on this is a beating, especially since the effect is comparable to a card that costs 2U. I suppose I would play this in Five-Color Deserts, but you don't need to take it early.\"}","{\"name\":\"Fractured Identity\",\"rating\":5.0,\"comment\":\"If you've ever even seen this cast, much less cast it yourself, you know how big of a beating Fractured Identity is. You steal their best card and even get any ETB effects it has, and bounce doesn't even get them their card back. Fractured Identity is splashable, powerful and virtually unpassable.\"}","{\"name\":\"Hindering Light\",\"rating\":1.0,\"comment\":\"This is a great sideboard card, but a sideboard card nonetheless. I don't think it would be crazy to maindeck it, but I'd start with it in the side unless this format ends up being really high on removal.\"}","{\"name\":\"Humiliate\",\"rating\":3.0,\"comment\":\"If you can cast this early, it's a solid card, much like many of the two-color cards here. They aren't splashable, but they do good work in their color pair.\"}","{\"name\":\"Hypothesizzle\",\"rating\":4.0,\"comment\":\"I love Hypothesizzle. For five mana you get an instant-speed draw two, and then you can turn any spell in your hand into a zero-mana deal four. That's a great combination of effects, and I'm happy to splash this in any blue or red deck.\"}","{\"name\":\"Ionize\",\"rating\":3.0,\"comment\":\"And now we are back to non-splashable gold cards again - Ionize is perfectly fine in Izzet, but not worth stretching or.\"}","{\"name\":\"Oko, Thief of Crowns\",\"rating\":5.0,\"comment\":\"I'm baffled as to why this is a card we can open in booster packs - didn't we get enough last time? Oko is nigh unbeatable, and only costs three mana - three! The normal play pattern is to +2, then turn that Food into a 3/3, rinse and repeat. Sometimes you'll want to Elk their huge threat, and every now and then you can switch a Food for one of their creatures. However you do it, Oko is ridiculous.\"}","{\"name\":\"Outlaws' Merriment\",\"rating\":4.0,\"comment\":\"While you do have to wait a turn cycle to get a creature from this, they all have haste, and after a few turns you'll be in a great position. I'm taking this early when I see it, and trying to build a RW deck that can cast it easily (so a little heavier on the white). Funnily enough, only one of the three tokens is an actual outlaw, so keep that in mind.\"}","{\"name\":\"Ride Down\",\"rating\":3.0,\"comment\":\"RW aggro will be happy to scoop these up, since nobody else will be interested. Make sure you are indeed aggressive enough, since having this stuck in hand while getting beaten down sounds awful.\"}","{\"name\":\"Savage Smash\",\"rating\":3.5,\"comment\":\"Smashing their creature and hitting for a ton of damage is exactly what Gruul wants to do, and it has plenty of creatures ready to do it. Savage Smash is great, and plays into this color pair's natural tendencies.\"}","{\"name\":\"Siphon Insight\",\"rating\":3.0,\"comment\":\"Siphon Insight is solid, and a good way to get ahead in medium to slow games. It can be a little too weak if the game is fast, so make sure you've drafted enough defense.\"}","{\"name\":\"Terminal Agony\",\"rating\":1.5,\"comment\":\"There's not a ton of madness support in the set, making this a mediocre removal spell in most decks. If you can discard it, it's good, but even then it isn't busted.\"}","{\"name\":\"Tyrant's Scorn\",\"rating\":3.5,\"comment\":\"The flexibility and low cost sells me on this, and I'd be happy to play as many as I could get my hands on.\"}","{\"name\":\"Vanishing Verse\",\"rating\":3.0,\"comment\":\"Verse hits a ton of stuff in this format, though it is a shame that it will miss some of the best threats. I'm still taking this and running it if I'm WB, though I'm not quite as keen on splashing it.\"}","{\"name\":\"Villainous Wealth\",\"rating\":1.0,\"comment\":\"This is a classic build-around, and looks great in this format too. You just need to draft a multicolor ramp/control deck, and plan on casting this for X = 5 or more to win. That is actually feasible, and I'll slam this until I'm convinced it's a bad idea (good luck with that).\"}","{\"name\":\"Void Rend\",\"rating\":1.5,\"comment\":\"The cost on this is too difficult for what you get, limiting it to mostly the Five-Color Desert decks (which is a nice bonus for them).\"}","{\"name\":\"Voidslime\",\"rating\":2.5,\"comment\":\"In Simic, this is  with upside, which is at least worth considering.ArtifactsLimited: 4.0This used to be one of the best cards in the set, back in Scars of Mirrodin, but that was a long time ago. I still think the Engine is solid, since it shrinks their team immediately then finishes the job the next turn, but there will be some boards where this is too slow.\"}","{\"name\":\"Contagion Engine\",\"rating\":4.0,\"comment\":\"This used to be one of the best cards in the set, back in Scars of Mirrodin, but that was a long time ago. I still think the Engine is solid, since it shrinks their team immediately then finishes the job the next turn, but there will be some boards where this is too slow.\"}","{\"name\":\"Grindstone\",\"rating\":0.0,\"comment\":\"Unless you are in the five-color all removal mirror, Grindstone is way too slow to do anything.\"}","{\"name\":\"Mindslaver\",\"rating\":3.0,\"comment\":\"If you have the time to cast and use this, it will win a lot of games. It forces bad attacks, lets you use their removal on their own creatures and even passes the turn back to you when all is said and done.\"}","{\"name\":\"Unlicensed Hearse\",\"rating\":2.0,\"comment\":\"The Hearse does get pretty large in the late game, but it's slow enough that I wouldn't be in a hurry to get my license.LandsLimited: 0.0It would be funny to hose a Desert deck with this, but I doubt that's actually in the cards.\"}","{\"name\":\"Dust Bowl\",\"rating\":0.0,\"comment\":\"It would be funny to hose a Desert deck with this, but I doubt that's actually in the cards.\"}","{\"name\":\"Assimilation Aegis\",\"rating\":4.0,\"comment\":\"Exiling a creature for 1UW is already pretty good, and getting to wear that creature is pretty significant upside. You aren't usually targeting weak creatures with this, so it turns into a potent Equipment as well. You can technically exile your own creature if you really want to - it won't come up often, but could be the right play in some circumstances.\"}","{\"name\":\"Jem Lightfoote, Sky Explorer\",\"rating\":4.0,\"comment\":\"Between plot cards and instants, it's trivial to cast Jem and start drawing cards the turn after, with the \\\"fail case\\\" being a 3/3 flier with vigilance for just four mana. This card is awesome in any deck, and becomes a massive threat if you can reliably draw cards while plotting or casting instants.\"}","{\"name\":\"Wrangler of the Damned\",\"rating\":3.5,\"comment\":\"Wrangler is another great addition to the \\\"cast no spells\\\" deck, as it lets you trigger all your other cards by passing with it in hand (and pays you off big once in play). Plotting and instants are your friends here, though getting a 2/2 flier is strong enough that you can also just decline to cast spells if you need to.\"}","{\"name\":\"Satoru, the Infiltrator\",\"rating\":3.5,\"comment\":\"A 2/3 menace for two is already a solid playable, and getting to draw a card every time you plot a creature is great. This is a good card to take early and draft around, and will pay you off nicely in most cases.\"}","{\"name\":\"Intimidation Campaign\",\"rating\":1.5,\"comment\":\"If you are good at committing crimes, Intimidation Campaign is a pretty sweet draw engine. It's a good way to ensure you don't run out of gas in the late game, and as long as you can stabilize the board first, will likely win you the game.\"}","{\"name\":\"Lazav, Familiar Stranger\",\"rating\":4.0,\"comment\":\"This one I've already played with, and can verify that it's awesome. Lazav grows rapidly, and turning into other creatures can lead to some really sweet turns.\"}","{\"name\":\"Vial Smasher, Gleeful Grenadier\",\"rating\":3.5,\"comment\":\"Vial Smasher isn't a bomb, but you get a good cost/stat ratio and can ping them most turns. That's solid, and worth taking early.\"}","{\"name\":\"At Knifepoint\",\"rating\":1.0,\"comment\":\"In a crime-heavy deck, this is a good engine, and the Mercenaries stack quite nicely. First strike on your turn is a good deal too, making this a solid build-around.\"}","{\"name\":\"Laughing Jasper Flint\",\"rating\":4.0,\"comment\":\"Even by himself, Jasper Flint will have you laughing all the way to the bank. This essentially draws you an extra card every turn, and it starts snowballing as you stack up outlaws. This even starts to threaten to deck the opponent, if the game goes long enough.\"}","{\"name\":\"Akul the Unrepentant\",\"rating\":4.0,\"comment\":\"Assuming you can swing the cost (which means straight RB, pretty much), Akul is a gigantic threat. The ability won't come up almost ever, but the 5/5 flying trample part sure will.\"}","{\"name\":\"Rakdos Joins Up\",\"rating\":2.0,\"comment\":\"Getting a  with two +1/+1 counters is decent, but not super exciting. The legendary ping part is a nice bonus here and there, though not worth building around.\"}","{\"name\":\"Rakdos, the Muscle\",\"rating\":5.0,\"comment\":\"The stats on Rakdos are just absurd, and it's even got multiple great abilities. It's hard to kill, lets you sacrifice creatures to play spells off the opponent's deck and even mills them out in the late game. You aren't limited to just one spell either - when you exile five cards, you get to play as many as you want.\"}","{\"name\":\"Jolene, Plundering Pugilist\",\"rating\":3.5,\"comment\":\"Jolene hits hard, creates free Treasures, and even tosses them for value as needed. This is easy to make work in any RG deck, and delivers all by herself as well.\"}","{\"name\":\"Cactusfolk Sureshot\",\"rating\":3.5,\"comment\":\"Reach on a 4/4 with ward 2 is a great start, making this a sure shot to make your deck. Giving your other big creatures haste and trample is nice too, and this will fit nicely into every RG deck.\"}","{\"name\":\"Roxanne, Starfall Savant\",\"rating\":4.5,\"comment\":\"I remember the days when we cast  for five mana. Now you get a 4/3 that does it, and it even makes one when you attack too, as well as making the Meteorites tap for extra mana. You've got the green light to take Roxanne early and even splash for her - she's that good.\"}","{\"name\":\"Miriam, Herd Whisperer\",\"rating\":3.5,\"comment\":\"Miriam gets a lot of mileage out of just being a 3/2 for two, and when her ability is relevant, even better. This is a strong start to a GW Mount deck, and solid in any deck that can cast her early.\"}","{\"name\":\"Seraphic Steed\",\"rating\":4.0,\"comment\":\"Seraphic Steed is awesome. You get an awesome brawler that pays you off insanely well if saddled, and even if the Steed dies while making an Angel, you profit wildly. This is a windmill slam early pick, and asks nothing of you besides playing creatures.\"}","{\"name\":\"Congregation Gryff\",\"rating\":3.5,\"comment\":\"You don't need a lot of support for the Gryff to deliver, as it attacks as a 2/5 when saddled and is fine even as a 1/4. This plays offense and defense well, and loves teaming up with Miriam, Herd Whisperer.\"}","{\"name\":\"Wylie Duke, Atiin Hero\",\"rating\":1.5,\"comment\":\"If you can pick up some Mounts, Wylie will be one of the strongest cards in your deck. Tapping to get an extra card and a life is huge, and if you can enable it, this is going to carry you to victory (or rather, get carried to victory on whatever Mount he saddles).\"}","{\"name\":\"Selvala, Eager Trailblazer\",\"rating\":4.5,\"comment\":\"Great stats, provides free creatures and taps for a bunch of mana. This is all upside, and Selvala is definitely a winner.\"}","{\"name\":\"Kambal, Profiteering Mayor\",\"rating\":3.5,\"comment\":\"Kambal is a reasonable blocker and will pick up random value here and there, while paying you off if you are making tokens. That's plenty for three mana, and I'd always play this, even if I didn't have token-making in my own deck.\"}","{\"name\":\"Ruthless Lawbringer\",\"rating\":3.5,\"comment\":\"If your deck doesn't have any cannon fodder (tokens, cheap creatures, etc), this gets a little worse, but it's always going to be solid. It's a nice reward for being these colors, and worth going out of your way to enable.\"}","{\"name\":\"Baron Bertram Graywater\",\"rating\":2.0,\"comment\":\"If you are good at token-making, the Baron can pop off incredibly well. In a deck that doesn't make tokens, this is nothing special, so keep that in mind.\"}","{\"name\":\"Malcolm, the Eyes\",\"rating\":4.0,\"comment\":\"Malcolm is awesome - you get a hasty flying beater and a steady stream of Clues. Those Clues draw you into more spells, which make more clues, and so on.\"}","{\"name\":\"Slick Sequence\",\"rating\":3.5,\"comment\":\"This is easy as pie to get a card back from, and still fine even if you don't. I've cast this a bunch already, and it's been awesome every time.\"}","{\"name\":\"Breeches, the Blastmaker\",\"rating\":3.5,\"comment\":\"A 3/3 menace for three is decent, and this ability is pretty strong. You need artifacts and to cast multiple spells in a turn, but if you do, this is fairly high upside. You either get an extra spell or some free damage - unlike , this doesn't counter the spell.\"}","{\"name\":\"Lilah, Undefeated Slickshot\",\"rating\":2.5,\"comment\":\"A 3/3 prowess for three is a solid start, and if you ever trigger the ability, you are definitely going to be undefeated. A free spell is awesome, and double-dipping is extremely powerful.\"}","{\"name\":\"Kraum, Violent Cacophony\",\"rating\":4.0,\"comment\":\"Kraum is easy to utilize, and quite strong when it goes off. Just one trigger already puts you ahead, and it's trivial to get multiple if this survives.\"}","{\"name\":\"Pillage the Bog\",\"rating\":3.0,\"comment\":\"I'm not usually that high on Impulses, but this is a very powerful one. You get to look at a lot of cards, and even casting this on turn two is quite solid.\"}","{\"name\":\"Vraska Joins Up\",\"rating\":1.5,\"comment\":\"Team deathtouch isn't that strong on most boards, and having a legendary creature isn't something you can rely on. It's okay Vraska, you don't need to join the team.\"}","{\"name\":\"Honest Rutstein\",\"rating\":3.5,\"comment\":\"Rutstein is pure, honest, value, and I'm always going to patronize his shop. This brings back a creature and helps you cast it, making it a great card at any point in the game.\"}","{\"name\":\"Vraska, the Silencer\",\"rating\":3.5,\"comment\":\"It's a bummer that you need to pay to get Treasures here, but it's still a good ability. A 3/3 deathtouch isn't bad either, and Vraska is a solid card.\"}","{\"name\":\"Badlands Revival\",\"rating\":3.5,\"comment\":\"I'm loving this double , with one of the creatures even going straight into play. This plays well in GB value decks, and gets even better with a little self-mill.\"}","{\"name\":\"The Gitrog, Ravenous Ride\",\"rating\":4.0,\"comment\":\"I'd be into this without the saddle ability, and that's all gravy (delicious frog gravy). You can sacrifice a creature to draw a ton of cards, which goes nicely alongside your enormous hasty trample monster. Getting extra lands into play is nice too, since that helps you use the extra cards well.\"}","{\"name\":\"Form a Posse\",\"rating\":3.0,\"comment\":\" this is not, but it's still solid. I wouldn't go out of my to run this, but I'd play it if I was these two colors. It starts to get good at five mana, and past that is quite strong.\"}","{\"name\":\"Taii Wakeen, Perfect Shot\",\"rating\":3.0,\"comment\":\"Taii Wakeen will let you pick up some free cards here and there as a result. It will work with a couple cards in your deck, which may not be perfect, but it's enough.\"}","{\"name\":\"Bruse Tarl, Roving Rancher\",\"rating\":4.0,\"comment\":\"Bruse goes hard, and gets you tons of value no matter what you fit. You actually want to flip land on the first trigger, since a 2/2 double-strike Ox is a big game. If this lives, you will likely win, and is a two-for-one in the worst case scenario.\"}","{\"name\":\"Ertha Jo, Frontier Mentor\",\"rating\":3.5,\"comment\":\"Ertha is great value by itself, and doubling all Mercenary pumps is pretty sweet too. This fits nicely into any deck, and puts enough stats on the board that you are always happy.\"}","{\"name\":\"Doc Aurlock, Grizzled Genius\",\"rating\":3.5,\"comment\":\"I'm not sure how often Doc Aurlock will make things cheaper, but even once is enough for this to pay for itself. It's a solid place to start, and can get pretty nuts in the right deck.\"}","{\"name\":\"Oko, the Ringleader\",\"rating\":4.0,\"comment\":\"As an Elk factory, this is pretty strong, and it even can turn into creatures as need be. Drawing cards is a good ability as well, and Oko races to his ultimate fairly quickly. Old Oko this is not, but it's still great in Limited.\"}","{\"name\":\"Make Your Own Luck\",\"rating\":3.5,\"comment\":\"Getting to plot one of these makes this an awesome card draw spell, and I've been very impressed with it so far. You do have to take turn five off, but the payoff is definitely worth it. When you spike a six-drop, that's just game as long as you survive to cast it.\"}","{\"name\":\"Bonny Pall, Clearcutter\",\"rating\":5.0,\"comment\":\"This is the best card in the set, at least from my initial look. You not only get two massive monsters, but this triggers whenever you attack with anything, meaning it happens right away! Bonny Pall is absurd, and almost unbeatable.\"}","{\"name\":\"Eriette, the Beguiler\",\"rating\":1.0,\"comment\":\"There's no support for this and it costs tons of colors - I'd avoid it like the trap it is.\"}","{\"name\":\"Marchesa, Dealer of Death\",\"rating\":4.0,\"comment\":\"Assuming you can swing the mana cost, Marchesa provides a ton of value over time. She sits around, freeriding on the crimes other people commit, and drawing cards fuels more criminality. Sounds like an effective outlaw to me...\"}","{\"name\":\"Obeka, Splitter of Seconds\",\"rating\":1.0,\"comment\":\"I'm not sure why you'd want more upkeeps, but it's not for draft, that's clear.\"}","{\"name\":\"Ghired, Mirror of the Wilds\",\"rating\":1.0,\"comment\":\"If you are multicolor and have lots of tokens, this does go hard, but you need to build your deck around it for it to function. Making an X/X Elemental is your best bet, as copying that will pay dividends.\"}","{\"name\":\"Annie Joins Up\",\"rating\":1.5,\"comment\":\"If you can cast this easily, it's at least decent removal. The legendary trigger stuff mostly seems like a miss, but it could come up in some five-color decks.\"}","{\"name\":\"Annie Flash, the Veteran\",\"rating\":4.5,\"comment\":\"Annie Flash gets you tons of value on ETB and attack, and can even ambush something large. This is a great reason to be three colors, and I'd take it in a flash.\"}","{\"name\":\"Kellan Joins Up\",\"rating\":1.0,\"comment\":\"The juice isn't worth the squeeze here, as you need tons of legends for this to get you anything of value.\"}","{\"name\":\"Kellan, the Kid\",\"rating\":4.0,\"comment\":\"I've gotten to play this, and it's great. At three mana, you get a ton of stats and flying plus lifelink is great, with the effect coming into play anytime you plot something. A+ for the Kid here.\"}","{\"name\":\"Riku of Many Paths\",\"rating\":1.0,\"comment\":\"There aren't tons of modal spells around, but if you get three or four you want to play, Riku is pretty strong. You won't want this often, but when it's good, it's good.ArtifactsLimited: 2.0These actually pack a bit of a punch, and haste makes creatures into great top-decks later. I wouldn't always run these, but they could be good in creature-heavy decks.\"}","{\"name\":\"Lavaspur Boots\",\"rating\":2.0,\"comment\":\"These actually pack a bit of a punch, and haste makes creatures into great top-decks later. I wouldn't always run these, but they could be good in creature-heavy decks.\"}","{\"name\":\"Boom Box\",\"rating\":1.0,\"comment\":\"Boom Box is too expensive for my tastes, even if it hits three cards.\"}","{\"name\":\"Gold Pan\",\"rating\":1.5,\"comment\":\"Gold Pan seems playable, but not exciting. If you need the Treasure, the Equipment part isn't that great, and vice-versa, so I'm not sure where this fits.\"}","{\"name\":\"Mobile Homestead\",\"rating\":3.0,\"comment\":\"The crew cost is low enough here that I'd be inclined to try it, since getting free lands is always nice. You have to have a lot of creatures, but if you do, get mobile.\"}","{\"name\":\"Silver Deputy\",\"rating\":1.5,\"comment\":\"If you have to play this, it's passable, but I really don't want to play a 1/2 and skip my draw to get a land. The ability does help a bit, but I'm still unhappy to be running this.\"}","{\"name\":\"Tomb Trawler\",\"rating\":1.0,\"comment\":\"Unless decking yourself is a core strategy, I'd avoid this.\"}","{\"name\":\"Bandit's Haul\",\"rating\":1.0,\"comment\":\"I don't like mana rocks that cost three, even ones that might get you a card back here and there.\"}","{\"name\":\"Oasis Gardener\",\"rating\":1.5,\"comment\":\"The two life helps, but I'm still mostly avoiding this one. Multicolor decks have better fixing options, and this will die sometimes when you really need it to stick around.\"}","{\"name\":\"Redrock Sentinel\",\"rating\":2.5,\"comment\":\"In a defensive deck, Redrock Sentinel is a good long-game plan, and is one of the legions of 2/4's that will gum up the ground.\"}","{\"name\":\"Sterling Hound\",\"rating\":1.5,\"comment\":\"If you have to play this, you can, but it's a bit medium.\"}","{\"name\":\"Luxurious Locomotive\",\"rating\":1.5,\"comment\":\"The Train costs a lot, which makes me hesitant to take it early. It is nice that it generates a lot of Treasures, but getting this thing going is the real challenge.LandsCommon Ping DesertsLimited: 3.0These are virtually a 3.25, in that they are better than all but the premium commons, but aren't quite 3.5s. These fix your mana, ping your opponent and commit crimes, all in one tidy package. When in doubt, take the Desert.\"}","{\"name\":\"Arid Archway\",\"rating\":3.5,\"comment\":\"Bouncelands are still great, even colorless ones, and this gets you a bit of surveil value. I'd take this early even in non-Desert decks, and always would be thrilled to end up with one.\"}","{\"name\":\"Conduit Pylons\",\"rating\":3.0,\"comment\":\"This helps nicely with splashing, and surveil 1 isn't bad either. I'd play this in three-color decks or decks that care about Deserts, but usually not in two-color decks.\"}","{\"name\":\"Mirage Mesa\",\"rating\":3.0,\"comment\":\"This is a bit weaker than the ping Deserts, but still a solid way to fix your mana. I'm playing this in most two-color decks, and actively want it in decks with three or more colors.\"}","{\"name\":\"Sandstorm Verge\",\"rating\":1.5,\"comment\":\"This is by far the worst Desert, as it isn't good in the five-color Desert decks and most aggro decks can't afford colorless lands. If you have great mana, maybe it's workable, but I would mostly avoid it.\"}","{\"name\":\"Collector's Cage\",\"rating\":5.0,\"comment\":\"Collector's Cage is a low-cost way to continuously grow the size of your team. You can accumulate value with every turn that passes, and the fact that you can add counters at instant speed makes combat a nightmare for the opponent.That alone would be in borderline bomb range, probably earning something close to a 4.0. On top of it, you get hideaway 5 with an easy-to-achieve mission for casting a free spell. Imagine a bomb that comes along with casting the best spell from your top five cards at the same time. If that's not slamming the door on the opponent, I don't know what is.\"}","{\"name\":\"Grand Abolisher\",\"rating\":1.5,\"comment\":\"You can play with Grand Abolisher if you have nine or more Plains in your deck, but it's nothing to be excited about.\"}","{\"name\":\"Rest in Peace\",\"rating\":0.5,\"comment\":\"Mostly useless - maybe you could sideboard it in against a deck with multiple copies of .\"}","{\"name\":\"Oltec Matterweaver\",\"rating\":3.5,\"comment\":\"We know how strong creatures that generate multiple bodies can be. It's totally realistic to generate two or three, or even more tokens off of Oltec Matterweaver over the course of a game. That makes it a great card.\"}","{\"name\":\"Esoteric Duplicator\",\"rating\":1.0,\"comment\":\"I mostly see Esoteric Duplicator as a way to spend four mana to draw cards. That's pretty slow, but might be useful for some specific types of matchups. Maybe there are other uses out there, like pairing it with  to lock opponents out of the game. In any case, I'd skip it unless you have a specific and esoteric game plan in mind.\"}","{\"name\":\"Simulacrum Synthesizer\",\"rating\":0.0,\"comment\":\"You'd have to generate two constructs in order for Simulacrum Synthesizer to be worthwhile, and I don't think there's enough support to do that reliably. Even if you could jam-pack your deck with expensive artifacts, you'd then have a deck that barely functions in the games where you don't draw Synthesizer. This is another skip for me.\"}","{\"name\":\"Worldwalker Helm\",\"rating\":1.0,\"comment\":\"Okay, you have a Treasure token. Now every turn you can spend two mana and tap Worldwalker Helm to make a Treasure and a Map (which is kind of like spending one mana to make a Map). I think that alone is a bit too clunky and fidgety for me to buy in. Granted, you do pick up some additional value from your other token generation creating additional Maps. I guess you could play this if it really matched your deck and game plan, but it's not something to be excited about.\"}","{\"name\":\"Greed's Gambit\",\"rating\":2.5,\"comment\":\"Greed's Gambit is one of the more interesting cards on the Big Score bonus sheet. It gives you a tremendous amount of value up front, and then siphons away that value a third at a time in each end step.There are two bad case scenarios. The first comes if you can't close the game quickly enough and the end step triggers bleed you out over the course of a long game. The second is if your opponent lets one trigger happen and then destroys Greed's Gambit.In the absence of those two fail cases, the card is quite powerful and I think I'd be willing to try it. A tip is that you shouldn't slam it on turn four. Instead you should play out your hand and cast Greed's Gambit as your last card. If you can empty your hand the following turn, you can mitigate at least the discard aspect of the end step trigger.\"}","{\"name\":\"Hostile Investigator\",\"rating\":4.0,\"comment\":\"Hostile Investigator shows up as a crisp, clean three-for-one by making your opponent discard and giving you a clue. You can even pick up extra value if either you or your opponent discards additional cards later. An excellent card.\"}","{\"name\":\"Harvester of Misery\",\"rating\":4.0,\"comment\":\"Harvester of Misery doubles as a removal spell (basically ) or a five-drop creature. When you do cast it for five mana, it'll wipe up all of the small creatures on the battlefield. This is a symmetrical effect that in theory could wind up hurting you. However, given that you can build your deck, sculpt your game plan and choose your timing for when to cast it, having control over such a powerful effect is something you should be very happy about.\"}","{\"name\":\"Generous Plunderer\",\"rating\":2.5,\"comment\":\"I'm allergic to giving my opponents value - especially when that value comes in the form of mana. That said, Generous Plunderer also gives you a lot of value, and can hit pretty hard. I'm rating this as a passable two-drop. It might be better than the weaker end of common creatures, but I wouldn't take it over the premium ones.\"}","{\"name\":\"Legion Extruder\",\"rating\":3.5,\"comment\":\"Legion Extruder requires a little bit of building around, but the juice can be worth the squeeze. Coming down and  a creature gives it a reasonable floor, and if you can convert a Treasure or two into 3/3 Golems, then it's had a pretty massive impact on the game.\"}","{\"name\":\"Molten Duplication\",\"rating\":0.0,\"comment\":\"Molten Duplication can only be good if you've already stuck the landing on a powerful creature. And since the token only sticks around for one turn, it still might not do much. This is a hard pass for me.\"}","{\"name\":\"Memory Vessel\",\"rating\":0.0,\"comment\":\"Memory Vessel is a throwback to , and I think that's cool. Unfortunately, it leaves a lot to be desired for Limited play. You have to invest five mana, pass the turn and then get a symmetrical effect that your opponent might wind up taking more value from than you do. Honestly, the best use of this is probably trying to deck someone in a long game by exiling their last seven cards and passing the turn. But more realistically, you shouldn't play it at all.\"}","{\"name\":\"Territory Forge\",\"rating\":1.0,\"comment\":\"Don't maindeck Territory Forge, but I suppose you could sideboard it in against someone you has  or some bomb artifacts.\"}","{\"name\":\"Ancient Cornucopia\",\"rating\":2.0,\"comment\":\"Ancient Cornucopia ramps your mana and gains you life as the game goes long. Don't toss it in any old deck, but there could be some multicolor green strategies where this does some good work.\"}","{\"name\":\"Sandstorm Salvager\",\"rating\":4.0,\"comment\":\"We know how strong creatures that produce multiple bodies can be, and Sandstorm Salvager gives you a lot of power and toughness right up front. If it sticks around, it can permanently pump up the Golem token and any other token creatures you might have (like Mercenaries). That's very powerful, and one of the best things about this card is that they'll feel pressure to use their removal on the Salvager itself, leaving the larger Golem to go unanswered.\"}","{\"name\":\"Bristlebud Farmer\",\"rating\":4.5,\"comment\":\"Four mana for a 5/5 trample - need I go on? Well, you also get two Food tokens when it enters the battlefield. Need more? Well, when you attack, you can also convert those Food into real, genuine cards in your hand so you never have to take your foot off the gas pedal.\"}","{\"name\":\"Omenpath Journey\",\"rating\":1.5,\"comment\":\"I have a soft spot for long-term value cards like Omenpath Journey. If the game goes on indefinitely, you can get five-for-one card advantage and improve your draw steps by thinning your deck of lands!Unfortunately, most games are not going to play out in anything close to that way. The value of getting a land five turns from now can pretty much round down to zero, so in the end I gave this the same rating as . In both cases, you can play it if you actually have a multicolor, ramp, Deserts style of deck. Otherwise, you should skip these slow and clunky cards.\"}","{\"name\":\"Vaultborn Tyrant\",\"rating\":3.5,\"comment\":\"Vaultborn Tyrant is very expensive. On the other hand, you've exceptionally likely to win if you can resolve it. You get a 6/6 trample, three life, plus a card. If it sticks around, you can trigger the ability additional times by casting more creatures. And if your opponent kills it (either in combat or with destroy-based removal), you duplicate it and trigger it again. This is the type of seven-drop I'm willing to take early and build around.\"}","{\"name\":\"Pest Control\",\"rating\":1.0,\"comment\":\"You're more often cycling Pest Control than anything else, although there are some corner-case situations where it could be useful.\"}","{\"name\":\"Loot, the Key to Everything\",\"rating\":2.0,\"comment\":\"I would play Loot if my mana supported him, but I wouldn't go far out of my way for him. It shouldn't be difficult to exile one or two cards each turn, which can provide a lot of value. However, the combination of being slow, being fragile, and having a demanding mana cost really dampens the appeal.\"}","{\"name\":\"Lost Jitte\",\"rating\":2.5,\"comment\":\"As you might expect, much is lost when you cut the impact of  in half. The modes and mana costs are different, but the key here is only getting one charge counter per combat instead of two. The best outcome here is picking up a handful of counters over the course of the game and then cashing them in to win a key combat step. I would play Lost Jitte if I got it, but I'm skeptical of this being among the best cards in the set.\"}","{\"name\":\"Torpor Orb\",\"rating\":0.0,\"comment\":\"Torpor Orb is a Constructed-only card. Skip.\"}","{\"name\":\"Lotus Ring\",\"rating\":3.0,\"comment\":\"I doubt you'll want to be sacrificing creatures for mana all that often, but +3/+3 and vigilance attached to an indestructible Equipment is a big game. Once you overcome the initial mana investment, Lotus Ring will have a large and favorable impact on the game.\"}","{\"name\":\"Sword of Wealth and Power\",\"rating\":3.0,\"comment\":\"Like  and , I'm putting Sword of Wealth and Power in the category of \\\"good, but maybe not as good as we want it to be.\\\" One of the best aspects of the other Swords is protection from colors, but the protections granted by Sword of Wealth and Power don't help you go unblocked or win combat exchanges (they can even prevent you from casting your own combat tricks!). Creating a Treasure is a nice upside, and copying instants and sorceries is of hugely variable value.I actually played with Sword of Wealth and Power during the Magic Arena Early Access Event. It was good for me, but it wasn't quite as impressive as some of the other bombs I've seen.\"}","{\"name\":\"Transmutation Font\",\"rating\":2.5,\"comment\":\"Let's not get hung up on the second ability, which would require drafting an additional rare or mythic artifact. Instead, look at Transmutation Font as a way to generate Clues every turn, allowing you to translate two mana into a card more or less as often as you like. While Clues are generally better than foods, being able to mix them as you see fit is actually quite nice, since you can drag out the game with life gain and then win with card advantage.Overall, Transmutation Font is a slow card, but will be useful for certain decks and matchups.\"}","{\"name\":\"Nexus of Becoming\",\"rating\":3.5,\"comment\":\"Nexus of Becoming provides the static ability of drawing an extra card each turn, but with two significant upsides. First, you get a card right away rather than having to wait a full turn cycle. Second, you can cash in a creature or artifact from your hand to make a 3/3 blocker. This is definitely most important on the turn you cast it, since you're investing a lot of mana for no real board impact, and being able to generate a quick blocker can be the difference between falling behind or keeping up.\"}","{\"name\":\"Fomori Vault\",\"rating\":2.5,\"comment\":\"Fomori Vault is a pretty cool card. With just a single artifact, it can serve as a  that lets you rummage away extra lands. If you can assemble multiple artifacts, then your ability to dig towards your best cards is further enhanced. In one sense there's a high deckbuilding cost of needing artifacts. On the other hand, the required investment is very low because Vault is just a land. I'll be happy to pick up Fomori Vault if I ever see one in a pack.\"}","{\"name\":\"Tarnation Vista\",\"rating\":2.0,\"comment\":\"Don't get confused by all of the extra text. Tarnation Vista is the same card as  except that it's a little worse due to not being a Desert.Special GuestsLimited: 3.5The main set of OTJ has three Equipment at common and uncommon. It shouldn't be too tricky to pick one up, in which case Stoneforge Mystic becomes a great card.\"}","{\"name\":\"Stoneforge Mystic\",\"rating\":3.5,\"comment\":\"The main set of OTJ has three Equipment at common and uncommon. It shouldn't be too tricky to pick one up, in which case Stoneforge Mystic becomes a great card.\"}","{\"name\":\"Brazen Borrower\",\"rating\":4.0,\"comment\":\"Brazen Borrower isn't quite a bomb, but it's very far above rate and gives you some nice control over the direction of the game.\"}","{\"name\":\"Desertion\",\"rating\":3.5,\"comment\":\"Wow, talk about some blow-out potential! Desertion can create a massive swing in a game, and it's almost impossible for anyone to ever play around it due to its high rarity (let's be honest, most of your opponents won't know the card even exists). It's even a little better due to plot, since you can have a better concept of when to hold mana open for your counter.I can't give Desertion a true bomb rating because there will be some games where you're too far behind and can't afford to pass with all that mana open. On the other hand, I'm sure some of the wildest stories of OTJ Limited will involve this card.\"}","{\"name\":\"Morbid Opportunist\",\"rating\":3.5,\"comment\":\"Morbid Opportunist was really good when it was originally printed in Innistrad: Midnight Hunt. It will be really good here as well.\"}","{\"name\":\"Port Razer\",\"rating\":1.5,\"comment\":\"Port Razer is cool and exciting when it deals combat damage to the opponent, but helps it with neither brawling, nor with surviving to attack the turn after you play it. I think this is likely worse than the common five-drops.\"}","{\"name\":\"Scapeshift\",\"rating\":0.0,\"comment\":\"Scapeshift is a Constructed-only card. Skip.\"}","{\"name\":\"Mystic Snake\",\"rating\":3.0,\"comment\":\"Like , Mystic Snake is a strong card that gets a little better when plot can help to inform your decisions. I've bumped it down half a grade due to the multicolor mana cost, and because a 2/2 body just ain't what it used to be.\"}","{\"name\":\"Notion Thief\",\"rating\":3.0,\"comment\":\"There isn't a ton of outright card drawing in OTJ. That said, you only need to steal one card for Notion Thief to be outrageously strong. You should take this card if you're drafting Dimir.\"}","{\"name\":\"Desert\",\"rating\":3.0,\"comment\":\"An untapped Desert can prevent one-toughness creatures from attacking, help your blockers trade up against slightly larger creatures and help you commit crimes with ease. That's worthwhile, and I'd be willing to take Desert and play it in any deck.\"}","{\"name\":\"Prismatic Vista\",\"rating\":3.0,\"comment\":\"A quality, untapped mana fixer that works even in two-color decks. You should take Prismatic Vista over anything that isn't a premium card for your deck.\"}"]